/* automatically generated by rust-bindgen 0.72.1 */

#[doc = " A constant id is a unique identifier for a constant in the constant pool.\n"]
pub type pm_constant_id_t = u32;
#[doc = " The type of bucket in the constant pool hash map. This determines how the\n bucket should be freed.\n"]
pub type pm_constant_pool_bucket_type_t = ::std::os::raw::c_uint;
#[doc = " The type of the string. This field determines how the string should be freed.\n"]
pub type pm_string_t__bindgen_ty_1 = ::std::os::raw::c_uint;
#[doc = " This enum represents every type of token in the Ruby source.\n"]
pub type pm_token_type = ::std::os::raw::c_uint;
#[doc = " A list of nodes in the source, most often used for lists of children.\n"]
pub type pm_node_list_t = pm_node_list;
#[doc = " This is the type of node embedded in the node struct. We explicitly control\n the size of it here to avoid having the variable-width enum.\n"]
pub type pm_node_type_t = u16;
#[doc = " These are the flags embedded in the node struct. We explicitly control the\n size of it here to avoid having the variable-width enum.\n"]
pub type pm_node_flags_t = u16;
#[doc = " This is the base structure that represents a node in the syntax tree. It is\n embedded into every node type.\n"]
pub type pm_node_t = pm_node;

    #[doc = " When parsing block exits (e.g., break, next, redo), we need to validate\n that they are in correct contexts. For the most part we can do this by\n looking at our parent contexts. However, modifier while and until\n expressions can change that context to make block exits valid. In these\n cases, we need to keep track of the block exits and then validate them\n after the expression has been parsed.\n\n We use a pointer here because we don't want to keep a whole list attached\n since this will only be used in the context of begin/end expressions.\n"]
    pub current_block_exits: *mut pm_node_list_t,
    #[doc = " The version of prism that we should use to parse.\n"]
    pub version: pm_options_version_t,
    #[doc = " The command line flags given from the options.\n"]
    pub command_line: u8,
    #[doc = " Whether or not we have found a frozen_string_literal magic comment with\n a true or false value.\n May be:\n  - PM_OPTIONS_FROZEN_STRING_LITERAL_DISABLED\n  - PM_OPTIONS_FROZEN_STRING_LITERAL_ENABLED\n  - PM_OPTIONS_FROZEN_STRING_LITERAL_UNSET\n"]
    pub frozen_string_literal: i8,
    #[doc = " Whether or not we are parsing an eval string. This impacts whether or not\n we should evaluate if block exits/yields are valid.\n"]
    pub parsing_eval: bool,
    #[doc = " Whether or not we are parsing a \"partial\" script, which is a script that\n will be evaluated in the context of another script, so we should not\n check jumps (next/break/etc.) for validity.\n"]
    pub partial_script: bool,
    #[doc = " Whether or not we're at the beginning of a command.\n"]
    pub command_start: bool,
    #[doc = " Whether or not we're currently recovering from a syntax error.\n"]
    pub recovering: bool,
    #[doc = " This is very specialized behavior for when you want to parse in a context\n that does not respect encoding comments. Its main use case is translating\n into the whitequark/parser AST which re-encodes source files in UTF-8\n before they are parsed and ignores encoding comments.\n"]
    pub encoding_locked: bool,
    #[doc = " Whether or not the encoding has been changed by a magic comment. We use\n this to provide a fast path for the lexer instead of going through the\n function pointer.\n"]
    pub encoding_changed: bool,
    #[doc = " This flag indicates that we are currently parsing a pattern matching\n expression and impacts that calculation of newlines.\n"]
    pub pattern_matching_newlines: bool,
    #[doc = " This flag indicates that we are currently parsing a keyword argument.\n"]
    pub in_keyword_arg: bool,
    #[doc = " Whether or not the parser has seen a token that has semantic meaning\n (i.e., a token that is not a comment or whitespace).\n"]
    pub semantic_token_seen: bool,
    #[doc = " True if the current regular expression being lexed contains only ASCII\n characters.\n"]
    pub current_regular_expression_ascii_only: bool,
    #[doc = " By default, Ruby always warns about mismatched indentation. This can be\n toggled with a magic comment.\n"]
    pub warn_mismatched_indentation: bool,
}
#[doc = " A stack of lex modes.\n"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pm_parser__bindgen_ty_1 {
    #[doc = " The current mode of the lexer.\n"]
    pub current: *mut pm_lex_mode_t,
    #[doc = " The stack of lexer modes.\n"]
    pub stack: [pm_lex_mode_t; 4usize],
    #[doc = " The current index into the lexer mode stack.\n"]
    pub index: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_newline_list_t"][::std::mem::size_of::<pm_newline_list_t>() - 32usize];
    ["Alignment of pm_newline_list_t"][::std::mem::align_of::<pm_newline_list_t>() - 8usize];
    ["Offset of field: pm_newline_list_t::start"]
        [::std::mem::offset_of!(pm_newline_list_t, start) - 0usize];
    ["Offset of field: pm_newline_list_t::size"]
        [::std::mem::offset_of!(pm_newline_list_t, size) - 8usize];
    ["Offset of field: pm_newline_list_t::capacity"]
        [::std::mem::offset_of!(pm_newline_list_t, capacity) - 16usize];
    ["Offset of field: pm_newline_list_t::offsets"]
        [::std::mem::offset_of!(pm_newline_list_t, offsets) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_integer_t"][::std::mem::size_of::<pm_integer_t>() - 24usize];
    ["Alignment of pm_integer_t"][::std::mem::align_of::<pm_integer_t>() - 8usize];
    ["Offset of field: pm_integer_t::length"]
        [::std::mem::offset_of!(pm_integer_t, length) - 0usize];
    ["Offset of field: pm_integer_t::values"]
        [::std::mem::offset_of!(pm_integer_t, values) - 8usize];
    ["Offset of field: pm_integer_t::value"][::std::mem::offset_of!(pm_integer_t, value) - 16usize];
    ["Offset of field: pm_integer_t::negative"]
        [::std::mem::offset_of!(pm_integer_t, negative) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_encoding_t"][::std::mem::size_of::<pm_encoding_t>() - 48usize];
    ["Alignment of pm_encoding_t"][::std::mem::align_of::<pm_encoding_t>() - 8usize];
    ["Offset of field: pm_encoding_t::char_width"]
        [::std::mem::offset_of!(pm_encoding_t, char_width) - 0usize];
    ["Offset of field: pm_encoding_t::alpha_char"]
        [::std::mem::offset_of!(pm_encoding_t, alpha_char) - 8usize];
    ["Offset of field: pm_encoding_t::alnum_char"]
        [::std::mem::offset_of!(pm_encoding_t, alnum_char) - 16usize];
    ["Offset of field: pm_encoding_t::isupper_char"]
        [::std::mem::offset_of!(pm_encoding_t, isupper_char) - 24usize];
    ["Offset of field: pm_encoding_t::name"][::std::mem::offset_of!(pm_encoding_t, name) - 32usize];
    ["Offset of field: pm_encoding_t::multibyte"]
        [::std::mem::offset_of!(pm_encoding_t, multibyte) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_id_list_t"][::std::mem::size_of::<pm_constant_id_list_t>() - 24usize];
    ["Alignment of pm_constant_id_list_t"]
        [::std::mem::align_of::<pm_constant_id_list_t>() - 8usize];
    ["Offset of field: pm_constant_id_list_t::size"]
        [::std::mem::offset_of!(pm_constant_id_list_t, size) - 0usize];
    ["Offset of field: pm_constant_id_list_t::capacity"]
        [::std::mem::offset_of!(pm_constant_id_list_t, capacity) - 8usize];
    ["Offset of field: pm_constant_id_list_t::ids"]
        [::std::mem::offset_of!(pm_constant_id_list_t, ids) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_pool_bucket_t"]
        [::std::mem::size_of::<pm_constant_pool_bucket_t>() - 8usize];
    ["Alignment of pm_constant_pool_bucket_t"]
        [::std::mem::align_of::<pm_constant_pool_bucket_t>() - 4usize];
    ["Offset of field: pm_constant_pool_bucket_t::hash"]
        [::std::mem::offset_of!(pm_constant_pool_bucket_t, hash) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_t"][::std::mem::size_of::<pm_constant_t>() - 16usize];
    ["Alignment of pm_constant_t"][::std::mem::align_of::<pm_constant_t>() - 8usize];
    ["Offset of field: pm_constant_t::start"]
        [::std::mem::offset_of!(pm_constant_t, start) - 0usize];
    ["Offset of field: pm_constant_t::length"]
        [::std::mem::offset_of!(pm_constant_t, length) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_pool_t"][::std::mem::size_of::<pm_constant_pool_t>() - 24usize];
    ["Alignment of pm_constant_pool_t"][::std::mem::align_of::<pm_constant_pool_t>() - 8usize];
    ["Offset of field: pm_constant_pool_t::buckets"]
        [::std::mem::offset_of!(pm_constant_pool_t, buckets) - 0usize];
    ["Offset of field: pm_constant_pool_t::constants"]
        [::std::mem::offset_of!(pm_constant_pool_t, constants) - 8usize];
    ["Offset of field: pm_constant_pool_t::size"]
        [::std::mem::offset_of!(pm_constant_pool_t, size) - 16usize];
    ["Offset of field: pm_constant_pool_t::capacity"]
        [::std::mem::offset_of!(pm_constant_pool_t, capacity) - 20usize];
};
#[doc = " This string is a constant string, and should not be freed.\n"]
pub const PM_STRING_CONSTANT: pm_string_t__bindgen_ty_1 = 0;
#[doc = " This is a slice of another string, and should not be freed.\n"]
pub const PM_STRING_SHARED: pm_string_t__bindgen_ty_1 = 1;
#[doc = " This string owns its memory, and should be freed using `pm_string_free()`.\n"]
pub const PM_STRING_OWNED: pm_string_t__bindgen_ty_1 = 2;
#[doc = " This string is a memory-mapped file, and should be freed using `pm_string_free()`.\n"]
pub const PM_STRING_MAPPED: pm_string_t__bindgen_ty_1 = 3;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_string_t"][::std::mem::size_of::<pm_string_t>() - 24usize];
    ["Alignment of pm_string_t"][::std::mem::align_of::<pm_string_t>() - 8usize];
    ["Offset of field: pm_string_t::source"][::std::mem::offset_of!(pm_string_t, source) - 0usize];
    ["Offset of field: pm_string_t::length"][::std::mem::offset_of!(pm_string_t, length) - 8usize];
    ["Offset of field: pm_string_t::type_"][::std::mem::offset_of!(pm_string_t, type_) - 16usize];
};
#[doc = " final token in the file\n"]
pub const PM_TOKEN_EOF: pm_token_type = 1;
#[doc = " }\n"]
pub const PM_TOKEN_BRACE_RIGHT: pm_token_type = 2;
#[doc = " ,\n"]
pub const PM_TOKEN_COMMA: pm_token_type = 3;
#[doc = " }\n"]
pub const PM_TOKEN_EMBEXPR_END: pm_token_type = 4;
#[doc = " do\n"]
pub const PM_TOKEN_KEYWORD_DO: pm_token_type = 5;
#[doc = " else\n"]
pub const PM_TOKEN_KEYWORD_ELSE: pm_token_type = 6;
#[doc = " elsif\n"]
pub const PM_TOKEN_KEYWORD_ELSIF: pm_token_type = 7;
#[doc = " end\n"]
pub const PM_TOKEN_KEYWORD_END: pm_token_type = 8;
#[doc = " ensure\n"]
pub const PM_TOKEN_KEYWORD_ENSURE: pm_token_type = 9;
#[doc = " in\n"]
pub const PM_TOKEN_KEYWORD_IN: pm_token_type = 10;
#[doc = " rescue\n"]
pub const PM_TOKEN_KEYWORD_RESCUE: pm_token_type = 11;
#[doc = " then\n"]
pub const PM_TOKEN_KEYWORD_THEN: pm_token_type = 12;
#[doc = " when\n"]
pub const PM_TOKEN_KEYWORD_WHEN: pm_token_type = 13;
#[doc = " a newline character outside of other tokens\n"]
pub const PM_TOKEN_NEWLINE: pm_token_type = 14;
#[doc = " )\n"]
pub const PM_TOKEN_PARENTHESIS_RIGHT: pm_token_type = 15;
#[doc = " |\n"]
pub const PM_TOKEN_PIPE: pm_token_type = 16;
#[doc = " ;\n"]
pub const PM_TOKEN_SEMICOLON: pm_token_type = 17;
#[doc = " &\n"]
pub const PM_TOKEN_AMPERSAND: pm_token_type = 18;
#[doc = " &&\n"]
pub const PM_TOKEN_AMPERSAND_AMPERSAND: pm_token_type = 19;
#[doc = " &&=\n"]
pub const PM_TOKEN_AMPERSAND_AMPERSAND_EQUAL: pm_token_type = 20;
#[doc = " &.\n"]
pub const PM_TOKEN_AMPERSAND_DOT: pm_token_type = 21;
#[doc = " &=\n"]
pub const PM_TOKEN_AMPERSAND_EQUAL: pm_token_type = 22;
#[doc = " `\n"]
pub const PM_TOKEN_BACKTICK: pm_token_type = 23;
#[doc = " a back reference\n"]
pub const PM_TOKEN_BACK_REFERENCE: pm_token_type = 24;
#[doc = " ! or !@\n"]
pub const PM_TOKEN_BANG: pm_token_type = 25;
#[doc = " !=\n"]
pub const PM_TOKEN_BANG_EQUAL: pm_token_type = 26;
#[doc = " !~\n"]
pub const PM_TOKEN_BANG_TILDE: pm_token_type = 27;
#[doc = " {\n"]
pub const PM_TOKEN_BRACE_LEFT: pm_token_type = 28;
#[doc = " [\n"]
pub const PM_TOKEN_BRACKET_LEFT: pm_token_type = 29;
#[doc = " [ for the beginning of an array\n"]
pub const PM_TOKEN_BRACKET_LEFT_ARRAY: pm_token_type = 30;
#[doc = " []\n"]
pub const PM_TOKEN_BRACKET_LEFT_RIGHT: pm_token_type = 31;
#[doc = " []=\n"]
pub const PM_TOKEN_BRACKET_LEFT_RIGHT_EQUAL: pm_token_type = 32;
#[doc = " ]\n"]
pub const PM_TOKEN_BRACKET_RIGHT: pm_token_type = 33;
#[doc = " ^\n"]
pub const PM_TOKEN_CARET: pm_token_type = 34;
#[doc = " ^=\n"]
pub const PM_TOKEN_CARET_EQUAL: pm_token_type = 35;
#[doc = " a character literal\n"]
pub const PM_TOKEN_CHARACTER_LITERAL: pm_token_type = 36;
#[doc = " a class variable\n"]
pub const PM_TOKEN_CLASS_VARIABLE: pm_token_type = 37;
#[doc = " :\n"]
pub const PM_TOKEN_COLON: pm_token_type = 38;
#[doc = " ::\n"]
pub const PM_TOKEN_COLON_COLON: pm_token_type = 39;
#[doc = " a comment\n"]
pub const PM_TOKEN_COMMENT: pm_token_type = 40;
#[doc = " a constant\n"]
pub const PM_TOKEN_CONSTANT: pm_token_type = 41;
#[doc = " the . call operator\n"]
pub const PM_TOKEN_DOT: pm_token_type = 42;
#[doc = " the .. range operator\n"]
pub const PM_TOKEN_DOT_DOT: pm_token_type = 43;
#[doc = " the ... range operator or forwarding parameter\n"]
pub const PM_TOKEN_DOT_DOT_DOT: pm_token_type = 44;
#[doc = " =begin\n"]
pub const PM_TOKEN_EMBDOC_BEGIN: pm_token_type = 45;
#[doc = " =end\n"]
pub const PM_TOKEN_EMBDOC_END: pm_token_type = 46;
#[doc = " a line inside of embedded documentation\n"]
pub const PM_TOKEN_EMBDOC_LINE: pm_token_type = 47;
#[doc = " #{\n"]
pub const PM_TOKEN_EMBEXPR_BEGIN: pm_token_type = 48;
#[doc = " #\n"]
pub const PM_TOKEN_EMBVAR: pm_token_type = 49;
#[doc = " =\n"]
pub const PM_TOKEN_EQUAL: pm_token_type = 50;
#[doc = " ==\n"]
pub const PM_TOKEN_EQUAL_EQUAL: pm_token_type = 51;
#[doc = " ===\n"]
pub const PM_TOKEN_EQUAL_EQUAL_EQUAL: pm_token_type = 52;
#[doc = " =>\n"]
pub const PM_TOKEN_EQUAL_GREATER: pm_token_type = 53;
#[doc = " =~\n"]
pub const PM_TOKEN_EQUAL_TILDE: pm_token_type = 54;
#[doc = " a floating point number\n"]
pub const PM_TOKEN_FLOAT: pm_token_type = 55;
#[doc = " a floating pointer number with an imaginary suffix\n"]
pub const PM_TOKEN_FLOAT_IMAGINARY: pm_token_type = 56;
#[doc = " a floating pointer number with a rational suffix\n"]
pub const PM_TOKEN_FLOAT_RATIONAL: pm_token_type = 57;
#[doc = " a floating pointer number with a rational and imaginary suffix\n"]
pub const PM_TOKEN_FLOAT_RATIONAL_IMAGINARY: pm_token_type = 58;
#[doc = " a global variable\n"]
pub const PM_TOKEN_GLOBAL_VARIABLE: pm_token_type = 59;
#[doc = " >\n"]
pub const PM_TOKEN_GREATER: pm_token_type = 60;
#[doc = " >=\n"]
pub const PM_TOKEN_GREATER_EQUAL: pm_token_type = 61;
#[doc = " >>\n"]
pub const PM_TOKEN_GREATER_GREATER: pm_token_type = 62;
#[doc = " >>=\n"]
pub const PM_TOKEN_GREATER_GREATER_EQUAL: pm_token_type = 63;
#[doc = " the end of a heredoc\n"]
pub const PM_TOKEN_HEREDOC_END: pm_token_type = 64;
#[doc = " the start of a heredoc\n"]
pub const PM_TOKEN_HEREDOC_START: pm_token_type = 65;
#[doc = " an identifier\n"]
pub const PM_TOKEN_IDENTIFIER: pm_token_type = 66;
#[doc = " an ignored newline\n"]
pub const PM_TOKEN_IGNORED_NEWLINE: pm_token_type = 67;
#[doc = " an instance variable\n"]
pub const PM_TOKEN_INSTANCE_VARIABLE: pm_token_type = 68;
#[doc = " an integer (any base)\n"]
pub const PM_TOKEN_INTEGER: pm_token_type = 69;
#[doc = " an integer with an imaginary suffix\n"]
pub const PM_TOKEN_INTEGER_IMAGINARY: pm_token_type = 70;
#[doc = " an integer with a rational suffix\n"]
pub const PM_TOKEN_INTEGER_RATIONAL: pm_token_type = 71;
#[doc = " an integer with a rational and imaginary suffix\n"]
pub const PM_TOKEN_INTEGER_RATIONAL_IMAGINARY: pm_token_type = 72;
#[doc = " alias\n"]
pub const PM_TOKEN_KEYWORD_ALIAS: pm_token_type = 73;
#[doc = " and\n"]
pub const PM_TOKEN_KEYWORD_AND: pm_token_type = 74;
#[doc = " begin\n"]
pub const PM_TOKEN_KEYWORD_BEGIN: pm_token_type = 75;
#[doc = " BEGIN\n"]
pub const PM_TOKEN_KEYWORD_BEGIN_UPCASE: pm_token_type = 76;
#[doc = " break\n"]
pub const PM_TOKEN_KEYWORD_BREAK: pm_token_type = 77;
#[doc = " case\n"]
pub const PM_TOKEN_KEYWORD_CASE: pm_token_type = 78;
#[doc = " class\n"]
pub const PM_TOKEN_KEYWORD_CLASS: pm_token_type = 79;
#[doc = " def\n"]
pub const PM_TOKEN_KEYWORD_DEF: pm_token_type = 80;
#[doc = " defined?\n"]
pub const PM_TOKEN_KEYWORD_DEFINED: pm_token_type = 81;
#[doc = " do keyword for a predicate in a while, until, or for loop\n"]
pub const PM_TOKEN_KEYWORD_DO_LOOP: pm_token_type = 82;
#[doc = " END\n"]
pub const PM_TOKEN_KEYWORD_END_UPCASE: pm_token_type = 83;
#[doc = " false\n"]
pub const PM_TOKEN_KEYWORD_FALSE: pm_token_type = 84;
#[doc = " for\n"]
pub const PM_TOKEN_KEYWORD_FOR: pm_token_type = 85;
#[doc = " if\n"]
pub const PM_TOKEN_KEYWORD_IF: pm_token_type = 86;
#[doc = " if in the modifier form\n"]
pub const PM_TOKEN_KEYWORD_IF_MODIFIER: pm_token_type = 87;
#[doc = " module\n"]
pub const PM_TOKEN_KEYWORD_MODULE: pm_token_type = 88;
#[doc = " next\n"]
pub const PM_TOKEN_KEYWORD_NEXT: pm_token_type = 89;
#[doc = " nil\n"]
pub const PM_TOKEN_KEYWORD_NIL: pm_token_type = 90;
#[doc = " not\n"]
pub const PM_TOKEN_KEYWORD_NOT: pm_token_type = 91;
#[doc = " or\n"]
pub const PM_TOKEN_KEYWORD_OR: pm_token_type = 92;
#[doc = " redo\n"]
pub const PM_TOKEN_KEYWORD_REDO: pm_token_type = 93;
#[doc = " rescue in the modifier form\n"]
pub const PM_TOKEN_KEYWORD_RESCUE_MODIFIER: pm_token_type = 94;
#[doc = " retry\n"]
pub const PM_TOKEN_KEYWORD_RETRY: pm_token_type = 95;
#[doc = " return\n"]
pub const PM_TOKEN_KEYWORD_RETURN: pm_token_type = 96;
#[doc = " self\n"]
pub const PM_TOKEN_KEYWORD_SELF: pm_token_type = 97;
#[doc = " super\n"]
pub const PM_TOKEN_KEYWORD_SUPER: pm_token_type = 98;
#[doc = " true\n"]
pub const PM_TOKEN_KEYWORD_TRUE: pm_token_type = 99;
#[doc = " undef\n"]
pub const PM_TOKEN_KEYWORD_UNDEF: pm_token_type = 100;
#[doc = " unless\n"]
pub const PM_TOKEN_KEYWORD_UNLESS: pm_token_type = 101;
#[doc = " unless in the modifier form\n"]
pub const PM_TOKEN_KEYWORD_UNLESS_MODIFIER: pm_token_type = 102;
#[doc = " until\n"]
pub const PM_TOKEN_KEYWORD_UNTIL: pm_token_type = 103;
#[doc = " until in the modifier form\n"]
pub const PM_TOKEN_KEYWORD_UNTIL_MODIFIER: pm_token_type = 104;
#[doc = " while\n"]
pub const PM_TOKEN_KEYWORD_WHILE: pm_token_type = 105;
#[doc = " while in the modifier form\n"]
pub const PM_TOKEN_KEYWORD_WHILE_MODIFIER: pm_token_type = 106;
#[doc = " yield\n"]
pub const PM_TOKEN_KEYWORD_YIELD: pm_token_type = 107;
#[doc = " __ENCODING__\n"]
pub const PM_TOKEN_KEYWORD___ENCODING__: pm_token_type = 108;
#[doc = " __FILE__\n"]
pub const PM_TOKEN_KEYWORD___FILE__: pm_token_type = 109;
#[doc = " __LINE__\n"]
pub const PM_TOKEN_KEYWORD___LINE__: pm_token_type = 110;
#[doc = " a label\n"]
pub const PM_TOKEN_LABEL: pm_token_type = 111;
#[doc = " the end of a label\n"]
pub const PM_TOKEN_LABEL_END: pm_token_type = 112;
#[doc = " {\n"]
pub const PM_TOKEN_LAMBDA_BEGIN: pm_token_type = 113;
#[doc = " <\n"]
pub const PM_TOKEN_LESS: pm_token_type = 114;
#[doc = " <=\n"]
pub const PM_TOKEN_LESS_EQUAL: pm_token_type = 115;
#[doc = " <=>\n"]
pub const PM_TOKEN_LESS_EQUAL_GREATER: pm_token_type = 116;
#[doc = " <<\n"]
pub const PM_TOKEN_LESS_LESS: pm_token_type = 117;
#[doc = " <<=\n"]
pub const PM_TOKEN_LESS_LESS_EQUAL: pm_token_type = 118;
#[doc = " a method name\n"]
pub const PM_TOKEN_METHOD_NAME: pm_token_type = 119;
#[doc = " -\n"]
pub const PM_TOKEN_MINUS: pm_token_type = 120;
#[doc = " -=\n"]
pub const PM_TOKEN_MINUS_EQUAL: pm_token_type = 121;
#[doc = " ->\n"]
pub const PM_TOKEN_MINUS_GREATER: pm_token_type = 122;
#[doc = " a numbered reference to a capture group in the previous regular expression match\n"]
pub const PM_TOKEN_NUMBERED_REFERENCE: pm_token_type = 123;
#[doc = " (\n"]
pub const PM_TOKEN_PARENTHESIS_LEFT: pm_token_type = 124;
#[doc = " ( for a parentheses node\n"]
pub const PM_TOKEN_PARENTHESIS_LEFT_PARENTHESES: pm_token_type = 125;
#[doc = " %\n"]
pub const PM_TOKEN_PERCENT: pm_token_type = 126;
#[doc = " %=\n"]
pub const PM_TOKEN_PERCENT_EQUAL: pm_token_type = 127;
#[doc = " %i\n"]
pub const PM_TOKEN_PERCENT_LOWER_I: pm_token_type = 128;
#[doc = " %w\n"]
pub const PM_TOKEN_PERCENT_LOWER_W: pm_token_type = 129;
#[doc = " %x\n"]
pub const PM_TOKEN_PERCENT_LOWER_X: pm_token_type = 130;
#[doc = " %I\n"]
pub const PM_TOKEN_PERCENT_UPPER_I: pm_token_type = 131;
#[doc = " %W\n"]
pub const PM_TOKEN_PERCENT_UPPER_W: pm_token_type = 132;
#[doc = " |=\n"]
pub const PM_TOKEN_PIPE_EQUAL: pm_token_type = 133;
#[doc = " ||\n"]
pub const PM_TOKEN_PIPE_PIPE: pm_token_type = 134;
#[doc = " ||=\n"]
pub const PM_TOKEN_PIPE_PIPE_EQUAL: pm_token_type = 135;
#[doc = " +\n"]
pub const PM_TOKEN_PLUS: pm_token_type = 136;
#[doc = " +=\n"]
pub const PM_TOKEN_PLUS_EQUAL: pm_token_type = 137;
#[doc = " ?\n"]
pub const PM_TOKEN_QUESTION_MARK: pm_token_type = 138;
#[doc = " the beginning of a regular expression\n"]
pub const PM_TOKEN_REGEXP_BEGIN: pm_token_type = 139;
#[doc = " the end of a regular expression\n"]
pub const PM_TOKEN_REGEXP_END: pm_token_type = 140;
#[doc = " /\n"]
pub const PM_TOKEN_SLASH: pm_token_type = 141;
#[doc = " /=\n"]
pub const PM_TOKEN_SLASH_EQUAL: pm_token_type = 142;
#[doc = " *\n"]
pub const PM_TOKEN_STAR: pm_token_type = 143;
#[doc = " *=\n"]
pub const PM_TOKEN_STAR_EQUAL: pm_token_type = 144;
#[doc = " **\n"]
pub const PM_TOKEN_STAR_STAR: pm_token_type = 145;
#[doc = " **=\n"]
pub const PM_TOKEN_STAR_STAR_EQUAL: pm_token_type = 146;
#[doc = " the beginning of a string\n"]
pub const PM_TOKEN_STRING_BEGIN: pm_token_type = 147;
#[doc = " the contents of a string\n"]
pub const PM_TOKEN_STRING_CONTENT: pm_token_type = 148;
#[doc = " the end of a string\n"]
pub const PM_TOKEN_STRING_END: pm_token_type = 149;
#[doc = " the beginning of a symbol\n"]
pub const PM_TOKEN_SYMBOL_BEGIN: pm_token_type = 150;
#[doc = " ~ or ~@\n"]
pub const PM_TOKEN_TILDE: pm_token_type = 151;
#[doc = " unary &\n"]
pub const PM_TOKEN_UAMPERSAND: pm_token_type = 152;
#[doc = " unary ::\n"]
pub const PM_TOKEN_UCOLON_COLON: pm_token_type = 153;
#[doc = " unary .. operator\n"]
pub const PM_TOKEN_UDOT_DOT: pm_token_type = 154;
#[doc = " unary ... operator\n"]
pub const PM_TOKEN_UDOT_DOT_DOT: pm_token_type = 155;
#[doc = " -@\n"]
pub const PM_TOKEN_UMINUS: pm_token_type = 156;
#[doc = " -@ for a number\n"]
pub const PM_TOKEN_UMINUS_NUM: pm_token_type = 157;
#[doc = " +@\n"]
pub const PM_TOKEN_UPLUS: pm_token_type = 158;
#[doc = " unary *\n"]
pub const PM_TOKEN_USTAR: pm_token_type = 159;
#[doc = " unary **\n"]
pub const PM_TOKEN_USTAR_STAR: pm_token_type = 160;
#[doc = " a separator between words in a list\n"]
pub const PM_TOKEN_WORDS_SEP: pm_token_type = 161;
#[doc = " marker for the point in the file at which the parser should stop\n"]
pub const PM_TOKEN___END__: pm_token_type = 162;
#[doc = " a token that was expected but not found\n"]
pub const PM_TOKEN_MISSING: pm_token_type = 163;
#[doc = " a token that was not present but it is okay\n"]
pub const PM_TOKEN_NOT_PROVIDED: pm_token_type = 164;
#[doc = " The maximum token value.\n"]
pub const PM_TOKEN_MAXIMUM: pm_token_type = 165;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_token_t"][::std::mem::size_of::<pm_token_t>() - 24usize];
    ["Alignment of pm_token_t"][::std::mem::align_of::<pm_token_t>() - 8usize];
    ["Offset of field: pm_token_t::type_"][::std::mem::offset_of!(pm_token_t, type_) - 0usize];
    ["Offset of field: pm_token_t::start"][::std::mem::offset_of!(pm_token_t, start) - 8usize];
    ["Offset of field: pm_token_t::end"][::std::mem::offset_of!(pm_token_t, end) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_location_t"][::std::mem::size_of::<pm_location_t>() - 16usize];
    ["Alignment of pm_location_t"][::std::mem::align_of::<pm_location_t>() - 8usize];
    ["Offset of field: pm_location_t::start"]
        [::std::mem::offset_of!(pm_location_t, start) - 0usize];
    ["Offset of field: pm_location_t::end"][::std::mem::offset_of!(pm_location_t, end) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_node_list"][::std::mem::size_of::<pm_node_list>() - 24usize];
    ["Alignment of pm_node_list"][::std::mem::align_of::<pm_node_list>() - 8usize];
    ["Offset of field: pm_node_list::size"][::std::mem::offset_of!(pm_node_list, size) - 0usize];
    ["Offset of field: pm_node_list::capacity"]
        [::std::mem::offset_of!(pm_node_list, capacity) - 8usize];
    ["Offset of field: pm_node_list::nodes"][::std::mem::offset_of!(pm_node_list, nodes) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_node"][::std::mem::size_of::<pm_node>() - 24usize];
    ["Alignment of pm_node"][::std::mem::align_of::<pm_node>() - 8usize];
    ["Offset of field: pm_node::type_"][::std::mem::offset_of!(pm_node, type_) - 0usize];
    ["Offset of field: pm_node::flags"][::std::mem::offset_of!(pm_node, flags) - 2usize];
    ["Offset of field: pm_node::node_id"][::std::mem::offset_of!(pm_node, node_id) - 4usize];
    ["Offset of field: pm_node::location"][::std::mem::offset_of!(pm_node, location) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_alias_global_variable_node"]
        [::std::mem::size_of::<pm_alias_global_variable_node>() - 56usize];
    ["Alignment of pm_alias_global_variable_node"]
        [::std::mem::align_of::<pm_alias_global_variable_node>() - 8usize];
    ["Offset of field: pm_alias_global_variable_node::base"]
        [::std::mem::offset_of!(pm_alias_global_variable_node, base) - 0usize];
    ["Offset of field: pm_alias_global_variable_node::new_name"]
        [::std::mem::offset_of!(pm_alias_global_variable_node, new_name) - 24usize];
    ["Offset of field: pm_alias_global_variable_node::old_name"]
        [::std::mem::offset_of!(pm_alias_global_variable_node, old_name) - 32usize];
    ["Offset of field: pm_alias_global_variable_node::keyword_loc"]
        [::std::mem::offset_of!(pm_alias_global_variable_node, keyword_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_alias_method_node"][::std::mem::size_of::<pm_alias_method_node>() - 56usize];
    ["Alignment of pm_alias_method_node"][::std::mem::align_of::<pm_alias_method_node>() - 8usize];
    ["Offset of field: pm_alias_method_node::base"]
        [::std::mem::offset_of!(pm_alias_method_node, base) - 0usize];
    ["Offset of field: pm_alias_method_node::new_name"]
        [::std::mem::offset_of!(pm_alias_method_node, new_name) - 24usize];
    ["Offset of field: pm_alias_method_node::old_name"]
        [::std::mem::offset_of!(pm_alias_method_node, old_name) - 32usize];
    ["Offset of field: pm_alias_method_node::keyword_loc"]
        [::std::mem::offset_of!(pm_alias_method_node, keyword_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_alternation_pattern_node"]
        [::std::mem::size_of::<pm_alternation_pattern_node>() - 56usize];
    ["Alignment of pm_alternation_pattern_node"]
        [::std::mem::align_of::<pm_alternation_pattern_node>() - 8usize];
    ["Offset of field: pm_alternation_pattern_node::base"]
        [::std::mem::offset_of!(pm_alternation_pattern_node, base) - 0usize];
    ["Offset of field: pm_alternation_pattern_node::left"]
        [::std::mem::offset_of!(pm_alternation_pattern_node, left) - 24usize];
    ["Offset of field: pm_alternation_pattern_node::right"]
        [::std::mem::offset_of!(pm_alternation_pattern_node, right) - 32usize];
    ["Offset of field: pm_alternation_pattern_node::operator_loc"]
        [::std::mem::offset_of!(pm_alternation_pattern_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_and_node"][::std::mem::size_of::<pm_and_node>() - 56usize];
    ["Alignment of pm_and_node"][::std::mem::align_of::<pm_and_node>() - 8usize];
    ["Offset of field: pm_and_node::base"][::std::mem::offset_of!(pm_and_node, base) - 0usize];
    ["Offset of field: pm_and_node::left"][::std::mem::offset_of!(pm_and_node, left) - 24usize];
    ["Offset of field: pm_and_node::right"][::std::mem::offset_of!(pm_and_node, right) - 32usize];
    ["Offset of field: pm_and_node::operator_loc"]
        [::std::mem::offset_of!(pm_and_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_arguments_node"][::std::mem::size_of::<pm_arguments_node>() - 48usize];
    ["Alignment of pm_arguments_node"][::std::mem::align_of::<pm_arguments_node>() - 8usize];
    ["Offset of field: pm_arguments_node::base"]
        [::std::mem::offset_of!(pm_arguments_node, base) - 0usize];
    ["Offset of field: pm_arguments_node::arguments"]
        [::std::mem::offset_of!(pm_arguments_node, arguments) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_array_node"][::std::mem::size_of::<pm_array_node>() - 80usize];
    ["Alignment of pm_array_node"][::std::mem::align_of::<pm_array_node>() - 8usize];
    ["Offset of field: pm_array_node::base"][::std::mem::offset_of!(pm_array_node, base) - 0usize];
    ["Offset of field: pm_array_node::elements"]
        [::std::mem::offset_of!(pm_array_node, elements) - 24usize];
    ["Offset of field: pm_array_node::opening_loc"]
        [::std::mem::offset_of!(pm_array_node, opening_loc) - 48usize];
    ["Offset of field: pm_array_node::closing_loc"]
        [::std::mem::offset_of!(pm_array_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_array_pattern_node"][::std::mem::size_of::<pm_array_pattern_node>() - 120usize];
    ["Alignment of pm_array_pattern_node"]
        [::std::mem::align_of::<pm_array_pattern_node>() - 8usize];
    ["Offset of field: pm_array_pattern_node::base"]
        [::std::mem::offset_of!(pm_array_pattern_node, base) - 0usize];
    ["Offset of field: pm_array_pattern_node::constant"]
        [::std::mem::offset_of!(pm_array_pattern_node, constant) - 24usize];
    ["Offset of field: pm_array_pattern_node::requireds"]
        [::std::mem::offset_of!(pm_array_pattern_node, requireds) - 32usize];
    ["Offset of field: pm_array_pattern_node::rest"]
        [::std::mem::offset_of!(pm_array_pattern_node, rest) - 56usize];
    ["Offset of field: pm_array_pattern_node::posts"]
        [::std::mem::offset_of!(pm_array_pattern_node, posts) - 64usize];
    ["Offset of field: pm_array_pattern_node::opening_loc"]
        [::std::mem::offset_of!(pm_array_pattern_node, opening_loc) - 88usize];
    ["Offset of field: pm_array_pattern_node::closing_loc"]
        [::std::mem::offset_of!(pm_array_pattern_node, closing_loc) - 104usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_assoc_node"][::std::mem::size_of::<pm_assoc_node>() - 56usize];
    ["Alignment of pm_assoc_node"][::std::mem::align_of::<pm_assoc_node>() - 8usize];
    ["Offset of field: pm_assoc_node::base"][::std::mem::offset_of!(pm_assoc_node, base) - 0usize];
    ["Offset of field: pm_assoc_node::key"][::std::mem::offset_of!(pm_assoc_node, key) - 24usize];
    ["Offset of field: pm_assoc_node::value"]
        [::std::mem::offset_of!(pm_assoc_node, value) - 32usize];
    ["Offset of field: pm_assoc_node::operator_loc"]
        [::std::mem::offset_of!(pm_assoc_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_assoc_splat_node"][::std::mem::size_of::<pm_assoc_splat_node>() - 48usize];
    ["Alignment of pm_assoc_splat_node"][::std::mem::align_of::<pm_assoc_splat_node>() - 8usize];
    ["Offset of field: pm_assoc_splat_node::base"]
        [::std::mem::offset_of!(pm_assoc_splat_node, base) - 0usize];
    ["Offset of field: pm_assoc_splat_node::value"]
        [::std::mem::offset_of!(pm_assoc_splat_node, value) - 24usize];
    ["Offset of field: pm_assoc_splat_node::operator_loc"]
        [::std::mem::offset_of!(pm_assoc_splat_node, operator_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_back_reference_read_node"]
        [::std::mem::size_of::<pm_back_reference_read_node>() - 32usize];
    ["Alignment of pm_back_reference_read_node"]
        [::std::mem::align_of::<pm_back_reference_read_node>() - 8usize];
    ["Offset of field: pm_back_reference_read_node::base"]
        [::std::mem::offset_of!(pm_back_reference_read_node, base) - 0usize];
    ["Offset of field: pm_back_reference_read_node::name"]
        [::std::mem::offset_of!(pm_back_reference_read_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_begin_node"][::std::mem::size_of::<pm_begin_node>() - 88usize];
    ["Alignment of pm_begin_node"][::std::mem::align_of::<pm_begin_node>() - 8usize];
    ["Offset of field: pm_begin_node::base"][::std::mem::offset_of!(pm_begin_node, base) - 0usize];
    ["Offset of field: pm_begin_node::begin_keyword_loc"]
        [::std::mem::offset_of!(pm_begin_node, begin_keyword_loc) - 24usize];
    ["Offset of field: pm_begin_node::statements"]
        [::std::mem::offset_of!(pm_begin_node, statements) - 40usize];
    ["Offset of field: pm_begin_node::rescue_clause"]
        [::std::mem::offset_of!(pm_begin_node, rescue_clause) - 48usize];
    ["Offset of field: pm_begin_node::else_clause"]
        [::std::mem::offset_of!(pm_begin_node, else_clause) - 56usize];
    ["Offset of field: pm_begin_node::ensure_clause"]
        [::std::mem::offset_of!(pm_begin_node, ensure_clause) - 64usize];
    ["Offset of field: pm_begin_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_begin_node, end_keyword_loc) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_block_argument_node"][::std::mem::size_of::<pm_block_argument_node>() - 48usize];
    ["Alignment of pm_block_argument_node"]
        [::std::mem::align_of::<pm_block_argument_node>() - 8usize];
    ["Offset of field: pm_block_argument_node::base"]
        [::std::mem::offset_of!(pm_block_argument_node, base) - 0usize];
    ["Offset of field: pm_block_argument_node::expression"]
        [::std::mem::offset_of!(pm_block_argument_node, expression) - 24usize];
    ["Offset of field: pm_block_argument_node::operator_loc"]
        [::std::mem::offset_of!(pm_block_argument_node, operator_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_block_local_variable_node"]
        [::std::mem::size_of::<pm_block_local_variable_node>() - 32usize];
    ["Alignment of pm_block_local_variable_node"]
        [::std::mem::align_of::<pm_block_local_variable_node>() - 8usize];
    ["Offset of field: pm_block_local_variable_node::base"]
        [::std::mem::offset_of!(pm_block_local_variable_node, base) - 0usize];
    ["Offset of field: pm_block_local_variable_node::name"]
        [::std::mem::offset_of!(pm_block_local_variable_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_block_node"][::std::mem::size_of::<pm_block_node>() - 96usize];
    ["Alignment of pm_block_node"][::std::mem::align_of::<pm_block_node>() - 8usize];
    ["Offset of field: pm_block_node::base"][::std::mem::offset_of!(pm_block_node, base) - 0usize];
    ["Offset of field: pm_block_node::locals"]
        [::std::mem::offset_of!(pm_block_node, locals) - 24usize];
    ["Offset of field: pm_block_node::parameters"]
        [::std::mem::offset_of!(pm_block_node, parameters) - 48usize];
    ["Offset of field: pm_block_node::body"][::std::mem::offset_of!(pm_block_node, body) - 56usize];
    ["Offset of field: pm_block_node::opening_loc"]
        [::std::mem::offset_of!(pm_block_node, opening_loc) - 64usize];
    ["Offset of field: pm_block_node::closing_loc"]
        [::std::mem::offset_of!(pm_block_node, closing_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_block_parameter_node"][::std::mem::size_of::<pm_block_parameter_node>() - 64usize];
    ["Alignment of pm_block_parameter_node"]
        [::std::mem::align_of::<pm_block_parameter_node>() - 8usize];
    ["Offset of field: pm_block_parameter_node::base"]
        [::std::mem::offset_of!(pm_block_parameter_node, base) - 0usize];
    ["Offset of field: pm_block_parameter_node::name"]
        [::std::mem::offset_of!(pm_block_parameter_node, name) - 24usize];
    ["Offset of field: pm_block_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_block_parameter_node, name_loc) - 32usize];
    ["Offset of field: pm_block_parameter_node::operator_loc"]
        [::std::mem::offset_of!(pm_block_parameter_node, operator_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_block_parameters_node"]
        [::std::mem::size_of::<pm_block_parameters_node>() - 88usize];
    ["Alignment of pm_block_parameters_node"]
        [::std::mem::align_of::<pm_block_parameters_node>() - 8usize];
    ["Offset of field: pm_block_parameters_node::base"]
        [::std::mem::offset_of!(pm_block_parameters_node, base) - 0usize];
    ["Offset of field: pm_block_parameters_node::parameters"]
        [::std::mem::offset_of!(pm_block_parameters_node, parameters) - 24usize];
    ["Offset of field: pm_block_parameters_node::locals"]
        [::std::mem::offset_of!(pm_block_parameters_node, locals) - 32usize];
    ["Offset of field: pm_block_parameters_node::opening_loc"]
        [::std::mem::offset_of!(pm_block_parameters_node, opening_loc) - 56usize];
    ["Offset of field: pm_block_parameters_node::closing_loc"]
        [::std::mem::offset_of!(pm_block_parameters_node, closing_loc) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_break_node"][::std::mem::size_of::<pm_break_node>() - 48usize];
    ["Alignment of pm_break_node"][::std::mem::align_of::<pm_break_node>() - 8usize];
    ["Offset of field: pm_break_node::base"][::std::mem::offset_of!(pm_break_node, base) - 0usize];
    ["Offset of field: pm_break_node::arguments"]
        [::std::mem::offset_of!(pm_break_node, arguments) - 24usize];
    ["Offset of field: pm_break_node::keyword_loc"]
        [::std::mem::offset_of!(pm_break_node, keyword_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_call_and_write_node"][::std::mem::size_of::<pm_call_and_write_node>() - 96usize];
    ["Alignment of pm_call_and_write_node"]
        [::std::mem::align_of::<pm_call_and_write_node>() - 8usize];
    ["Offset of field: pm_call_and_write_node::base"]
        [::std::mem::offset_of!(pm_call_and_write_node, base) - 0usize];
    ["Offset of field: pm_call_and_write_node::receiver"]
        [::std::mem::offset_of!(pm_call_and_write_node, receiver) - 24usize];
    ["Offset of field: pm_call_and_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_call_and_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_call_and_write_node::message_loc"]
        [::std::mem::offset_of!(pm_call_and_write_node, message_loc) - 48usize];
    ["Offset of field: pm_call_and_write_node::read_name"]
        [::std::mem::offset_of!(pm_call_and_write_node, read_name) - 64usize];
    ["Offset of field: pm_call_and_write_node::write_name"]
        [::std::mem::offset_of!(pm_call_and_write_node, write_name) - 68usize];
    ["Offset of field: pm_call_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_call_and_write_node, operator_loc) - 72usize];
    ["Offset of field: pm_call_and_write_node::value"]
        [::std::mem::offset_of!(pm_call_and_write_node, value) - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_call_node"][::std::mem::size_of::<pm_call_node>() - 136usize];
    ["Alignment of pm_call_node"][::std::mem::align_of::<pm_call_node>() - 8usize];
    ["Offset of field: pm_call_node::base"][::std::mem::offset_of!(pm_call_node, base) - 0usize];
    ["Offset of field: pm_call_node::receiver"]
        [::std::mem::offset_of!(pm_call_node, receiver) - 24usize];
    ["Offset of field: pm_call_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_call_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_call_node::name"][::std::mem::offset_of!(pm_call_node, name) - 48usize];
    ["Offset of field: pm_call_node::message_loc"]
        [::std::mem::offset_of!(pm_call_node, message_loc) - 56usize];
    ["Offset of field: pm_call_node::opening_loc"]
        [::std::mem::offset_of!(pm_call_node, opening_loc) - 72usize];
    ["Offset of field: pm_call_node::arguments"]
        [::std::mem::offset_of!(pm_call_node, arguments) - 88usize];
    ["Offset of field: pm_call_node::closing_loc"]
        [::std::mem::offset_of!(pm_call_node, closing_loc) - 96usize];
    ["Offset of field: pm_call_node::equal_loc"]
        [::std::mem::offset_of!(pm_call_node, equal_loc) - 112usize];
    ["Offset of field: pm_call_node::block"]
        [::std::mem::offset_of!(pm_call_node, block) - 128usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_call_operator_write_node"]
        [::std::mem::size_of::<pm_call_operator_write_node>() - 104usize];
    ["Alignment of pm_call_operator_write_node"]
        [::std::mem::align_of::<pm_call_operator_write_node>() - 8usize];
    ["Offset of field: pm_call_operator_write_node::base"]
        [::std::mem::offset_of!(pm_call_operator_write_node, base) - 0usize];
    ["Offset of field: pm_call_operator_write_node::receiver"]
        [::std::mem::offset_of!(pm_call_operator_write_node, receiver) - 24usize];
    ["Offset of field: pm_call_operator_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_call_operator_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_call_operator_write_node::message_loc"]
        [::std::mem::offset_of!(pm_call_operator_write_node, message_loc) - 48usize];
    ["Offset of field: pm_call_operator_write_node::read_name"]
        [::std::mem::offset_of!(pm_call_operator_write_node, read_name) - 64usize];
    ["Offset of field: pm_call_operator_write_node::write_name"]
        [::std::mem::offset_of!(pm_call_operator_write_node, write_name) - 68usize];
    ["Offset of field: pm_call_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_call_operator_write_node, binary_operator) - 72usize];
    ["Offset of field: pm_call_operator_write_node::binary_operator_loc"]
        [::std::mem::offset_of!(pm_call_operator_write_node, binary_operator_loc) - 80usize];
    ["Offset of field: pm_call_operator_write_node::value"]
        [::std::mem::offset_of!(pm_call_operator_write_node, value) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_call_or_write_node"][::std::mem::size_of::<pm_call_or_write_node>() - 96usize];
    ["Alignment of pm_call_or_write_node"]
        [::std::mem::align_of::<pm_call_or_write_node>() - 8usize];
    ["Offset of field: pm_call_or_write_node::base"]
        [::std::mem::offset_of!(pm_call_or_write_node, base) - 0usize];
    ["Offset of field: pm_call_or_write_node::receiver"]
        [::std::mem::offset_of!(pm_call_or_write_node, receiver) - 24usize];
    ["Offset of field: pm_call_or_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_call_or_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_call_or_write_node::message_loc"]
        [::std::mem::offset_of!(pm_call_or_write_node, message_loc) - 48usize];
    ["Offset of field: pm_call_or_write_node::read_name"]
        [::std::mem::offset_of!(pm_call_or_write_node, read_name) - 64usize];
    ["Offset of field: pm_call_or_write_node::write_name"]
        [::std::mem::offset_of!(pm_call_or_write_node, write_name) - 68usize];
    ["Offset of field: pm_call_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_call_or_write_node, operator_loc) - 72usize];
    ["Offset of field: pm_call_or_write_node::value"]
        [::std::mem::offset_of!(pm_call_or_write_node, value) - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_call_target_node"][::std::mem::size_of::<pm_call_target_node>() - 72usize];
    ["Alignment of pm_call_target_node"][::std::mem::align_of::<pm_call_target_node>() - 8usize];
    ["Offset of field: pm_call_target_node::base"]
        [::std::mem::offset_of!(pm_call_target_node, base) - 0usize];
    ["Offset of field: pm_call_target_node::receiver"]
        [::std::mem::offset_of!(pm_call_target_node, receiver) - 24usize];
    ["Offset of field: pm_call_target_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_call_target_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_call_target_node::name"]
        [::std::mem::offset_of!(pm_call_target_node, name) - 48usize];
    ["Offset of field: pm_call_target_node::message_loc"]
        [::std::mem::offset_of!(pm_call_target_node, message_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_capture_pattern_node"][::std::mem::size_of::<pm_capture_pattern_node>() - 56usize];
    ["Alignment of pm_capture_pattern_node"]
        [::std::mem::align_of::<pm_capture_pattern_node>() - 8usize];
    ["Offset of field: pm_capture_pattern_node::base"]
        [::std::mem::offset_of!(pm_capture_pattern_node, base) - 0usize];
    ["Offset of field: pm_capture_pattern_node::value"]
        [::std::mem::offset_of!(pm_capture_pattern_node, value) - 24usize];
    ["Offset of field: pm_capture_pattern_node::target"]
        [::std::mem::offset_of!(pm_capture_pattern_node, target) - 32usize];
    ["Offset of field: pm_capture_pattern_node::operator_loc"]
        [::std::mem::offset_of!(pm_capture_pattern_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_case_match_node"][::std::mem::size_of::<pm_case_match_node>() - 96usize];
    ["Alignment of pm_case_match_node"][::std::mem::align_of::<pm_case_match_node>() - 8usize];
    ["Offset of field: pm_case_match_node::base"]
        [::std::mem::offset_of!(pm_case_match_node, base) - 0usize];
    ["Offset of field: pm_case_match_node::predicate"]
        [::std::mem::offset_of!(pm_case_match_node, predicate) - 24usize];
    ["Offset of field: pm_case_match_node::conditions"]
        [::std::mem::offset_of!(pm_case_match_node, conditions) - 32usize];
    ["Offset of field: pm_case_match_node::else_clause"]
        [::std::mem::offset_of!(pm_case_match_node, else_clause) - 56usize];
    ["Offset of field: pm_case_match_node::case_keyword_loc"]
        [::std::mem::offset_of!(pm_case_match_node, case_keyword_loc) - 64usize];
    ["Offset of field: pm_case_match_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_case_match_node, end_keyword_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_case_node"][::std::mem::size_of::<pm_case_node>() - 96usize];
    ["Alignment of pm_case_node"][::std::mem::align_of::<pm_case_node>() - 8usize];
    ["Offset of field: pm_case_node::base"][::std::mem::offset_of!(pm_case_node, base) - 0usize];
    ["Offset of field: pm_case_node::predicate"]
        [::std::mem::offset_of!(pm_case_node, predicate) - 24usize];
    ["Offset of field: pm_case_node::conditions"]
        [::std::mem::offset_of!(pm_case_node, conditions) - 32usize];
    ["Offset of field: pm_case_node::else_clause"]
        [::std::mem::offset_of!(pm_case_node, else_clause) - 56usize];
    ["Offset of field: pm_case_node::case_keyword_loc"]
        [::std::mem::offset_of!(pm_case_node, case_keyword_loc) - 64usize];
    ["Offset of field: pm_case_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_case_node, end_keyword_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_node"][::std::mem::size_of::<pm_class_node>() - 128usize];
    ["Alignment of pm_class_node"][::std::mem::align_of::<pm_class_node>() - 8usize];
    ["Offset of field: pm_class_node::base"][::std::mem::offset_of!(pm_class_node, base) - 0usize];
    ["Offset of field: pm_class_node::locals"]
        [::std::mem::offset_of!(pm_class_node, locals) - 24usize];
    ["Offset of field: pm_class_node::class_keyword_loc"]
        [::std::mem::offset_of!(pm_class_node, class_keyword_loc) - 48usize];
    ["Offset of field: pm_class_node::constant_path"]
        [::std::mem::offset_of!(pm_class_node, constant_path) - 64usize];
    ["Offset of field: pm_class_node::inheritance_operator_loc"]
        [::std::mem::offset_of!(pm_class_node, inheritance_operator_loc) - 72usize];
    ["Offset of field: pm_class_node::superclass"]
        [::std::mem::offset_of!(pm_class_node, superclass) - 88usize];
    ["Offset of field: pm_class_node::body"][::std::mem::offset_of!(pm_class_node, body) - 96usize];
    ["Offset of field: pm_class_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_class_node, end_keyword_loc) - 104usize];
    ["Offset of field: pm_class_node::name"]
        [::std::mem::offset_of!(pm_class_node, name) - 120usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_and_write_node"]
        [::std::mem::size_of::<pm_class_variable_and_write_node>() - 72usize];
    ["Alignment of pm_class_variable_and_write_node"]
        [::std::mem::align_of::<pm_class_variable_and_write_node>() - 8usize];
    ["Offset of field: pm_class_variable_and_write_node::base"]
        [::std::mem::offset_of!(pm_class_variable_and_write_node, base) - 0usize];
    ["Offset of field: pm_class_variable_and_write_node::name"]
        [::std::mem::offset_of!(pm_class_variable_and_write_node, name) - 24usize];
    ["Offset of field: pm_class_variable_and_write_node::name_loc"]
        [::std::mem::offset_of!(pm_class_variable_and_write_node, name_loc) - 32usize];
    ["Offset of field: pm_class_variable_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_class_variable_and_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_class_variable_and_write_node::value"]
        [::std::mem::offset_of!(pm_class_variable_and_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_operator_write_node"]
        [::std::mem::size_of::<pm_class_variable_operator_write_node>() - 80usize];
    ["Alignment of pm_class_variable_operator_write_node"]
        [::std::mem::align_of::<pm_class_variable_operator_write_node>() - 8usize];
    ["Offset of field: pm_class_variable_operator_write_node::base"]
        [::std::mem::offset_of!(pm_class_variable_operator_write_node, base) - 0usize];
    ["Offset of field: pm_class_variable_operator_write_node::name"]
        [::std::mem::offset_of!(pm_class_variable_operator_write_node, name) - 24usize];
    ["Offset of field: pm_class_variable_operator_write_node::name_loc"]
        [::std::mem::offset_of!(pm_class_variable_operator_write_node, name_loc) - 32usize];
    ["Offset of field: pm_class_variable_operator_write_node::binary_operator_loc"][::std::mem::offset_of!(
        pm_class_variable_operator_write_node,
        binary_operator_loc
    ) - 48usize];
    ["Offset of field: pm_class_variable_operator_write_node::value"]
        [::std::mem::offset_of!(pm_class_variable_operator_write_node, value) - 64usize];
    ["Offset of field: pm_class_variable_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_class_variable_operator_write_node, binary_operator) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_or_write_node"]
        [::std::mem::size_of::<pm_class_variable_or_write_node>() - 72usize];
    ["Alignment of pm_class_variable_or_write_node"]
        [::std::mem::align_of::<pm_class_variable_or_write_node>() - 8usize];
    ["Offset of field: pm_class_variable_or_write_node::base"]
        [::std::mem::offset_of!(pm_class_variable_or_write_node, base) - 0usize];
    ["Offset of field: pm_class_variable_or_write_node::name"]
        [::std::mem::offset_of!(pm_class_variable_or_write_node, name) - 24usize];
    ["Offset of field: pm_class_variable_or_write_node::name_loc"]
        [::std::mem::offset_of!(pm_class_variable_or_write_node, name_loc) - 32usize];
    ["Offset of field: pm_class_variable_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_class_variable_or_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_class_variable_or_write_node::value"]
        [::std::mem::offset_of!(pm_class_variable_or_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_read_node"]
        [::std::mem::size_of::<pm_class_variable_read_node>() - 32usize];
    ["Alignment of pm_class_variable_read_node"]
        [::std::mem::align_of::<pm_class_variable_read_node>() - 8usize];
    ["Offset of field: pm_class_variable_read_node::base"]
        [::std::mem::offset_of!(pm_class_variable_read_node, base) - 0usize];
    ["Offset of field: pm_class_variable_read_node::name"]
        [::std::mem::offset_of!(pm_class_variable_read_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_target_node"]
        [::std::mem::size_of::<pm_class_variable_target_node>() - 32usize];
    ["Alignment of pm_class_variable_target_node"]
        [::std::mem::align_of::<pm_class_variable_target_node>() - 8usize];
    ["Offset of field: pm_class_variable_target_node::base"]
        [::std::mem::offset_of!(pm_class_variable_target_node, base) - 0usize];
    ["Offset of field: pm_class_variable_target_node::name"]
        [::std::mem::offset_of!(pm_class_variable_target_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_class_variable_write_node"]
        [::std::mem::size_of::<pm_class_variable_write_node>() - 72usize];
    ["Alignment of pm_class_variable_write_node"]
        [::std::mem::align_of::<pm_class_variable_write_node>() - 8usize];
    ["Offset of field: pm_class_variable_write_node::base"]
        [::std::mem::offset_of!(pm_class_variable_write_node, base) - 0usize];
    ["Offset of field: pm_class_variable_write_node::name"]
        [::std::mem::offset_of!(pm_class_variable_write_node, name) - 24usize];
    ["Offset of field: pm_class_variable_write_node::name_loc"]
        [::std::mem::offset_of!(pm_class_variable_write_node, name_loc) - 32usize];
    ["Offset of field: pm_class_variable_write_node::value"]
        [::std::mem::offset_of!(pm_class_variable_write_node, value) - 48usize];
    ["Offset of field: pm_class_variable_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_class_variable_write_node, operator_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_and_write_node"]
        [::std::mem::size_of::<pm_constant_and_write_node>() - 72usize];
    ["Alignment of pm_constant_and_write_node"]
        [::std::mem::align_of::<pm_constant_and_write_node>() - 8usize];
    ["Offset of field: pm_constant_and_write_node::base"]
        [::std::mem::offset_of!(pm_constant_and_write_node, base) - 0usize];
    ["Offset of field: pm_constant_and_write_node::name"]
        [::std::mem::offset_of!(pm_constant_and_write_node, name) - 24usize];
    ["Offset of field: pm_constant_and_write_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_and_write_node, name_loc) - 32usize];
    ["Offset of field: pm_constant_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_and_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_constant_and_write_node::value"]
        [::std::mem::offset_of!(pm_constant_and_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_operator_write_node"]
        [::std::mem::size_of::<pm_constant_operator_write_node>() - 80usize];
    ["Alignment of pm_constant_operator_write_node"]
        [::std::mem::align_of::<pm_constant_operator_write_node>() - 8usize];
    ["Offset of field: pm_constant_operator_write_node::base"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, base) - 0usize];
    ["Offset of field: pm_constant_operator_write_node::name"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, name) - 24usize];
    ["Offset of field: pm_constant_operator_write_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, name_loc) - 32usize];
    ["Offset of field: pm_constant_operator_write_node::binary_operator_loc"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, binary_operator_loc) - 48usize];
    ["Offset of field: pm_constant_operator_write_node::value"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, value) - 64usize];
    ["Offset of field: pm_constant_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_constant_operator_write_node, binary_operator) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_or_write_node"]
        [::std::mem::size_of::<pm_constant_or_write_node>() - 72usize];
    ["Alignment of pm_constant_or_write_node"]
        [::std::mem::align_of::<pm_constant_or_write_node>() - 8usize];
    ["Offset of field: pm_constant_or_write_node::base"]
        [::std::mem::offset_of!(pm_constant_or_write_node, base) - 0usize];
    ["Offset of field: pm_constant_or_write_node::name"]
        [::std::mem::offset_of!(pm_constant_or_write_node, name) - 24usize];
    ["Offset of field: pm_constant_or_write_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_or_write_node, name_loc) - 32usize];
    ["Offset of field: pm_constant_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_or_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_constant_or_write_node::value"]
        [::std::mem::offset_of!(pm_constant_or_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_and_write_node"]
        [::std::mem::size_of::<pm_constant_path_and_write_node>() - 56usize];
    ["Alignment of pm_constant_path_and_write_node"]
        [::std::mem::align_of::<pm_constant_path_and_write_node>() - 8usize];
    ["Offset of field: pm_constant_path_and_write_node::base"]
        [::std::mem::offset_of!(pm_constant_path_and_write_node, base) - 0usize];
    ["Offset of field: pm_constant_path_and_write_node::target"]
        [::std::mem::offset_of!(pm_constant_path_and_write_node, target) - 24usize];
    ["Offset of field: pm_constant_path_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_path_and_write_node, operator_loc) - 32usize];
    ["Offset of field: pm_constant_path_and_write_node::value"]
        [::std::mem::offset_of!(pm_constant_path_and_write_node, value) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_node"][::std::mem::size_of::<pm_constant_path_node>() - 72usize];
    ["Alignment of pm_constant_path_node"]
        [::std::mem::align_of::<pm_constant_path_node>() - 8usize];
    ["Offset of field: pm_constant_path_node::base"]
        [::std::mem::offset_of!(pm_constant_path_node, base) - 0usize];
    ["Offset of field: pm_constant_path_node::parent"]
        [::std::mem::offset_of!(pm_constant_path_node, parent) - 24usize];
    ["Offset of field: pm_constant_path_node::name"]
        [::std::mem::offset_of!(pm_constant_path_node, name) - 32usize];
    ["Offset of field: pm_constant_path_node::delimiter_loc"]
        [::std::mem::offset_of!(pm_constant_path_node, delimiter_loc) - 40usize];
    ["Offset of field: pm_constant_path_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_path_node, name_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_operator_write_node"]
        [::std::mem::size_of::<pm_constant_path_operator_write_node>() - 64usize];
    ["Alignment of pm_constant_path_operator_write_node"]
        [::std::mem::align_of::<pm_constant_path_operator_write_node>() - 8usize];
    ["Offset of field: pm_constant_path_operator_write_node::base"]
        [::std::mem::offset_of!(pm_constant_path_operator_write_node, base) - 0usize];
    ["Offset of field: pm_constant_path_operator_write_node::target"]
        [::std::mem::offset_of!(pm_constant_path_operator_write_node, target) - 24usize];
    ["Offset of field: pm_constant_path_operator_write_node::binary_operator_loc"][::std::mem::offset_of!(
        pm_constant_path_operator_write_node,
        binary_operator_loc
    ) - 32usize];
    ["Offset of field: pm_constant_path_operator_write_node::value"]
        [::std::mem::offset_of!(pm_constant_path_operator_write_node, value) - 48usize];
    ["Offset of field: pm_constant_path_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_constant_path_operator_write_node, binary_operator) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_or_write_node"]
        [::std::mem::size_of::<pm_constant_path_or_write_node>() - 56usize];
    ["Alignment of pm_constant_path_or_write_node"]
        [::std::mem::align_of::<pm_constant_path_or_write_node>() - 8usize];
    ["Offset of field: pm_constant_path_or_write_node::base"]
        [::std::mem::offset_of!(pm_constant_path_or_write_node, base) - 0usize];
    ["Offset of field: pm_constant_path_or_write_node::target"]
        [::std::mem::offset_of!(pm_constant_path_or_write_node, target) - 24usize];
    ["Offset of field: pm_constant_path_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_path_or_write_node, operator_loc) - 32usize];
    ["Offset of field: pm_constant_path_or_write_node::value"]
        [::std::mem::offset_of!(pm_constant_path_or_write_node, value) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_target_node"]
        [::std::mem::size_of::<pm_constant_path_target_node>() - 72usize];
    ["Alignment of pm_constant_path_target_node"]
        [::std::mem::align_of::<pm_constant_path_target_node>() - 8usize];
    ["Offset of field: pm_constant_path_target_node::base"]
        [::std::mem::offset_of!(pm_constant_path_target_node, base) - 0usize];
    ["Offset of field: pm_constant_path_target_node::parent"]
        [::std::mem::offset_of!(pm_constant_path_target_node, parent) - 24usize];
    ["Offset of field: pm_constant_path_target_node::name"]
        [::std::mem::offset_of!(pm_constant_path_target_node, name) - 32usize];
    ["Offset of field: pm_constant_path_target_node::delimiter_loc"]
        [::std::mem::offset_of!(pm_constant_path_target_node, delimiter_loc) - 40usize];
    ["Offset of field: pm_constant_path_target_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_path_target_node, name_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_path_write_node"]
        [::std::mem::size_of::<pm_constant_path_write_node>() - 56usize];
    ["Alignment of pm_constant_path_write_node"]
        [::std::mem::align_of::<pm_constant_path_write_node>() - 8usize];
    ["Offset of field: pm_constant_path_write_node::base"]
        [::std::mem::offset_of!(pm_constant_path_write_node, base) - 0usize];
    ["Offset of field: pm_constant_path_write_node::target"]
        [::std::mem::offset_of!(pm_constant_path_write_node, target) - 24usize];
    ["Offset of field: pm_constant_path_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_path_write_node, operator_loc) - 32usize];
    ["Offset of field: pm_constant_path_write_node::value"]
        [::std::mem::offset_of!(pm_constant_path_write_node, value) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_read_node"][::std::mem::size_of::<pm_constant_read_node>() - 32usize];
    ["Alignment of pm_constant_read_node"]
        [::std::mem::align_of::<pm_constant_read_node>() - 8usize];
    ["Offset of field: pm_constant_read_node::base"]
        [::std::mem::offset_of!(pm_constant_read_node, base) - 0usize];
    ["Offset of field: pm_constant_read_node::name"]
        [::std::mem::offset_of!(pm_constant_read_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_target_node"][::std::mem::size_of::<pm_constant_target_node>() - 32usize];
    ["Alignment of pm_constant_target_node"]
        [::std::mem::align_of::<pm_constant_target_node>() - 8usize];
    ["Offset of field: pm_constant_target_node::base"]
        [::std::mem::offset_of!(pm_constant_target_node, base) - 0usize];
    ["Offset of field: pm_constant_target_node::name"]
        [::std::mem::offset_of!(pm_constant_target_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_constant_write_node"][::std::mem::size_of::<pm_constant_write_node>() - 72usize];
    ["Alignment of pm_constant_write_node"]
        [::std::mem::align_of::<pm_constant_write_node>() - 8usize];
    ["Offset of field: pm_constant_write_node::base"]
        [::std::mem::offset_of!(pm_constant_write_node, base) - 0usize];
    ["Offset of field: pm_constant_write_node::name"]
        [::std::mem::offset_of!(pm_constant_write_node, name) - 24usize];
    ["Offset of field: pm_constant_write_node::name_loc"]
        [::std::mem::offset_of!(pm_constant_write_node, name_loc) - 32usize];
    ["Offset of field: pm_constant_write_node::value"]
        [::std::mem::offset_of!(pm_constant_write_node, value) - 48usize];
    ["Offset of field: pm_constant_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_constant_write_node, operator_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_def_node"][::std::mem::size_of::<pm_def_node>() - 192usize];
    ["Alignment of pm_def_node"][::std::mem::align_of::<pm_def_node>() - 8usize];
    ["Offset of field: pm_def_node::base"][::std::mem::offset_of!(pm_def_node, base) - 0usize];
    ["Offset of field: pm_def_node::name"][::std::mem::offset_of!(pm_def_node, name) - 24usize];
    ["Offset of field: pm_def_node::name_loc"]
        [::std::mem::offset_of!(pm_def_node, name_loc) - 32usize];
    ["Offset of field: pm_def_node::receiver"]
        [::std::mem::offset_of!(pm_def_node, receiver) - 48usize];
    ["Offset of field: pm_def_node::parameters"]
        [::std::mem::offset_of!(pm_def_node, parameters) - 56usize];
    ["Offset of field: pm_def_node::body"][::std::mem::offset_of!(pm_def_node, body) - 64usize];
    ["Offset of field: pm_def_node::locals"][::std::mem::offset_of!(pm_def_node, locals) - 72usize];
    ["Offset of field: pm_def_node::def_keyword_loc"]
        [::std::mem::offset_of!(pm_def_node, def_keyword_loc) - 96usize];
    ["Offset of field: pm_def_node::operator_loc"]
        [::std::mem::offset_of!(pm_def_node, operator_loc) - 112usize];
    ["Offset of field: pm_def_node::lparen_loc"]
        [::std::mem::offset_of!(pm_def_node, lparen_loc) - 128usize];
    ["Offset of field: pm_def_node::rparen_loc"]
        [::std::mem::offset_of!(pm_def_node, rparen_loc) - 144usize];
    ["Offset of field: pm_def_node::equal_loc"]
        [::std::mem::offset_of!(pm_def_node, equal_loc) - 160usize];
    ["Offset of field: pm_def_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_def_node, end_keyword_loc) - 176usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_defined_node"][::std::mem::size_of::<pm_defined_node>() - 80usize];
    ["Alignment of pm_defined_node"][::std::mem::align_of::<pm_defined_node>() - 8usize];
    ["Offset of field: pm_defined_node::base"]
        [::std::mem::offset_of!(pm_defined_node, base) - 0usize];
    ["Offset of field: pm_defined_node::lparen_loc"]
        [::std::mem::offset_of!(pm_defined_node, lparen_loc) - 24usize];
    ["Offset of field: pm_defined_node::value"]
        [::std::mem::offset_of!(pm_defined_node, value) - 40usize];
    ["Offset of field: pm_defined_node::rparen_loc"]
        [::std::mem::offset_of!(pm_defined_node, rparen_loc) - 48usize];
    ["Offset of field: pm_defined_node::keyword_loc"]
        [::std::mem::offset_of!(pm_defined_node, keyword_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_else_node"][::std::mem::size_of::<pm_else_node>() - 64usize];
    ["Alignment of pm_else_node"][::std::mem::align_of::<pm_else_node>() - 8usize];
    ["Offset of field: pm_else_node::base"][::std::mem::offset_of!(pm_else_node, base) - 0usize];
    ["Offset of field: pm_else_node::else_keyword_loc"]
        [::std::mem::offset_of!(pm_else_node, else_keyword_loc) - 24usize];
    ["Offset of field: pm_else_node::statements"]
        [::std::mem::offset_of!(pm_else_node, statements) - 40usize];
    ["Offset of field: pm_else_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_else_node, end_keyword_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_embedded_statements_node"]
        [::std::mem::size_of::<pm_embedded_statements_node>() - 64usize];
    ["Alignment of pm_embedded_statements_node"]
        [::std::mem::align_of::<pm_embedded_statements_node>() - 8usize];
    ["Offset of field: pm_embedded_statements_node::base"]
        [::std::mem::offset_of!(pm_embedded_statements_node, base) - 0usize];
    ["Offset of field: pm_embedded_statements_node::opening_loc"]
        [::std::mem::offset_of!(pm_embedded_statements_node, opening_loc) - 24usize];
    ["Offset of field: pm_embedded_statements_node::statements"]
        [::std::mem::offset_of!(pm_embedded_statements_node, statements) - 40usize];
    ["Offset of field: pm_embedded_statements_node::closing_loc"]
        [::std::mem::offset_of!(pm_embedded_statements_node, closing_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_embedded_variable_node"]
        [::std::mem::size_of::<pm_embedded_variable_node>() - 48usize];
    ["Alignment of pm_embedded_variable_node"]
        [::std::mem::align_of::<pm_embedded_variable_node>() - 8usize];
    ["Offset of field: pm_embedded_variable_node::base"]
        [::std::mem::offset_of!(pm_embedded_variable_node, base) - 0usize];
    ["Offset of field: pm_embedded_variable_node::operator_loc"]
        [::std::mem::offset_of!(pm_embedded_variable_node, operator_loc) - 24usize];
    ["Offset of field: pm_embedded_variable_node::variable"]
        [::std::mem::offset_of!(pm_embedded_variable_node, variable) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_ensure_node"][::std::mem::size_of::<pm_ensure_node>() - 64usize];
    ["Alignment of pm_ensure_node"][::std::mem::align_of::<pm_ensure_node>() - 8usize];
    ["Offset of field: pm_ensure_node::base"]
        [::std::mem::offset_of!(pm_ensure_node, base) - 0usize];
    ["Offset of field: pm_ensure_node::ensure_keyword_loc"]
        [::std::mem::offset_of!(pm_ensure_node, ensure_keyword_loc) - 24usize];
    ["Offset of field: pm_ensure_node::statements"]
        [::std::mem::offset_of!(pm_ensure_node, statements) - 40usize];
    ["Offset of field: pm_ensure_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_ensure_node, end_keyword_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_false_node"][::std::mem::size_of::<pm_false_node>() - 24usize];
    ["Alignment of pm_false_node"][::std::mem::align_of::<pm_false_node>() - 8usize];
    ["Offset of field: pm_false_node::base"][::std::mem::offset_of!(pm_false_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_find_pattern_node"][::std::mem::size_of::<pm_find_pattern_node>() - 104usize];
    ["Alignment of pm_find_pattern_node"][::std::mem::align_of::<pm_find_pattern_node>() - 8usize];
    ["Offset of field: pm_find_pattern_node::base"]
        [::std::mem::offset_of!(pm_find_pattern_node, base) - 0usize];
    ["Offset of field: pm_find_pattern_node::constant"]
        [::std::mem::offset_of!(pm_find_pattern_node, constant) - 24usize];
    ["Offset of field: pm_find_pattern_node::left"]
        [::std::mem::offset_of!(pm_find_pattern_node, left) - 32usize];
    ["Offset of field: pm_find_pattern_node::requireds"]
        [::std::mem::offset_of!(pm_find_pattern_node, requireds) - 40usize];
    ["Offset of field: pm_find_pattern_node::right"]
        [::std::mem::offset_of!(pm_find_pattern_node, right) - 64usize];
    ["Offset of field: pm_find_pattern_node::opening_loc"]
        [::std::mem::offset_of!(pm_find_pattern_node, opening_loc) - 72usize];
    ["Offset of field: pm_find_pattern_node::closing_loc"]
        [::std::mem::offset_of!(pm_find_pattern_node, closing_loc) - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_flip_flop_node"][::std::mem::size_of::<pm_flip_flop_node>() - 56usize];
    ["Alignment of pm_flip_flop_node"][::std::mem::align_of::<pm_flip_flop_node>() - 8usize];
    ["Offset of field: pm_flip_flop_node::base"]
        [::std::mem::offset_of!(pm_flip_flop_node, base) - 0usize];
    ["Offset of field: pm_flip_flop_node::left"]
        [::std::mem::offset_of!(pm_flip_flop_node, left) - 24usize];
    ["Offset of field: pm_flip_flop_node::right"]
        [::std::mem::offset_of!(pm_flip_flop_node, right) - 32usize];
    ["Offset of field: pm_flip_flop_node::operator_loc"]
        [::std::mem::offset_of!(pm_flip_flop_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_float_node"][::std::mem::size_of::<pm_float_node>() - 32usize];
    ["Alignment of pm_float_node"][::std::mem::align_of::<pm_float_node>() - 8usize];
    ["Offset of field: pm_float_node::base"][::std::mem::offset_of!(pm_float_node, base) - 0usize];
    ["Offset of field: pm_float_node::value"]
        [::std::mem::offset_of!(pm_float_node, value) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_for_node"][::std::mem::size_of::<pm_for_node>() - 112usize];
    ["Alignment of pm_for_node"][::std::mem::align_of::<pm_for_node>() - 8usize];
    ["Offset of field: pm_for_node::base"][::std::mem::offset_of!(pm_for_node, base) - 0usize];
    ["Offset of field: pm_for_node::index"][::std::mem::offset_of!(pm_for_node, index) - 24usize];
    ["Offset of field: pm_for_node::collection"]
        [::std::mem::offset_of!(pm_for_node, collection) - 32usize];
    ["Offset of field: pm_for_node::statements"]
        [::std::mem::offset_of!(pm_for_node, statements) - 40usize];
    ["Offset of field: pm_for_node::for_keyword_loc"]
        [::std::mem::offset_of!(pm_for_node, for_keyword_loc) - 48usize];
    ["Offset of field: pm_for_node::in_keyword_loc"]
        [::std::mem::offset_of!(pm_for_node, in_keyword_loc) - 64usize];
    ["Offset of field: pm_for_node::do_keyword_loc"]
        [::std::mem::offset_of!(pm_for_node, do_keyword_loc) - 80usize];
    ["Offset of field: pm_for_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_for_node, end_keyword_loc) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_forwarding_arguments_node"]
        [::std::mem::size_of::<pm_forwarding_arguments_node>() - 24usize];
    ["Alignment of pm_forwarding_arguments_node"]
        [::std::mem::align_of::<pm_forwarding_arguments_node>() - 8usize];
    ["Offset of field: pm_forwarding_arguments_node::base"]
        [::std::mem::offset_of!(pm_forwarding_arguments_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_forwarding_parameter_node"]
        [::std::mem::size_of::<pm_forwarding_parameter_node>() - 24usize];
    ["Alignment of pm_forwarding_parameter_node"]
        [::std::mem::align_of::<pm_forwarding_parameter_node>() - 8usize];
    ["Offset of field: pm_forwarding_parameter_node::base"]
        [::std::mem::offset_of!(pm_forwarding_parameter_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_forwarding_super_node"]
        [::std::mem::size_of::<pm_forwarding_super_node>() - 32usize];
    ["Alignment of pm_forwarding_super_node"]
        [::std::mem::align_of::<pm_forwarding_super_node>() - 8usize];
    ["Offset of field: pm_forwarding_super_node::base"]
        [::std::mem::offset_of!(pm_forwarding_super_node, base) - 0usize];
    ["Offset of field: pm_forwarding_super_node::block"]
        [::std::mem::offset_of!(pm_forwarding_super_node, block) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_and_write_node"]
        [::std::mem::size_of::<pm_global_variable_and_write_node>() - 72usize];
    ["Alignment of pm_global_variable_and_write_node"]
        [::std::mem::align_of::<pm_global_variable_and_write_node>() - 8usize];
    ["Offset of field: pm_global_variable_and_write_node::base"]
        [::std::mem::offset_of!(pm_global_variable_and_write_node, base) - 0usize];
    ["Offset of field: pm_global_variable_and_write_node::name"]
        [::std::mem::offset_of!(pm_global_variable_and_write_node, name) - 24usize];
    ["Offset of field: pm_global_variable_and_write_node::name_loc"]
        [::std::mem::offset_of!(pm_global_variable_and_write_node, name_loc) - 32usize];
    ["Offset of field: pm_global_variable_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_global_variable_and_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_global_variable_and_write_node::value"]
        [::std::mem::offset_of!(pm_global_variable_and_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_operator_write_node"]
        [::std::mem::size_of::<pm_global_variable_operator_write_node>() - 80usize];
    ["Alignment of pm_global_variable_operator_write_node"]
        [::std::mem::align_of::<pm_global_variable_operator_write_node>() - 8usize];
    ["Offset of field: pm_global_variable_operator_write_node::base"]
        [::std::mem::offset_of!(pm_global_variable_operator_write_node, base) - 0usize];
    ["Offset of field: pm_global_variable_operator_write_node::name"]
        [::std::mem::offset_of!(pm_global_variable_operator_write_node, name) - 24usize];
    ["Offset of field: pm_global_variable_operator_write_node::name_loc"]
        [::std::mem::offset_of!(pm_global_variable_operator_write_node, name_loc) - 32usize];
    ["Offset of field: pm_global_variable_operator_write_node::binary_operator_loc"][::std::mem::offset_of!(
        pm_global_variable_operator_write_node,
        binary_operator_loc
    ) - 48usize];
    ["Offset of field: pm_global_variable_operator_write_node::value"]
        [::std::mem::offset_of!(pm_global_variable_operator_write_node, value) - 64usize];
    ["Offset of field: pm_global_variable_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_global_variable_operator_write_node, binary_operator) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_or_write_node"]
        [::std::mem::size_of::<pm_global_variable_or_write_node>() - 72usize];
    ["Alignment of pm_global_variable_or_write_node"]
        [::std::mem::align_of::<pm_global_variable_or_write_node>() - 8usize];
    ["Offset of field: pm_global_variable_or_write_node::base"]
        [::std::mem::offset_of!(pm_global_variable_or_write_node, base) - 0usize];
    ["Offset of field: pm_global_variable_or_write_node::name"]
        [::std::mem::offset_of!(pm_global_variable_or_write_node, name) - 24usize];
    ["Offset of field: pm_global_variable_or_write_node::name_loc"]
        [::std::mem::offset_of!(pm_global_variable_or_write_node, name_loc) - 32usize];
    ["Offset of field: pm_global_variable_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_global_variable_or_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_global_variable_or_write_node::value"]
        [::std::mem::offset_of!(pm_global_variable_or_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_read_node"]
        [::std::mem::size_of::<pm_global_variable_read_node>() - 32usize];
    ["Alignment of pm_global_variable_read_node"]
        [::std::mem::align_of::<pm_global_variable_read_node>() - 8usize];
    ["Offset of field: pm_global_variable_read_node::base"]
        [::std::mem::offset_of!(pm_global_variable_read_node, base) - 0usize];
    ["Offset of field: pm_global_variable_read_node::name"]
        [::std::mem::offset_of!(pm_global_variable_read_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_target_node"]
        [::std::mem::size_of::<pm_global_variable_target_node>() - 32usize];
    ["Alignment of pm_global_variable_target_node"]
        [::std::mem::align_of::<pm_global_variable_target_node>() - 8usize];
    ["Offset of field: pm_global_variable_target_node::base"]
        [::std::mem::offset_of!(pm_global_variable_target_node, base) - 0usize];
    ["Offset of field: pm_global_variable_target_node::name"]
        [::std::mem::offset_of!(pm_global_variable_target_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_global_variable_write_node"]
        [::std::mem::size_of::<pm_global_variable_write_node>() - 72usize];
    ["Alignment of pm_global_variable_write_node"]
        [::std::mem::align_of::<pm_global_variable_write_node>() - 8usize];
    ["Offset of field: pm_global_variable_write_node::base"]
        [::std::mem::offset_of!(pm_global_variable_write_node, base) - 0usize];
    ["Offset of field: pm_global_variable_write_node::name"]
        [::std::mem::offset_of!(pm_global_variable_write_node, name) - 24usize];
    ["Offset of field: pm_global_variable_write_node::name_loc"]
        [::std::mem::offset_of!(pm_global_variable_write_node, name_loc) - 32usize];
    ["Offset of field: pm_global_variable_write_node::value"]
        [::std::mem::offset_of!(pm_global_variable_write_node, value) - 48usize];
    ["Offset of field: pm_global_variable_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_global_variable_write_node, operator_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_hash_node"][::std::mem::size_of::<pm_hash_node>() - 80usize];
    ["Alignment of pm_hash_node"][::std::mem::align_of::<pm_hash_node>() - 8usize];
    ["Offset of field: pm_hash_node::base"][::std::mem::offset_of!(pm_hash_node, base) - 0usize];
    ["Offset of field: pm_hash_node::opening_loc"]
        [::std::mem::offset_of!(pm_hash_node, opening_loc) - 24usize];
    ["Offset of field: pm_hash_node::elements"]
        [::std::mem::offset_of!(pm_hash_node, elements) - 40usize];
    ["Offset of field: pm_hash_node::closing_loc"]
        [::std::mem::offset_of!(pm_hash_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_hash_pattern_node"][::std::mem::size_of::<pm_hash_pattern_node>() - 96usize];
    ["Alignment of pm_hash_pattern_node"][::std::mem::align_of::<pm_hash_pattern_node>() - 8usize];
    ["Offset of field: pm_hash_pattern_node::base"]
        [::std::mem::offset_of!(pm_hash_pattern_node, base) - 0usize];
    ["Offset of field: pm_hash_pattern_node::constant"]
        [::std::mem::offset_of!(pm_hash_pattern_node, constant) - 24usize];
    ["Offset of field: pm_hash_pattern_node::elements"]
        [::std::mem::offset_of!(pm_hash_pattern_node, elements) - 32usize];
    ["Offset of field: pm_hash_pattern_node::rest"]
        [::std::mem::offset_of!(pm_hash_pattern_node, rest) - 56usize];
    ["Offset of field: pm_hash_pattern_node::opening_loc"]
        [::std::mem::offset_of!(pm_hash_pattern_node, opening_loc) - 64usize];
    ["Offset of field: pm_hash_pattern_node::closing_loc"]
        [::std::mem::offset_of!(pm_hash_pattern_node, closing_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_if_node"][::std::mem::size_of::<pm_if_node>() - 96usize];
    ["Alignment of pm_if_node"][::std::mem::align_of::<pm_if_node>() - 8usize];
    ["Offset of field: pm_if_node::base"][::std::mem::offset_of!(pm_if_node, base) - 0usize];
    ["Offset of field: pm_if_node::if_keyword_loc"]
        [::std::mem::offset_of!(pm_if_node, if_keyword_loc) - 24usize];
    ["Offset of field: pm_if_node::predicate"]
        [::std::mem::offset_of!(pm_if_node, predicate) - 40usize];
    ["Offset of field: pm_if_node::then_keyword_loc"]
        [::std::mem::offset_of!(pm_if_node, then_keyword_loc) - 48usize];
    ["Offset of field: pm_if_node::statements"]
        [::std::mem::offset_of!(pm_if_node, statements) - 64usize];
    ["Offset of field: pm_if_node::subsequent"]
        [::std::mem::offset_of!(pm_if_node, subsequent) - 72usize];
    ["Offset of field: pm_if_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_if_node, end_keyword_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_imaginary_node"][::std::mem::size_of::<pm_imaginary_node>() - 32usize];
    ["Alignment of pm_imaginary_node"][::std::mem::align_of::<pm_imaginary_node>() - 8usize];
    ["Offset of field: pm_imaginary_node::base"]
        [::std::mem::offset_of!(pm_imaginary_node, base) - 0usize];
    ["Offset of field: pm_imaginary_node::numeric"]
        [::std::mem::offset_of!(pm_imaginary_node, numeric) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_implicit_node"][::std::mem::size_of::<pm_implicit_node>() - 32usize];
    ["Alignment of pm_implicit_node"][::std::mem::align_of::<pm_implicit_node>() - 8usize];
    ["Offset of field: pm_implicit_node::base"]
        [::std::mem::offset_of!(pm_implicit_node, base) - 0usize];
    ["Offset of field: pm_implicit_node::value"]
        [::std::mem::offset_of!(pm_implicit_node, value) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_implicit_rest_node"][::std::mem::size_of::<pm_implicit_rest_node>() - 24usize];
    ["Alignment of pm_implicit_rest_node"]
        [::std::mem::align_of::<pm_implicit_rest_node>() - 8usize];
    ["Offset of field: pm_implicit_rest_node::base"]
        [::std::mem::offset_of!(pm_implicit_rest_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_in_node"][::std::mem::size_of::<pm_in_node>() - 72usize];
    ["Alignment of pm_in_node"][::std::mem::align_of::<pm_in_node>() - 8usize];
    ["Offset of field: pm_in_node::base"][::std::mem::offset_of!(pm_in_node, base) - 0usize];
    ["Offset of field: pm_in_node::pattern"][::std::mem::offset_of!(pm_in_node, pattern) - 24usize];
    ["Offset of field: pm_in_node::statements"]
        [::std::mem::offset_of!(pm_in_node, statements) - 32usize];
    ["Offset of field: pm_in_node::in_loc"][::std::mem::offset_of!(pm_in_node, in_loc) - 40usize];
    ["Offset of field: pm_in_node::then_loc"]
        [::std::mem::offset_of!(pm_in_node, then_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_index_and_write_node"]
        [::std::mem::size_of::<pm_index_and_write_node>() - 120usize];
    ["Alignment of pm_index_and_write_node"]
        [::std::mem::align_of::<pm_index_and_write_node>() - 8usize];
    ["Offset of field: pm_index_and_write_node::base"]
        [::std::mem::offset_of!(pm_index_and_write_node, base) - 0usize];
    ["Offset of field: pm_index_and_write_node::receiver"]
        [::std::mem::offset_of!(pm_index_and_write_node, receiver) - 24usize];
    ["Offset of field: pm_index_and_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_index_and_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_index_and_write_node::opening_loc"]
        [::std::mem::offset_of!(pm_index_and_write_node, opening_loc) - 48usize];
    ["Offset of field: pm_index_and_write_node::arguments"]
        [::std::mem::offset_of!(pm_index_and_write_node, arguments) - 64usize];
    ["Offset of field: pm_index_and_write_node::closing_loc"]
        [::std::mem::offset_of!(pm_index_and_write_node, closing_loc) - 72usize];
    ["Offset of field: pm_index_and_write_node::block"]
        [::std::mem::offset_of!(pm_index_and_write_node, block) - 88usize];
    ["Offset of field: pm_index_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_index_and_write_node, operator_loc) - 96usize];
    ["Offset of field: pm_index_and_write_node::value"]
        [::std::mem::offset_of!(pm_index_and_write_node, value) - 112usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_index_operator_write_node"]
        [::std::mem::size_of::<pm_index_operator_write_node>() - 128usize];
    ["Alignment of pm_index_operator_write_node"]
        [::std::mem::align_of::<pm_index_operator_write_node>() - 8usize];
    ["Offset of field: pm_index_operator_write_node::base"]
        [::std::mem::offset_of!(pm_index_operator_write_node, base) - 0usize];
    ["Offset of field: pm_index_operator_write_node::receiver"]
        [::std::mem::offset_of!(pm_index_operator_write_node, receiver) - 24usize];
    ["Offset of field: pm_index_operator_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_index_operator_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_index_operator_write_node::opening_loc"]
        [::std::mem::offset_of!(pm_index_operator_write_node, opening_loc) - 48usize];
    ["Offset of field: pm_index_operator_write_node::arguments"]
        [::std::mem::offset_of!(pm_index_operator_write_node, arguments) - 64usize];
    ["Offset of field: pm_index_operator_write_node::closing_loc"]
        [::std::mem::offset_of!(pm_index_operator_write_node, closing_loc) - 72usize];
    ["Offset of field: pm_index_operator_write_node::block"]
        [::std::mem::offset_of!(pm_index_operator_write_node, block) - 88usize];
    ["Offset of field: pm_index_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_index_operator_write_node, binary_operator) - 96usize];
    ["Offset of field: pm_index_operator_write_node::binary_operator_loc"]
        [::std::mem::offset_of!(pm_index_operator_write_node, binary_operator_loc) - 104usize];
    ["Offset of field: pm_index_operator_write_node::value"]
        [::std::mem::offset_of!(pm_index_operator_write_node, value) - 120usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_index_or_write_node"][::std::mem::size_of::<pm_index_or_write_node>() - 120usize];
    ["Alignment of pm_index_or_write_node"]
        [::std::mem::align_of::<pm_index_or_write_node>() - 8usize];
    ["Offset of field: pm_index_or_write_node::base"]
        [::std::mem::offset_of!(pm_index_or_write_node, base) - 0usize];
    ["Offset of field: pm_index_or_write_node::receiver"]
        [::std::mem::offset_of!(pm_index_or_write_node, receiver) - 24usize];
    ["Offset of field: pm_index_or_write_node::call_operator_loc"]
        [::std::mem::offset_of!(pm_index_or_write_node, call_operator_loc) - 32usize];
    ["Offset of field: pm_index_or_write_node::opening_loc"]
        [::std::mem::offset_of!(pm_index_or_write_node, opening_loc) - 48usize];
    ["Offset of field: pm_index_or_write_node::arguments"]
        [::std::mem::offset_of!(pm_index_or_write_node, arguments) - 64usize];
    ["Offset of field: pm_index_or_write_node::closing_loc"]
        [::std::mem::offset_of!(pm_index_or_write_node, closing_loc) - 72usize];
    ["Offset of field: pm_index_or_write_node::block"]
        [::std::mem::offset_of!(pm_index_or_write_node, block) - 88usize];
    ["Offset of field: pm_index_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_index_or_write_node, operator_loc) - 96usize];
    ["Offset of field: pm_index_or_write_node::value"]
        [::std::mem::offset_of!(pm_index_or_write_node, value) - 112usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_index_target_node"][::std::mem::size_of::<pm_index_target_node>() - 80usize];
    ["Alignment of pm_index_target_node"][::std::mem::align_of::<pm_index_target_node>() - 8usize];
    ["Offset of field: pm_index_target_node::base"]
        [::std::mem::offset_of!(pm_index_target_node, base) - 0usize];
    ["Offset of field: pm_index_target_node::receiver"]
        [::std::mem::offset_of!(pm_index_target_node, receiver) - 24usize];
    ["Offset of field: pm_index_target_node::opening_loc"]
        [::std::mem::offset_of!(pm_index_target_node, opening_loc) - 32usize];
    ["Offset of field: pm_index_target_node::arguments"]
        [::std::mem::offset_of!(pm_index_target_node, arguments) - 48usize];
    ["Offset of field: pm_index_target_node::closing_loc"]
        [::std::mem::offset_of!(pm_index_target_node, closing_loc) - 56usize];
    ["Offset of field: pm_index_target_node::block"]
        [::std::mem::offset_of!(pm_index_target_node, block) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_and_write_node"]
        [::std::mem::size_of::<pm_instance_variable_and_write_node>() - 72usize];
    ["Alignment of pm_instance_variable_and_write_node"]
        [::std::mem::align_of::<pm_instance_variable_and_write_node>() - 8usize];
    ["Offset of field: pm_instance_variable_and_write_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_and_write_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_and_write_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_and_write_node, name) - 24usize];
    ["Offset of field: pm_instance_variable_and_write_node::name_loc"]
        [::std::mem::offset_of!(pm_instance_variable_and_write_node, name_loc) - 32usize];
    ["Offset of field: pm_instance_variable_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_instance_variable_and_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_instance_variable_and_write_node::value"]
        [::std::mem::offset_of!(pm_instance_variable_and_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_operator_write_node"]
        [::std::mem::size_of::<pm_instance_variable_operator_write_node>() - 80usize];
    ["Alignment of pm_instance_variable_operator_write_node"]
        [::std::mem::align_of::<pm_instance_variable_operator_write_node>() - 8usize];
    ["Offset of field: pm_instance_variable_operator_write_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_operator_write_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_operator_write_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_operator_write_node, name) - 24usize];
    ["Offset of field: pm_instance_variable_operator_write_node::name_loc"]
        [::std::mem::offset_of!(pm_instance_variable_operator_write_node, name_loc) - 32usize];
    ["Offset of field: pm_instance_variable_operator_write_node::binary_operator_loc"][::std::mem::offset_of!(
        pm_instance_variable_operator_write_node,
        binary_operator_loc
    ) - 48usize];
    ["Offset of field: pm_instance_variable_operator_write_node::value"]
        [::std::mem::offset_of!(pm_instance_variable_operator_write_node, value) - 64usize];
    ["Offset of field: pm_instance_variable_operator_write_node::binary_operator"][::std::mem::offset_of!(
        pm_instance_variable_operator_write_node,
        binary_operator
    ) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_or_write_node"]
        [::std::mem::size_of::<pm_instance_variable_or_write_node>() - 72usize];
    ["Alignment of pm_instance_variable_or_write_node"]
        [::std::mem::align_of::<pm_instance_variable_or_write_node>() - 8usize];
    ["Offset of field: pm_instance_variable_or_write_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_or_write_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_or_write_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_or_write_node, name) - 24usize];
    ["Offset of field: pm_instance_variable_or_write_node::name_loc"]
        [::std::mem::offset_of!(pm_instance_variable_or_write_node, name_loc) - 32usize];
    ["Offset of field: pm_instance_variable_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_instance_variable_or_write_node, operator_loc) - 48usize];
    ["Offset of field: pm_instance_variable_or_write_node::value"]
        [::std::mem::offset_of!(pm_instance_variable_or_write_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_read_node"]
        [::std::mem::size_of::<pm_instance_variable_read_node>() - 32usize];
    ["Alignment of pm_instance_variable_read_node"]
        [::std::mem::align_of::<pm_instance_variable_read_node>() - 8usize];
    ["Offset of field: pm_instance_variable_read_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_read_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_read_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_read_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_target_node"]
        [::std::mem::size_of::<pm_instance_variable_target_node>() - 32usize];
    ["Alignment of pm_instance_variable_target_node"]
        [::std::mem::align_of::<pm_instance_variable_target_node>() - 8usize];
    ["Offset of field: pm_instance_variable_target_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_target_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_target_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_target_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_instance_variable_write_node"]
        [::std::mem::size_of::<pm_instance_variable_write_node>() - 72usize];
    ["Alignment of pm_instance_variable_write_node"]
        [::std::mem::align_of::<pm_instance_variable_write_node>() - 8usize];
    ["Offset of field: pm_instance_variable_write_node::base"]
        [::std::mem::offset_of!(pm_instance_variable_write_node, base) - 0usize];
    ["Offset of field: pm_instance_variable_write_node::name"]
        [::std::mem::offset_of!(pm_instance_variable_write_node, name) - 24usize];
    ["Offset of field: pm_instance_variable_write_node::name_loc"]
        [::std::mem::offset_of!(pm_instance_variable_write_node, name_loc) - 32usize];
    ["Offset of field: pm_instance_variable_write_node::value"]
        [::std::mem::offset_of!(pm_instance_variable_write_node, value) - 48usize];
    ["Offset of field: pm_instance_variable_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_instance_variable_write_node, operator_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_integer_node"][::std::mem::size_of::<pm_integer_node>() - 48usize];
    ["Alignment of pm_integer_node"][::std::mem::align_of::<pm_integer_node>() - 8usize];
    ["Offset of field: pm_integer_node::base"]
        [::std::mem::offset_of!(pm_integer_node, base) - 0usize];
    ["Offset of field: pm_integer_node::value"]
        [::std::mem::offset_of!(pm_integer_node, value) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_interpolated_match_last_line_node"]
        [::std::mem::size_of::<pm_interpolated_match_last_line_node>() - 80usize];
    ["Alignment of pm_interpolated_match_last_line_node"]
        [::std::mem::align_of::<pm_interpolated_match_last_line_node>() - 8usize];
    ["Offset of field: pm_interpolated_match_last_line_node::base"]
        [::std::mem::offset_of!(pm_interpolated_match_last_line_node, base) - 0usize];
    ["Offset of field: pm_interpolated_match_last_line_node::opening_loc"]
        [::std::mem::offset_of!(pm_interpolated_match_last_line_node, opening_loc) - 24usize];
    ["Offset of field: pm_interpolated_match_last_line_node::parts"]
        [::std::mem::offset_of!(pm_interpolated_match_last_line_node, parts) - 40usize];
    ["Offset of field: pm_interpolated_match_last_line_node::closing_loc"]
        [::std::mem::offset_of!(pm_interpolated_match_last_line_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_interpolated_regular_expression_node"]
        [::std::mem::size_of::<pm_interpolated_regular_expression_node>() - 80usize];
    ["Alignment of pm_interpolated_regular_expression_node"]
        [::std::mem::align_of::<pm_interpolated_regular_expression_node>() - 8usize];
    ["Offset of field: pm_interpolated_regular_expression_node::base"]
        [::std::mem::offset_of!(pm_interpolated_regular_expression_node, base) - 0usize];
    ["Offset of field: pm_interpolated_regular_expression_node::opening_loc"]
        [::std::mem::offset_of!(pm_interpolated_regular_expression_node, opening_loc) - 24usize];
    ["Offset of field: pm_interpolated_regular_expression_node::parts"]
        [::std::mem::offset_of!(pm_interpolated_regular_expression_node, parts) - 40usize];
    ["Offset of field: pm_interpolated_regular_expression_node::closing_loc"]
        [::std::mem::offset_of!(pm_interpolated_regular_expression_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_interpolated_string_node"]
        [::std::mem::size_of::<pm_interpolated_string_node>() - 80usize];
    ["Alignment of pm_interpolated_string_node"]
        [::std::mem::align_of::<pm_interpolated_string_node>() - 8usize];
    ["Offset of field: pm_interpolated_string_node::base"]
        [::std::mem::offset_of!(pm_interpolated_string_node, base) - 0usize];
    ["Offset of field: pm_interpolated_string_node::opening_loc"]
        [::std::mem::offset_of!(pm_interpolated_string_node, opening_loc) - 24usize];
    ["Offset of field: pm_interpolated_string_node::parts"]
        [::std::mem::offset_of!(pm_interpolated_string_node, parts) - 40usize];
    ["Offset of field: pm_interpolated_string_node::closing_loc"]
        [::std::mem::offset_of!(pm_interpolated_string_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_interpolated_symbol_node"]
        [::std::mem::size_of::<pm_interpolated_symbol_node>() - 80usize];
    ["Alignment of pm_interpolated_symbol_node"]
        [::std::mem::align_of::<pm_interpolated_symbol_node>() - 8usize];
    ["Offset of field: pm_interpolated_symbol_node::base"]
        [::std::mem::offset_of!(pm_interpolated_symbol_node, base) - 0usize];
    ["Offset of field: pm_interpolated_symbol_node::opening_loc"]
        [::std::mem::offset_of!(pm_interpolated_symbol_node, opening_loc) - 24usize];
    ["Offset of field: pm_interpolated_symbol_node::parts"]
        [::std::mem::offset_of!(pm_interpolated_symbol_node, parts) - 40usize];
    ["Offset of field: pm_interpolated_symbol_node::closing_loc"]
        [::std::mem::offset_of!(pm_interpolated_symbol_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_interpolated_x_string_node"]
        [::std::mem::size_of::<pm_interpolated_x_string_node>() - 80usize];
    ["Alignment of pm_interpolated_x_string_node"]
        [::std::mem::align_of::<pm_interpolated_x_string_node>() - 8usize];
    ["Offset of field: pm_interpolated_x_string_node::base"]
        [::std::mem::offset_of!(pm_interpolated_x_string_node, base) - 0usize];
    ["Offset of field: pm_interpolated_x_string_node::opening_loc"]
        [::std::mem::offset_of!(pm_interpolated_x_string_node, opening_loc) - 24usize];
    ["Offset of field: pm_interpolated_x_string_node::parts"]
        [::std::mem::offset_of!(pm_interpolated_x_string_node, parts) - 40usize];
    ["Offset of field: pm_interpolated_x_string_node::closing_loc"]
        [::std::mem::offset_of!(pm_interpolated_x_string_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_it_local_variable_read_node"]
        [::std::mem::size_of::<pm_it_local_variable_read_node>() - 24usize];
    ["Alignment of pm_it_local_variable_read_node"]
        [::std::mem::align_of::<pm_it_local_variable_read_node>() - 8usize];
    ["Offset of field: pm_it_local_variable_read_node::base"]
        [::std::mem::offset_of!(pm_it_local_variable_read_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_it_parameters_node"][::std::mem::size_of::<pm_it_parameters_node>() - 24usize];
    ["Alignment of pm_it_parameters_node"]
        [::std::mem::align_of::<pm_it_parameters_node>() - 8usize];
    ["Offset of field: pm_it_parameters_node::base"]
        [::std::mem::offset_of!(pm_it_parameters_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_keyword_hash_node"][::std::mem::size_of::<pm_keyword_hash_node>() - 48usize];
    ["Alignment of pm_keyword_hash_node"][::std::mem::align_of::<pm_keyword_hash_node>() - 8usize];
    ["Offset of field: pm_keyword_hash_node::base"]
        [::std::mem::offset_of!(pm_keyword_hash_node, base) - 0usize];
    ["Offset of field: pm_keyword_hash_node::elements"]
        [::std::mem::offset_of!(pm_keyword_hash_node, elements) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_keyword_rest_parameter_node"]
        [::std::mem::size_of::<pm_keyword_rest_parameter_node>() - 64usize];
    ["Alignment of pm_keyword_rest_parameter_node"]
        [::std::mem::align_of::<pm_keyword_rest_parameter_node>() - 8usize];
    ["Offset of field: pm_keyword_rest_parameter_node::base"]
        [::std::mem::offset_of!(pm_keyword_rest_parameter_node, base) - 0usize];
    ["Offset of field: pm_keyword_rest_parameter_node::name"]
        [::std::mem::offset_of!(pm_keyword_rest_parameter_node, name) - 24usize];
    ["Offset of field: pm_keyword_rest_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_keyword_rest_parameter_node, name_loc) - 32usize];
    ["Offset of field: pm_keyword_rest_parameter_node::operator_loc"]
        [::std::mem::offset_of!(pm_keyword_rest_parameter_node, operator_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lambda_node"][::std::mem::size_of::<pm_lambda_node>() - 112usize];
    ["Alignment of pm_lambda_node"][::std::mem::align_of::<pm_lambda_node>() - 8usize];
    ["Offset of field: pm_lambda_node::base"]
        [::std::mem::offset_of!(pm_lambda_node, base) - 0usize];
    ["Offset of field: pm_lambda_node::locals"]
        [::std::mem::offset_of!(pm_lambda_node, locals) - 24usize];
    ["Offset of field: pm_lambda_node::operator_loc"]
        [::std::mem::offset_of!(pm_lambda_node, operator_loc) - 48usize];
    ["Offset of field: pm_lambda_node::opening_loc"]
        [::std::mem::offset_of!(pm_lambda_node, opening_loc) - 64usize];
    ["Offset of field: pm_lambda_node::closing_loc"]
        [::std::mem::offset_of!(pm_lambda_node, closing_loc) - 80usize];
    ["Offset of field: pm_lambda_node::parameters"]
        [::std::mem::offset_of!(pm_lambda_node, parameters) - 96usize];
    ["Offset of field: pm_lambda_node::body"]
        [::std::mem::offset_of!(pm_lambda_node, body) - 104usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_and_write_node"]
        [::std::mem::size_of::<pm_local_variable_and_write_node>() - 72usize];
    ["Alignment of pm_local_variable_and_write_node"]
        [::std::mem::align_of::<pm_local_variable_and_write_node>() - 8usize];
    ["Offset of field: pm_local_variable_and_write_node::base"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, base) - 0usize];
    ["Offset of field: pm_local_variable_and_write_node::name_loc"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, name_loc) - 24usize];
    ["Offset of field: pm_local_variable_and_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, operator_loc) - 40usize];
    ["Offset of field: pm_local_variable_and_write_node::value"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, value) - 56usize];
    ["Offset of field: pm_local_variable_and_write_node::name"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, name) - 64usize];
    ["Offset of field: pm_local_variable_and_write_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_and_write_node, depth) - 68usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_operator_write_node"]
        [::std::mem::size_of::<pm_local_variable_operator_write_node>() - 80usize];
    ["Alignment of pm_local_variable_operator_write_node"]
        [::std::mem::align_of::<pm_local_variable_operator_write_node>() - 8usize];
    ["Offset of field: pm_local_variable_operator_write_node::base"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, base) - 0usize];
    ["Offset of field: pm_local_variable_operator_write_node::name_loc"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, name_loc) - 24usize];
    ["Offset of field: pm_local_variable_operator_write_node::binary_operator_loc"][::std::mem::offset_of!(
        pm_local_variable_operator_write_node,
        binary_operator_loc
    ) - 40usize];
    ["Offset of field: pm_local_variable_operator_write_node::value"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, value) - 56usize];
    ["Offset of field: pm_local_variable_operator_write_node::name"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, name) - 64usize];
    ["Offset of field: pm_local_variable_operator_write_node::binary_operator"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, binary_operator) - 68usize];
    ["Offset of field: pm_local_variable_operator_write_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_operator_write_node, depth) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_or_write_node"]
        [::std::mem::size_of::<pm_local_variable_or_write_node>() - 72usize];
    ["Alignment of pm_local_variable_or_write_node"]
        [::std::mem::align_of::<pm_local_variable_or_write_node>() - 8usize];
    ["Offset of field: pm_local_variable_or_write_node::base"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, base) - 0usize];
    ["Offset of field: pm_local_variable_or_write_node::name_loc"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, name_loc) - 24usize];
    ["Offset of field: pm_local_variable_or_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, operator_loc) - 40usize];
    ["Offset of field: pm_local_variable_or_write_node::value"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, value) - 56usize];
    ["Offset of field: pm_local_variable_or_write_node::name"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, name) - 64usize];
    ["Offset of field: pm_local_variable_or_write_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_or_write_node, depth) - 68usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_read_node"]
        [::std::mem::size_of::<pm_local_variable_read_node>() - 32usize];
    ["Alignment of pm_local_variable_read_node"]
        [::std::mem::align_of::<pm_local_variable_read_node>() - 8usize];
    ["Offset of field: pm_local_variable_read_node::base"]
        [::std::mem::offset_of!(pm_local_variable_read_node, base) - 0usize];
    ["Offset of field: pm_local_variable_read_node::name"]
        [::std::mem::offset_of!(pm_local_variable_read_node, name) - 24usize];
    ["Offset of field: pm_local_variable_read_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_read_node, depth) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_target_node"]
        [::std::mem::size_of::<pm_local_variable_target_node>() - 32usize];
    ["Alignment of pm_local_variable_target_node"]
        [::std::mem::align_of::<pm_local_variable_target_node>() - 8usize];
    ["Offset of field: pm_local_variable_target_node::base"]
        [::std::mem::offset_of!(pm_local_variable_target_node, base) - 0usize];
    ["Offset of field: pm_local_variable_target_node::name"]
        [::std::mem::offset_of!(pm_local_variable_target_node, name) - 24usize];
    ["Offset of field: pm_local_variable_target_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_target_node, depth) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_variable_write_node"]
        [::std::mem::size_of::<pm_local_variable_write_node>() - 72usize];
    ["Alignment of pm_local_variable_write_node"]
        [::std::mem::align_of::<pm_local_variable_write_node>() - 8usize];
    ["Offset of field: pm_local_variable_write_node::base"]
        [::std::mem::offset_of!(pm_local_variable_write_node, base) - 0usize];
    ["Offset of field: pm_local_variable_write_node::name"]
        [::std::mem::offset_of!(pm_local_variable_write_node, name) - 24usize];
    ["Offset of field: pm_local_variable_write_node::depth"]
        [::std::mem::offset_of!(pm_local_variable_write_node, depth) - 28usize];
    ["Offset of field: pm_local_variable_write_node::name_loc"]
        [::std::mem::offset_of!(pm_local_variable_write_node, name_loc) - 32usize];
    ["Offset of field: pm_local_variable_write_node::value"]
        [::std::mem::offset_of!(pm_local_variable_write_node, value) - 48usize];
    ["Offset of field: pm_local_variable_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_local_variable_write_node, operator_loc) - 56usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_match_last_line_node"][::std::mem::size_of::<pm_match_last_line_node>() - 96usize];
    ["Alignment of pm_match_last_line_node"]
        [::std::mem::align_of::<pm_match_last_line_node>() - 8usize];
    ["Offset of field: pm_match_last_line_node::base"]
        [::std::mem::offset_of!(pm_match_last_line_node, base) - 0usize];
    ["Offset of field: pm_match_last_line_node::opening_loc"]
        [::std::mem::offset_of!(pm_match_last_line_node, opening_loc) - 24usize];
    ["Offset of field: pm_match_last_line_node::content_loc"]
        [::std::mem::offset_of!(pm_match_last_line_node, content_loc) - 40usize];
    ["Offset of field: pm_match_last_line_node::closing_loc"]
        [::std::mem::offset_of!(pm_match_last_line_node, closing_loc) - 56usize];
    ["Offset of field: pm_match_last_line_node::unescaped"]
        [::std::mem::offset_of!(pm_match_last_line_node, unescaped) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_match_predicate_node"][::std::mem::size_of::<pm_match_predicate_node>() - 56usize];
    ["Alignment of pm_match_predicate_node"]
        [::std::mem::align_of::<pm_match_predicate_node>() - 8usize];
    ["Offset of field: pm_match_predicate_node::base"]
        [::std::mem::offset_of!(pm_match_predicate_node, base) - 0usize];
    ["Offset of field: pm_match_predicate_node::value"]
        [::std::mem::offset_of!(pm_match_predicate_node, value) - 24usize];
    ["Offset of field: pm_match_predicate_node::pattern"]
        [::std::mem::offset_of!(pm_match_predicate_node, pattern) - 32usize];
    ["Offset of field: pm_match_predicate_node::operator_loc"]
        [::std::mem::offset_of!(pm_match_predicate_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_match_required_node"][::std::mem::size_of::<pm_match_required_node>() - 56usize];
    ["Alignment of pm_match_required_node"]
        [::std::mem::align_of::<pm_match_required_node>() - 8usize];
    ["Offset of field: pm_match_required_node::base"]
        [::std::mem::offset_of!(pm_match_required_node, base) - 0usize];
    ["Offset of field: pm_match_required_node::value"]
        [::std::mem::offset_of!(pm_match_required_node, value) - 24usize];
    ["Offset of field: pm_match_required_node::pattern"]
        [::std::mem::offset_of!(pm_match_required_node, pattern) - 32usize];
    ["Offset of field: pm_match_required_node::operator_loc"]
        [::std::mem::offset_of!(pm_match_required_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_match_write_node"][::std::mem::size_of::<pm_match_write_node>() - 56usize];
    ["Alignment of pm_match_write_node"][::std::mem::align_of::<pm_match_write_node>() - 8usize];
    ["Offset of field: pm_match_write_node::base"]
        [::std::mem::offset_of!(pm_match_write_node, base) - 0usize];
    ["Offset of field: pm_match_write_node::call"]
        [::std::mem::offset_of!(pm_match_write_node, call) - 24usize];
    ["Offset of field: pm_match_write_node::targets"]
        [::std::mem::offset_of!(pm_match_write_node, targets) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_missing_node"][::std::mem::size_of::<pm_missing_node>() - 24usize];
    ["Alignment of pm_missing_node"][::std::mem::align_of::<pm_missing_node>() - 8usize];
    ["Offset of field: pm_missing_node::base"]
        [::std::mem::offset_of!(pm_missing_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_module_node"][::std::mem::size_of::<pm_module_node>() - 104usize];
    ["Alignment of pm_module_node"][::std::mem::align_of::<pm_module_node>() - 8usize];
    ["Offset of field: pm_module_node::base"]
        [::std::mem::offset_of!(pm_module_node, base) - 0usize];
    ["Offset of field: pm_module_node::locals"]
        [::std::mem::offset_of!(pm_module_node, locals) - 24usize];
    ["Offset of field: pm_module_node::module_keyword_loc"]
        [::std::mem::offset_of!(pm_module_node, module_keyword_loc) - 48usize];
    ["Offset of field: pm_module_node::constant_path"]
        [::std::mem::offset_of!(pm_module_node, constant_path) - 64usize];
    ["Offset of field: pm_module_node::body"]
        [::std::mem::offset_of!(pm_module_node, body) - 72usize];
    ["Offset of field: pm_module_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_module_node, end_keyword_loc) - 80usize];
    ["Offset of field: pm_module_node::name"]
        [::std::mem::offset_of!(pm_module_node, name) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_multi_target_node"][::std::mem::size_of::<pm_multi_target_node>() - 112usize];
    ["Alignment of pm_multi_target_node"][::std::mem::align_of::<pm_multi_target_node>() - 8usize];
    ["Offset of field: pm_multi_target_node::base"]
        [::std::mem::offset_of!(pm_multi_target_node, base) - 0usize];
    ["Offset of field: pm_multi_target_node::lefts"]
        [::std::mem::offset_of!(pm_multi_target_node, lefts) - 24usize];
    ["Offset of field: pm_multi_target_node::rest"]
        [::std::mem::offset_of!(pm_multi_target_node, rest) - 48usize];
    ["Offset of field: pm_multi_target_node::rights"]
        [::std::mem::offset_of!(pm_multi_target_node, rights) - 56usize];
    ["Offset of field: pm_multi_target_node::lparen_loc"]
        [::std::mem::offset_of!(pm_multi_target_node, lparen_loc) - 80usize];
    ["Offset of field: pm_multi_target_node::rparen_loc"]
        [::std::mem::offset_of!(pm_multi_target_node, rparen_loc) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_multi_write_node"][::std::mem::size_of::<pm_multi_write_node>() - 136usize];
    ["Alignment of pm_multi_write_node"][::std::mem::align_of::<pm_multi_write_node>() - 8usize];
    ["Offset of field: pm_multi_write_node::base"]
        [::std::mem::offset_of!(pm_multi_write_node, base) - 0usize];
    ["Offset of field: pm_multi_write_node::lefts"]
        [::std::mem::offset_of!(pm_multi_write_node, lefts) - 24usize];
    ["Offset of field: pm_multi_write_node::rest"]
        [::std::mem::offset_of!(pm_multi_write_node, rest) - 48usize];
    ["Offset of field: pm_multi_write_node::rights"]
        [::std::mem::offset_of!(pm_multi_write_node, rights) - 56usize];
    ["Offset of field: pm_multi_write_node::lparen_loc"]
        [::std::mem::offset_of!(pm_multi_write_node, lparen_loc) - 80usize];
    ["Offset of field: pm_multi_write_node::rparen_loc"]
        [::std::mem::offset_of!(pm_multi_write_node, rparen_loc) - 96usize];
    ["Offset of field: pm_multi_write_node::operator_loc"]
        [::std::mem::offset_of!(pm_multi_write_node, operator_loc) - 112usize];
    ["Offset of field: pm_multi_write_node::value"]
        [::std::mem::offset_of!(pm_multi_write_node, value) - 128usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_next_node"][::std::mem::size_of::<pm_next_node>() - 48usize];
    ["Alignment of pm_next_node"][::std::mem::align_of::<pm_next_node>() - 8usize];
    ["Offset of field: pm_next_node::base"][::std::mem::offset_of!(pm_next_node, base) - 0usize];
    ["Offset of field: pm_next_node::arguments"]
        [::std::mem::offset_of!(pm_next_node, arguments) - 24usize];
    ["Offset of field: pm_next_node::keyword_loc"]
        [::std::mem::offset_of!(pm_next_node, keyword_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_nil_node"][::std::mem::size_of::<pm_nil_node>() - 24usize];
    ["Alignment of pm_nil_node"][::std::mem::align_of::<pm_nil_node>() - 8usize];
    ["Offset of field: pm_nil_node::base"][::std::mem::offset_of!(pm_nil_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_no_keywords_parameter_node"]
        [::std::mem::size_of::<pm_no_keywords_parameter_node>() - 56usize];
    ["Alignment of pm_no_keywords_parameter_node"]
        [::std::mem::align_of::<pm_no_keywords_parameter_node>() - 8usize];
    ["Offset of field: pm_no_keywords_parameter_node::base"]
        [::std::mem::offset_of!(pm_no_keywords_parameter_node, base) - 0usize];
    ["Offset of field: pm_no_keywords_parameter_node::operator_loc"]
        [::std::mem::offset_of!(pm_no_keywords_parameter_node, operator_loc) - 24usize];
    ["Offset of field: pm_no_keywords_parameter_node::keyword_loc"]
        [::std::mem::offset_of!(pm_no_keywords_parameter_node, keyword_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_numbered_parameters_node"]
        [::std::mem::size_of::<pm_numbered_parameters_node>() - 32usize];
    ["Alignment of pm_numbered_parameters_node"]
        [::std::mem::align_of::<pm_numbered_parameters_node>() - 8usize];
    ["Offset of field: pm_numbered_parameters_node::base"]
        [::std::mem::offset_of!(pm_numbered_parameters_node, base) - 0usize];
    ["Offset of field: pm_numbered_parameters_node::maximum"]
        [::std::mem::offset_of!(pm_numbered_parameters_node, maximum) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_numbered_reference_read_node"]
        [::std::mem::size_of::<pm_numbered_reference_read_node>() - 32usize];
    ["Alignment of pm_numbered_reference_read_node"]
        [::std::mem::align_of::<pm_numbered_reference_read_node>() - 8usize];
    ["Offset of field: pm_numbered_reference_read_node::base"]
        [::std::mem::offset_of!(pm_numbered_reference_read_node, base) - 0usize];
    ["Offset of field: pm_numbered_reference_read_node::number"]
        [::std::mem::offset_of!(pm_numbered_reference_read_node, number) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_optional_keyword_parameter_node"]
        [::std::mem::size_of::<pm_optional_keyword_parameter_node>() - 56usize];
    ["Alignment of pm_optional_keyword_parameter_node"]
        [::std::mem::align_of::<pm_optional_keyword_parameter_node>() - 8usize];
    ["Offset of field: pm_optional_keyword_parameter_node::base"]
        [::std::mem::offset_of!(pm_optional_keyword_parameter_node, base) - 0usize];
    ["Offset of field: pm_optional_keyword_parameter_node::name"]
        [::std::mem::offset_of!(pm_optional_keyword_parameter_node, name) - 24usize];
    ["Offset of field: pm_optional_keyword_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_optional_keyword_parameter_node, name_loc) - 32usize];
    ["Offset of field: pm_optional_keyword_parameter_node::value"]
        [::std::mem::offset_of!(pm_optional_keyword_parameter_node, value) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_optional_parameter_node"]
        [::std::mem::size_of::<pm_optional_parameter_node>() - 72usize];
    ["Alignment of pm_optional_parameter_node"]
        [::std::mem::align_of::<pm_optional_parameter_node>() - 8usize];
    ["Offset of field: pm_optional_parameter_node::base"]
        [::std::mem::offset_of!(pm_optional_parameter_node, base) - 0usize];
    ["Offset of field: pm_optional_parameter_node::name"]
        [::std::mem::offset_of!(pm_optional_parameter_node, name) - 24usize];
    ["Offset of field: pm_optional_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_optional_parameter_node, name_loc) - 32usize];
    ["Offset of field: pm_optional_parameter_node::operator_loc"]
        [::std::mem::offset_of!(pm_optional_parameter_node, operator_loc) - 48usize];
    ["Offset of field: pm_optional_parameter_node::value"]
        [::std::mem::offset_of!(pm_optional_parameter_node, value) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_or_node"][::std::mem::size_of::<pm_or_node>() - 56usize];
    ["Alignment of pm_or_node"][::std::mem::align_of::<pm_or_node>() - 8usize];
    ["Offset of field: pm_or_node::base"][::std::mem::offset_of!(pm_or_node, base) - 0usize];
    ["Offset of field: pm_or_node::left"][::std::mem::offset_of!(pm_or_node, left) - 24usize];
    ["Offset of field: pm_or_node::right"][::std::mem::offset_of!(pm_or_node, right) - 32usize];
    ["Offset of field: pm_or_node::operator_loc"]
        [::std::mem::offset_of!(pm_or_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_parameters_node"][::std::mem::size_of::<pm_parameters_node>() - 144usize];
    ["Alignment of pm_parameters_node"][::std::mem::align_of::<pm_parameters_node>() - 8usize];
    ["Offset of field: pm_parameters_node::base"]
        [::std::mem::offset_of!(pm_parameters_node, base) - 0usize];
    ["Offset of field: pm_parameters_node::requireds"]
        [::std::mem::offset_of!(pm_parameters_node, requireds) - 24usize];
    ["Offset of field: pm_parameters_node::optionals"]
        [::std::mem::offset_of!(pm_parameters_node, optionals) - 48usize];
    ["Offset of field: pm_parameters_node::rest"]
        [::std::mem::offset_of!(pm_parameters_node, rest) - 72usize];
    ["Offset of field: pm_parameters_node::posts"]
        [::std::mem::offset_of!(pm_parameters_node, posts) - 80usize];
    ["Offset of field: pm_parameters_node::keywords"]
        [::std::mem::offset_of!(pm_parameters_node, keywords) - 104usize];
    ["Offset of field: pm_parameters_node::keyword_rest"]
        [::std::mem::offset_of!(pm_parameters_node, keyword_rest) - 128usize];
    ["Offset of field: pm_parameters_node::block"]
        [::std::mem::offset_of!(pm_parameters_node, block) - 136usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_parentheses_node"][::std::mem::size_of::<pm_parentheses_node>() - 64usize];
    ["Alignment of pm_parentheses_node"][::std::mem::align_of::<pm_parentheses_node>() - 8usize];
    ["Offset of field: pm_parentheses_node::base"]
        [::std::mem::offset_of!(pm_parentheses_node, base) - 0usize];
    ["Offset of field: pm_parentheses_node::body"]
        [::std::mem::offset_of!(pm_parentheses_node, body) - 24usize];
    ["Offset of field: pm_parentheses_node::opening_loc"]
        [::std::mem::offset_of!(pm_parentheses_node, opening_loc) - 32usize];
    ["Offset of field: pm_parentheses_node::closing_loc"]
        [::std::mem::offset_of!(pm_parentheses_node, closing_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_pinned_expression_node"]
        [::std::mem::size_of::<pm_pinned_expression_node>() - 80usize];
    ["Alignment of pm_pinned_expression_node"]
        [::std::mem::align_of::<pm_pinned_expression_node>() - 8usize];
    ["Offset of field: pm_pinned_expression_node::base"]
        [::std::mem::offset_of!(pm_pinned_expression_node, base) - 0usize];
    ["Offset of field: pm_pinned_expression_node::expression"]
        [::std::mem::offset_of!(pm_pinned_expression_node, expression) - 24usize];
    ["Offset of field: pm_pinned_expression_node::operator_loc"]
        [::std::mem::offset_of!(pm_pinned_expression_node, operator_loc) - 32usize];
    ["Offset of field: pm_pinned_expression_node::lparen_loc"]
        [::std::mem::offset_of!(pm_pinned_expression_node, lparen_loc) - 48usize];
    ["Offset of field: pm_pinned_expression_node::rparen_loc"]
        [::std::mem::offset_of!(pm_pinned_expression_node, rparen_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_pinned_variable_node"][::std::mem::size_of::<pm_pinned_variable_node>() - 48usize];
    ["Alignment of pm_pinned_variable_node"]
        [::std::mem::align_of::<pm_pinned_variable_node>() - 8usize];
    ["Offset of field: pm_pinned_variable_node::base"]
        [::std::mem::offset_of!(pm_pinned_variable_node, base) - 0usize];
    ["Offset of field: pm_pinned_variable_node::variable"]
        [::std::mem::offset_of!(pm_pinned_variable_node, variable) - 24usize];
    ["Offset of field: pm_pinned_variable_node::operator_loc"]
        [::std::mem::offset_of!(pm_pinned_variable_node, operator_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_post_execution_node"][::std::mem::size_of::<pm_post_execution_node>() - 80usize];
    ["Alignment of pm_post_execution_node"]
        [::std::mem::align_of::<pm_post_execution_node>() - 8usize];
    ["Offset of field: pm_post_execution_node::base"]
        [::std::mem::offset_of!(pm_post_execution_node, base) - 0usize];
    ["Offset of field: pm_post_execution_node::statements"]
        [::std::mem::offset_of!(pm_post_execution_node, statements) - 24usize];
    ["Offset of field: pm_post_execution_node::keyword_loc"]
        [::std::mem::offset_of!(pm_post_execution_node, keyword_loc) - 32usize];
    ["Offset of field: pm_post_execution_node::opening_loc"]
        [::std::mem::offset_of!(pm_post_execution_node, opening_loc) - 48usize];
    ["Offset of field: pm_post_execution_node::closing_loc"]
        [::std::mem::offset_of!(pm_post_execution_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_pre_execution_node"][::std::mem::size_of::<pm_pre_execution_node>() - 80usize];
    ["Alignment of pm_pre_execution_node"]
        [::std::mem::align_of::<pm_pre_execution_node>() - 8usize];
    ["Offset of field: pm_pre_execution_node::base"]
        [::std::mem::offset_of!(pm_pre_execution_node, base) - 0usize];
    ["Offset of field: pm_pre_execution_node::statements"]
        [::std::mem::offset_of!(pm_pre_execution_node, statements) - 24usize];
    ["Offset of field: pm_pre_execution_node::keyword_loc"]
        [::std::mem::offset_of!(pm_pre_execution_node, keyword_loc) - 32usize];
    ["Offset of field: pm_pre_execution_node::opening_loc"]
        [::std::mem::offset_of!(pm_pre_execution_node, opening_loc) - 48usize];
    ["Offset of field: pm_pre_execution_node::closing_loc"]
        [::std::mem::offset_of!(pm_pre_execution_node, closing_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_program_node"][::std::mem::size_of::<pm_program_node>() - 56usize];
    ["Alignment of pm_program_node"][::std::mem::align_of::<pm_program_node>() - 8usize];
    ["Offset of field: pm_program_node::base"]
        [::std::mem::offset_of!(pm_program_node, base) - 0usize];
    ["Offset of field: pm_program_node::locals"]
        [::std::mem::offset_of!(pm_program_node, locals) - 24usize];
    ["Offset of field: pm_program_node::statements"]
        [::std::mem::offset_of!(pm_program_node, statements) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_range_node"][::std::mem::size_of::<pm_range_node>() - 56usize];
    ["Alignment of pm_range_node"][::std::mem::align_of::<pm_range_node>() - 8usize];
    ["Offset of field: pm_range_node::base"][::std::mem::offset_of!(pm_range_node, base) - 0usize];
    ["Offset of field: pm_range_node::left"][::std::mem::offset_of!(pm_range_node, left) - 24usize];
    ["Offset of field: pm_range_node::right"]
        [::std::mem::offset_of!(pm_range_node, right) - 32usize];
    ["Offset of field: pm_range_node::operator_loc"]
        [::std::mem::offset_of!(pm_range_node, operator_loc) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_rational_node"][::std::mem::size_of::<pm_rational_node>() - 72usize];
    ["Alignment of pm_rational_node"][::std::mem::align_of::<pm_rational_node>() - 8usize];
    ["Offset of field: pm_rational_node::base"]
        [::std::mem::offset_of!(pm_rational_node, base) - 0usize];
    ["Offset of field: pm_rational_node::numerator"]
        [::std::mem::offset_of!(pm_rational_node, numerator) - 24usize];
    ["Offset of field: pm_rational_node::denominator"]
        [::std::mem::offset_of!(pm_rational_node, denominator) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_redo_node"][::std::mem::size_of::<pm_redo_node>() - 24usize];
    ["Alignment of pm_redo_node"][::std::mem::align_of::<pm_redo_node>() - 8usize];
    ["Offset of field: pm_redo_node::base"][::std::mem::offset_of!(pm_redo_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_regular_expression_node"]
        [::std::mem::size_of::<pm_regular_expression_node>() - 96usize];
    ["Alignment of pm_regular_expression_node"]
        [::std::mem::align_of::<pm_regular_expression_node>() - 8usize];
    ["Offset of field: pm_regular_expression_node::base"]
        [::std::mem::offset_of!(pm_regular_expression_node, base) - 0usize];
    ["Offset of field: pm_regular_expression_node::opening_loc"]
        [::std::mem::offset_of!(pm_regular_expression_node, opening_loc) - 24usize];
    ["Offset of field: pm_regular_expression_node::content_loc"]
        [::std::mem::offset_of!(pm_regular_expression_node, content_loc) - 40usize];
    ["Offset of field: pm_regular_expression_node::closing_loc"]
        [::std::mem::offset_of!(pm_regular_expression_node, closing_loc) - 56usize];
    ["Offset of field: pm_regular_expression_node::unescaped"]
        [::std::mem::offset_of!(pm_regular_expression_node, unescaped) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_required_keyword_parameter_node"]
        [::std::mem::size_of::<pm_required_keyword_parameter_node>() - 48usize];
    ["Alignment of pm_required_keyword_parameter_node"]
        [::std::mem::align_of::<pm_required_keyword_parameter_node>() - 8usize];
    ["Offset of field: pm_required_keyword_parameter_node::base"]
        [::std::mem::offset_of!(pm_required_keyword_parameter_node, base) - 0usize];
    ["Offset of field: pm_required_keyword_parameter_node::name"]
        [::std::mem::offset_of!(pm_required_keyword_parameter_node, name) - 24usize];
    ["Offset of field: pm_required_keyword_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_required_keyword_parameter_node, name_loc) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_required_parameter_node"]
        [::std::mem::size_of::<pm_required_parameter_node>() - 32usize];
    ["Alignment of pm_required_parameter_node"]
        [::std::mem::align_of::<pm_required_parameter_node>() - 8usize];
    ["Offset of field: pm_required_parameter_node::base"]
        [::std::mem::offset_of!(pm_required_parameter_node, base) - 0usize];
    ["Offset of field: pm_required_parameter_node::name"]
        [::std::mem::offset_of!(pm_required_parameter_node, name) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_rescue_modifier_node"][::std::mem::size_of::<pm_rescue_modifier_node>() - 56usize];
    ["Alignment of pm_rescue_modifier_node"]
        [::std::mem::align_of::<pm_rescue_modifier_node>() - 8usize];
    ["Offset of field: pm_rescue_modifier_node::base"]
        [::std::mem::offset_of!(pm_rescue_modifier_node, base) - 0usize];
    ["Offset of field: pm_rescue_modifier_node::expression"]
        [::std::mem::offset_of!(pm_rescue_modifier_node, expression) - 24usize];
    ["Offset of field: pm_rescue_modifier_node::keyword_loc"]
        [::std::mem::offset_of!(pm_rescue_modifier_node, keyword_loc) - 32usize];
    ["Offset of field: pm_rescue_modifier_node::rescue_expression"]
        [::std::mem::offset_of!(pm_rescue_modifier_node, rescue_expression) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_rescue_node"][::std::mem::size_of::<pm_rescue_node>() - 120usize];
    ["Alignment of pm_rescue_node"][::std::mem::align_of::<pm_rescue_node>() - 8usize];
    ["Offset of field: pm_rescue_node::base"]
        [::std::mem::offset_of!(pm_rescue_node, base) - 0usize];
    ["Offset of field: pm_rescue_node::keyword_loc"]
        [::std::mem::offset_of!(pm_rescue_node, keyword_loc) - 24usize];
    ["Offset of field: pm_rescue_node::exceptions"]
        [::std::mem::offset_of!(pm_rescue_node, exceptions) - 40usize];
    ["Offset of field: pm_rescue_node::operator_loc"]
        [::std::mem::offset_of!(pm_rescue_node, operator_loc) - 64usize];
    ["Offset of field: pm_rescue_node::reference"]
        [::std::mem::offset_of!(pm_rescue_node, reference) - 80usize];
    ["Offset of field: pm_rescue_node::then_keyword_loc"]
        [::std::mem::offset_of!(pm_rescue_node, then_keyword_loc) - 88usize];
    ["Offset of field: pm_rescue_node::statements"]
        [::std::mem::offset_of!(pm_rescue_node, statements) - 104usize];
    ["Offset of field: pm_rescue_node::subsequent"]
        [::std::mem::offset_of!(pm_rescue_node, subsequent) - 112usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_rest_parameter_node"][::std::mem::size_of::<pm_rest_parameter_node>() - 64usize];
    ["Alignment of pm_rest_parameter_node"]
        [::std::mem::align_of::<pm_rest_parameter_node>() - 8usize];
    ["Offset of field: pm_rest_parameter_node::base"]
        [::std::mem::offset_of!(pm_rest_parameter_node, base) - 0usize];
    ["Offset of field: pm_rest_parameter_node::name"]
        [::std::mem::offset_of!(pm_rest_parameter_node, name) - 24usize];
    ["Offset of field: pm_rest_parameter_node::name_loc"]
        [::std::mem::offset_of!(pm_rest_parameter_node, name_loc) - 32usize];
    ["Offset of field: pm_rest_parameter_node::operator_loc"]
        [::std::mem::offset_of!(pm_rest_parameter_node, operator_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_retry_node"][::std::mem::size_of::<pm_retry_node>() - 24usize];
    ["Alignment of pm_retry_node"][::std::mem::align_of::<pm_retry_node>() - 8usize];
    ["Offset of field: pm_retry_node::base"][::std::mem::offset_of!(pm_retry_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_return_node"][::std::mem::size_of::<pm_return_node>() - 48usize];
    ["Alignment of pm_return_node"][::std::mem::align_of::<pm_return_node>() - 8usize];
    ["Offset of field: pm_return_node::base"]
        [::std::mem::offset_of!(pm_return_node, base) - 0usize];
    ["Offset of field: pm_return_node::keyword_loc"]
        [::std::mem::offset_of!(pm_return_node, keyword_loc) - 24usize];
    ["Offset of field: pm_return_node::arguments"]
        [::std::mem::offset_of!(pm_return_node, arguments) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_self_node"][::std::mem::size_of::<pm_self_node>() - 24usize];
    ["Alignment of pm_self_node"][::std::mem::align_of::<pm_self_node>() - 8usize];
    ["Offset of field: pm_self_node::base"][::std::mem::offset_of!(pm_self_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_shareable_constant_node"]
        [::std::mem::size_of::<pm_shareable_constant_node>() - 32usize];
    ["Alignment of pm_shareable_constant_node"]
        [::std::mem::align_of::<pm_shareable_constant_node>() - 8usize];
    ["Offset of field: pm_shareable_constant_node::base"]
        [::std::mem::offset_of!(pm_shareable_constant_node, base) - 0usize];
    ["Offset of field: pm_shareable_constant_node::write"]
        [::std::mem::offset_of!(pm_shareable_constant_node, write) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_singleton_class_node"]
        [::std::mem::size_of::<pm_singleton_class_node>() - 112usize];
    ["Alignment of pm_singleton_class_node"]
        [::std::mem::align_of::<pm_singleton_class_node>() - 8usize];
    ["Offset of field: pm_singleton_class_node::base"]
        [::std::mem::offset_of!(pm_singleton_class_node, base) - 0usize];
    ["Offset of field: pm_singleton_class_node::locals"]
        [::std::mem::offset_of!(pm_singleton_class_node, locals) - 24usize];
    ["Offset of field: pm_singleton_class_node::class_keyword_loc"]
        [::std::mem::offset_of!(pm_singleton_class_node, class_keyword_loc) - 48usize];
    ["Offset of field: pm_singleton_class_node::operator_loc"]
        [::std::mem::offset_of!(pm_singleton_class_node, operator_loc) - 64usize];
    ["Offset of field: pm_singleton_class_node::expression"]
        [::std::mem::offset_of!(pm_singleton_class_node, expression) - 80usize];
    ["Offset of field: pm_singleton_class_node::body"]
        [::std::mem::offset_of!(pm_singleton_class_node, body) - 88usize];
    ["Offset of field: pm_singleton_class_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_singleton_class_node, end_keyword_loc) - 96usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_source_encoding_node"][::std::mem::size_of::<pm_source_encoding_node>() - 24usize];
    ["Alignment of pm_source_encoding_node"]
        [::std::mem::align_of::<pm_source_encoding_node>() - 8usize];
    ["Offset of field: pm_source_encoding_node::base"]
        [::std::mem::offset_of!(pm_source_encoding_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_source_file_node"][::std::mem::size_of::<pm_source_file_node>() - 48usize];
    ["Alignment of pm_source_file_node"][::std::mem::align_of::<pm_source_file_node>() - 8usize];
    ["Offset of field: pm_source_file_node::base"]
        [::std::mem::offset_of!(pm_source_file_node, base) - 0usize];
    ["Offset of field: pm_source_file_node::filepath"]
        [::std::mem::offset_of!(pm_source_file_node, filepath) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_source_line_node"][::std::mem::size_of::<pm_source_line_node>() - 24usize];
    ["Alignment of pm_source_line_node"][::std::mem::align_of::<pm_source_line_node>() - 8usize];
    ["Offset of field: pm_source_line_node::base"]
        [::std::mem::offset_of!(pm_source_line_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_splat_node"][::std::mem::size_of::<pm_splat_node>() - 48usize];
    ["Alignment of pm_splat_node"][::std::mem::align_of::<pm_splat_node>() - 8usize];
    ["Offset of field: pm_splat_node::base"][::std::mem::offset_of!(pm_splat_node, base) - 0usize];
    ["Offset of field: pm_splat_node::operator_loc"]
        [::std::mem::offset_of!(pm_splat_node, operator_loc) - 24usize];
    ["Offset of field: pm_splat_node::expression"]
        [::std::mem::offset_of!(pm_splat_node, expression) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_statements_node"][::std::mem::size_of::<pm_statements_node>() - 48usize];
    ["Alignment of pm_statements_node"][::std::mem::align_of::<pm_statements_node>() - 8usize];
    ["Offset of field: pm_statements_node::base"]
        [::std::mem::offset_of!(pm_statements_node, base) - 0usize];
    ["Offset of field: pm_statements_node::body"]
        [::std::mem::offset_of!(pm_statements_node, body) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_string_node"][::std::mem::size_of::<pm_string_node>() - 96usize];
    ["Alignment of pm_string_node"][::std::mem::align_of::<pm_string_node>() - 8usize];
    ["Offset of field: pm_string_node::base"]
        [::std::mem::offset_of!(pm_string_node, base) - 0usize];
    ["Offset of field: pm_string_node::opening_loc"]
        [::std::mem::offset_of!(pm_string_node, opening_loc) - 24usize];
    ["Offset of field: pm_string_node::content_loc"]
        [::std::mem::offset_of!(pm_string_node, content_loc) - 40usize];
    ["Offset of field: pm_string_node::closing_loc"]
        [::std::mem::offset_of!(pm_string_node, closing_loc) - 56usize];
    ["Offset of field: pm_string_node::unescaped"]
        [::std::mem::offset_of!(pm_string_node, unescaped) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_super_node"][::std::mem::size_of::<pm_super_node>() - 88usize];
    ["Alignment of pm_super_node"][::std::mem::align_of::<pm_super_node>() - 8usize];
    ["Offset of field: pm_super_node::base"][::std::mem::offset_of!(pm_super_node, base) - 0usize];
    ["Offset of field: pm_super_node::keyword_loc"]
        [::std::mem::offset_of!(pm_super_node, keyword_loc) - 24usize];
    ["Offset of field: pm_super_node::lparen_loc"]
        [::std::mem::offset_of!(pm_super_node, lparen_loc) - 40usize];
    ["Offset of field: pm_super_node::arguments"]
        [::std::mem::offset_of!(pm_super_node, arguments) - 56usize];
    ["Offset of field: pm_super_node::rparen_loc"]
        [::std::mem::offset_of!(pm_super_node, rparen_loc) - 64usize];
    ["Offset of field: pm_super_node::block"]
        [::std::mem::offset_of!(pm_super_node, block) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_symbol_node"][::std::mem::size_of::<pm_symbol_node>() - 96usize];
    ["Alignment of pm_symbol_node"][::std::mem::align_of::<pm_symbol_node>() - 8usize];
    ["Offset of field: pm_symbol_node::base"]
        [::std::mem::offset_of!(pm_symbol_node, base) - 0usize];
    ["Offset of field: pm_symbol_node::opening_loc"]
        [::std::mem::offset_of!(pm_symbol_node, opening_loc) - 24usize];
    ["Offset of field: pm_symbol_node::value_loc"]
        [::std::mem::offset_of!(pm_symbol_node, value_loc) - 40usize];
    ["Offset of field: pm_symbol_node::closing_loc"]
        [::std::mem::offset_of!(pm_symbol_node, closing_loc) - 56usize];
    ["Offset of field: pm_symbol_node::unescaped"]
        [::std::mem::offset_of!(pm_symbol_node, unescaped) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_true_node"][::std::mem::size_of::<pm_true_node>() - 24usize];
    ["Alignment of pm_true_node"][::std::mem::align_of::<pm_true_node>() - 8usize];
    ["Offset of field: pm_true_node::base"][::std::mem::offset_of!(pm_true_node, base) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_undef_node"][::std::mem::size_of::<pm_undef_node>() - 64usize];
    ["Alignment of pm_undef_node"][::std::mem::align_of::<pm_undef_node>() - 8usize];
    ["Offset of field: pm_undef_node::base"][::std::mem::offset_of!(pm_undef_node, base) - 0usize];
    ["Offset of field: pm_undef_node::names"]
        [::std::mem::offset_of!(pm_undef_node, names) - 24usize];
    ["Offset of field: pm_undef_node::keyword_loc"]
        [::std::mem::offset_of!(pm_undef_node, keyword_loc) - 48usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_unless_node"][::std::mem::size_of::<pm_unless_node>() - 96usize];
    ["Alignment of pm_unless_node"][::std::mem::align_of::<pm_unless_node>() - 8usize];
    ["Offset of field: pm_unless_node::base"]
        [::std::mem::offset_of!(pm_unless_node, base) - 0usize];
    ["Offset of field: pm_unless_node::keyword_loc"]
        [::std::mem::offset_of!(pm_unless_node, keyword_loc) - 24usize];
    ["Offset of field: pm_unless_node::predicate"]
        [::std::mem::offset_of!(pm_unless_node, predicate) - 40usize];
    ["Offset of field: pm_unless_node::then_keyword_loc"]
        [::std::mem::offset_of!(pm_unless_node, then_keyword_loc) - 48usize];
    ["Offset of field: pm_unless_node::statements"]
        [::std::mem::offset_of!(pm_unless_node, statements) - 64usize];
    ["Offset of field: pm_unless_node::else_clause"]
        [::std::mem::offset_of!(pm_unless_node, else_clause) - 72usize];
    ["Offset of field: pm_unless_node::end_keyword_loc"]
        [::std::mem::offset_of!(pm_unless_node, end_keyword_loc) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_until_node"][::std::mem::size_of::<pm_until_node>() - 88usize];
    ["Alignment of pm_until_node"][::std::mem::align_of::<pm_until_node>() - 8usize];
    ["Offset of field: pm_until_node::base"][::std::mem::offset_of!(pm_until_node, base) - 0usize];
    ["Offset of field: pm_until_node::keyword_loc"]
        [::std::mem::offset_of!(pm_until_node, keyword_loc) - 24usize];
    ["Offset of field: pm_until_node::do_keyword_loc"]
        [::std::mem::offset_of!(pm_until_node, do_keyword_loc) - 40usize];
    ["Offset of field: pm_until_node::closing_loc"]
        [::std::mem::offset_of!(pm_until_node, closing_loc) - 56usize];
    ["Offset of field: pm_until_node::predicate"]
        [::std::mem::offset_of!(pm_until_node, predicate) - 72usize];
    ["Offset of field: pm_until_node::statements"]
        [::std::mem::offset_of!(pm_until_node, statements) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_when_node"][::std::mem::size_of::<pm_when_node>() - 88usize];
    ["Alignment of pm_when_node"][::std::mem::align_of::<pm_when_node>() - 8usize];
    ["Offset of field: pm_when_node::base"][::std::mem::offset_of!(pm_when_node, base) - 0usize];
    ["Offset of field: pm_when_node::keyword_loc"]
        [::std::mem::offset_of!(pm_when_node, keyword_loc) - 24usize];
    ["Offset of field: pm_when_node::conditions"]
        [::std::mem::offset_of!(pm_when_node, conditions) - 40usize];
    ["Offset of field: pm_when_node::then_keyword_loc"]
        [::std::mem::offset_of!(pm_when_node, then_keyword_loc) - 64usize];
    ["Offset of field: pm_when_node::statements"]
        [::std::mem::offset_of!(pm_when_node, statements) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_while_node"][::std::mem::size_of::<pm_while_node>() - 88usize];
    ["Alignment of pm_while_node"][::std::mem::align_of::<pm_while_node>() - 8usize];
    ["Offset of field: pm_while_node::base"][::std::mem::offset_of!(pm_while_node, base) - 0usize];
    ["Offset of field: pm_while_node::keyword_loc"]
        [::std::mem::offset_of!(pm_while_node, keyword_loc) - 24usize];
    ["Offset of field: pm_while_node::do_keyword_loc"]
        [::std::mem::offset_of!(pm_while_node, do_keyword_loc) - 40usize];
    ["Offset of field: pm_while_node::closing_loc"]
        [::std::mem::offset_of!(pm_while_node, closing_loc) - 56usize];
    ["Offset of field: pm_while_node::predicate"]
        [::std::mem::offset_of!(pm_while_node, predicate) - 72usize];
    ["Offset of field: pm_while_node::statements"]
        [::std::mem::offset_of!(pm_while_node, statements) - 80usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_x_string_node"][::std::mem::size_of::<pm_x_string_node>() - 96usize];
    ["Alignment of pm_x_string_node"][::std::mem::align_of::<pm_x_string_node>() - 8usize];
    ["Offset of field: pm_x_string_node::base"]
        [::std::mem::offset_of!(pm_x_string_node, base) - 0usize];
    ["Offset of field: pm_x_string_node::opening_loc"]
        [::std::mem::offset_of!(pm_x_string_node, opening_loc) - 24usize];
    ["Offset of field: pm_x_string_node::content_loc"]
        [::std::mem::offset_of!(pm_x_string_node, content_loc) - 40usize];
    ["Offset of field: pm_x_string_node::closing_loc"]
        [::std::mem::offset_of!(pm_x_string_node, closing_loc) - 56usize];
    ["Offset of field: pm_x_string_node::unescaped"]
        [::std::mem::offset_of!(pm_x_string_node, unescaped) - 72usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_yield_node"][::std::mem::size_of::<pm_yield_node>() - 80usize];
    ["Alignment of pm_yield_node"][::std::mem::align_of::<pm_yield_node>() - 8usize];
    ["Offset of field: pm_yield_node::base"][::std::mem::offset_of!(pm_yield_node, base) - 0usize];
    ["Offset of field: pm_yield_node::keyword_loc"]
        [::std::mem::offset_of!(pm_yield_node, keyword_loc) - 24usize];
    ["Offset of field: pm_yield_node::lparen_loc"]
        [::std::mem::offset_of!(pm_yield_node, lparen_loc) - 40usize];
    ["Offset of field: pm_yield_node::arguments"]
        [::std::mem::offset_of!(pm_yield_node, arguments) - 56usize];
    ["Offset of field: pm_yield_node::rparen_loc"]
        [::std::mem::offset_of!(pm_yield_node, rparen_loc) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_list_node"][::std::mem::size_of::<pm_list_node>() - 8usize];
    ["Alignment of pm_list_node"][::std::mem::align_of::<pm_list_node>() - 8usize];
    ["Offset of field: pm_list_node::next"][::std::mem::offset_of!(pm_list_node, next) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_list_t"][::std::mem::size_of::<pm_list_t>() - 24usize];
    ["Alignment of pm_list_t"][::std::mem::align_of::<pm_list_t>() - 8usize];
    ["Offset of field: pm_list_t::size"][::std::mem::offset_of!(pm_list_t, size) - 0usize];
    ["Offset of field: pm_list_t::head"][::std::mem::offset_of!(pm_list_t, head) - 8usize];
    ["Offset of field: pm_list_t::tail"][::std::mem::offset_of!(pm_list_t, tail) - 16usize];
};
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ALIAS_ARGUMENT: pm_diagnostic_id_t = 0;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ALIAS_ARGUMENT_NUMBERED_REFERENCE: pm_diagnostic_id_t = 1;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_AMPAMPEQ_MULTI_ASSIGN: pm_diagnostic_id_t = 2;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_AFTER_BLOCK: pm_diagnostic_id_t = 3;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_AFTER_FORWARDING_ELLIPSES: pm_diagnostic_id_t = 4;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_BARE_HASH: pm_diagnostic_id_t = 5;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_BLOCK_FORWARDING: pm_diagnostic_id_t = 6;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_BLOCK_MULTI: pm_diagnostic_id_t = 7;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_CONFLICT_AMPERSAND: pm_diagnostic_id_t = 8;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_CONFLICT_STAR: pm_diagnostic_id_t = 9;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_CONFLICT_STAR_STAR: pm_diagnostic_id_t = 10;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_FORMAL_CLASS: pm_diagnostic_id_t = 11;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_FORMAL_CONSTANT: pm_diagnostic_id_t = 12;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_FORMAL_GLOBAL: pm_diagnostic_id_t = 13;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_FORMAL_IVAR: pm_diagnostic_id_t = 14;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_FORWARDING_UNBOUND: pm_diagnostic_id_t = 15;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_NO_FORWARDING_AMPERSAND: pm_diagnostic_id_t = 16;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_NO_FORWARDING_ELLIPSES: pm_diagnostic_id_t = 17;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_NO_FORWARDING_STAR: pm_diagnostic_id_t = 18;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_NO_FORWARDING_STAR_STAR: pm_diagnostic_id_t = 19;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_SPLAT_AFTER_ASSOC_SPLAT: pm_diagnostic_id_t = 20;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_SPLAT_AFTER_SPLAT: pm_diagnostic_id_t = 21;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_TERM_PAREN: pm_diagnostic_id_t = 22;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARGUMENT_UNEXPECTED_BLOCK: pm_diagnostic_id_t = 23;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARRAY_ELEMENT: pm_diagnostic_id_t = 24;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARRAY_EXPRESSION: pm_diagnostic_id_t = 25;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARRAY_EXPRESSION_AFTER_STAR: pm_diagnostic_id_t = 26;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARRAY_SEPARATOR: pm_diagnostic_id_t = 27;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ARRAY_TERM: pm_diagnostic_id_t = 28;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BEGIN_LONELY_ELSE: pm_diagnostic_id_t = 29;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BEGIN_TERM: pm_diagnostic_id_t = 30;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BEGIN_UPCASE_BRACE: pm_diagnostic_id_t = 31;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BEGIN_UPCASE_TERM: pm_diagnostic_id_t = 32;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BEGIN_UPCASE_TOPLEVEL: pm_diagnostic_id_t = 33;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BLOCK_PARAM_LOCAL_VARIABLE: pm_diagnostic_id_t = 34;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BLOCK_PARAM_PIPE_TERM: pm_diagnostic_id_t = 35;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BLOCK_TERM_BRACE: pm_diagnostic_id_t = 36;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_BLOCK_TERM_END: pm_diagnostic_id_t = 37;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CANNOT_PARSE_EXPRESSION: pm_diagnostic_id_t = 38;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CANNOT_PARSE_STRING_PART: pm_diagnostic_id_t = 39;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CASE_EXPRESSION_AFTER_CASE: pm_diagnostic_id_t = 40;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CASE_EXPRESSION_AFTER_WHEN: pm_diagnostic_id_t = 41;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CASE_MATCH_MISSING_PREDICATE: pm_diagnostic_id_t = 42;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CASE_MISSING_CONDITIONS: pm_diagnostic_id_t = 43;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CASE_TERM: pm_diagnostic_id_t = 44;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_IN_METHOD: pm_diagnostic_id_t = 45;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_NAME: pm_diagnostic_id_t = 46;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_SUPERCLASS: pm_diagnostic_id_t = 47;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_TERM: pm_diagnostic_id_t = 48;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_UNEXPECTED_END: pm_diagnostic_id_t = 49;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CLASS_VARIABLE_BARE: pm_diagnostic_id_t = 50;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_ELSIF_PREDICATE: pm_diagnostic_id_t = 51;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_IF_PREDICATE: pm_diagnostic_id_t = 52;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_PREDICATE_TERM: pm_diagnostic_id_t = 53;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_TERM: pm_diagnostic_id_t = 54;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_TERM_ELSE: pm_diagnostic_id_t = 55;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_UNLESS_PREDICATE: pm_diagnostic_id_t = 56;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_UNTIL_PREDICATE: pm_diagnostic_id_t = 57;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONDITIONAL_WHILE_PREDICATE: pm_diagnostic_id_t = 58;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_CONSTANT_PATH_COLON_COLON_CONSTANT: pm_diagnostic_id_t = 59;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_ENDLESS: pm_diagnostic_id_t = 60;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_ENDLESS_PARAMETERS: pm_diagnostic_id_t = 61;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_ENDLESS_SETTER: pm_diagnostic_id_t = 62;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_NAME: pm_diagnostic_id_t = 63;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_PARAMS_TERM: pm_diagnostic_id_t = 64;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_PARAMS_TERM_PAREN: pm_diagnostic_id_t = 65;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_RECEIVER: pm_diagnostic_id_t = 66;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_RECEIVER_TERM: pm_diagnostic_id_t = 67;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEF_TERM: pm_diagnostic_id_t = 68;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_DEFINED_EXPRESSION: pm_diagnostic_id_t = 69;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EMBDOC_TERM: pm_diagnostic_id_t = 70;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EMBEXPR_END: pm_diagnostic_id_t = 71;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EMBVAR_INVALID: pm_diagnostic_id_t = 72;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_END_UPCASE_BRACE: pm_diagnostic_id_t = 73;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_END_UPCASE_TERM: pm_diagnostic_id_t = 74;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_CONTROL: pm_diagnostic_id_t = 75;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_CONTROL_REPEAT: pm_diagnostic_id_t = 76;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_HEXADECIMAL: pm_diagnostic_id_t = 77;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_META: pm_diagnostic_id_t = 78;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_META_REPEAT: pm_diagnostic_id_t = 79;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE: pm_diagnostic_id_t = 80;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_CM_FLAGS: pm_diagnostic_id_t = 81;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_LIST: pm_diagnostic_id_t = 82;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_LITERAL: pm_diagnostic_id_t = 83;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_LONG: pm_diagnostic_id_t = 84;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_SHORT: pm_diagnostic_id_t = 85;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_ESCAPE_INVALID_UNICODE_TERM: pm_diagnostic_id_t = 86;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_ARGUMENT: pm_diagnostic_id_t = 87;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EOL_AFTER_STATEMENT: pm_diagnostic_id_t = 88;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_AMPAMPEQ: pm_diagnostic_id_t = 89;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_COMMA: pm_diagnostic_id_t = 90;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_EQUAL: pm_diagnostic_id_t = 91;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_LESS_LESS: pm_diagnostic_id_t = 92;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_LPAREN: pm_diagnostic_id_t = 93;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_OPERATOR: pm_diagnostic_id_t = 94;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_PIPEPIPEEQ: pm_diagnostic_id_t = 95;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_QUESTION: pm_diagnostic_id_t = 96;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_SPLAT: pm_diagnostic_id_t = 97;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_SPLAT_HASH: pm_diagnostic_id_t = 98;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_EXPRESSION_AFTER_STAR: pm_diagnostic_id_t = 99;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_FOR_DELIMITER: pm_diagnostic_id_t = 100;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_IDENT_REQ_PARAMETER: pm_diagnostic_id_t = 101;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_IN_DELIMITER: pm_diagnostic_id_t = 102;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_LPAREN_AFTER_NOT_LPAREN: pm_diagnostic_id_t = 103;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_LPAREN_AFTER_NOT_OTHER: pm_diagnostic_id_t = 104;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_LPAREN_REQ_PARAMETER: pm_diagnostic_id_t = 105;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_MESSAGE: pm_diagnostic_id_t = 106;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_RBRACKET: pm_diagnostic_id_t = 107;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_RPAREN: pm_diagnostic_id_t = 108;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_RPAREN_AFTER_MULTI: pm_diagnostic_id_t = 109;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_RPAREN_REQ_PARAMETER: pm_diagnostic_id_t = 110;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_SINGLETON_CLASS_DELIMITER: pm_diagnostic_id_t = 111;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_STRING_CONTENT: pm_diagnostic_id_t = 112;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPECT_WHEN_DELIMITER: pm_diagnostic_id_t = 113;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_BARE_HASH: pm_diagnostic_id_t = 114;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE: pm_diagnostic_id_t = 115;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_ENCODING: pm_diagnostic_id_t = 116;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_FALSE: pm_diagnostic_id_t = 117;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_FILE: pm_diagnostic_id_t = 118;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_LINE: pm_diagnostic_id_t = 119;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_NIL: pm_diagnostic_id_t = 120;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_NUMBERED: pm_diagnostic_id_t = 121;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_SELF: pm_diagnostic_id_t = 122;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_EXPRESSION_NOT_WRITABLE_TRUE: pm_diagnostic_id_t = 123;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_FLOAT_PARSE: pm_diagnostic_id_t = 124;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_FOR_COLLECTION: pm_diagnostic_id_t = 125;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_FOR_IN: pm_diagnostic_id_t = 126;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_FOR_INDEX: pm_diagnostic_id_t = 127;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_FOR_TERM: pm_diagnostic_id_t = 128;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_GLOBAL_VARIABLE_BARE: pm_diagnostic_id_t = 129;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HASH_EXPRESSION_AFTER_LABEL: pm_diagnostic_id_t = 130;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HASH_KEY: pm_diagnostic_id_t = 131;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HASH_ROCKET: pm_diagnostic_id_t = 132;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HASH_TERM: pm_diagnostic_id_t = 133;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HASH_VALUE: pm_diagnostic_id_t = 134;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HEREDOC_IDENTIFIER: pm_diagnostic_id_t = 135;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_HEREDOC_TERM: pm_diagnostic_id_t = 136;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INCOMPLETE_QUESTION_MARK: pm_diagnostic_id_t = 137;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INCOMPLETE_VARIABLE_CLASS: pm_diagnostic_id_t = 138;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INCOMPLETE_VARIABLE_CLASS_3_3: pm_diagnostic_id_t = 139;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INCOMPLETE_VARIABLE_INSTANCE: pm_diagnostic_id_t = 140;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INCOMPLETE_VARIABLE_INSTANCE_3_3: pm_diagnostic_id_t = 141;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INSTANCE_VARIABLE_BARE: pm_diagnostic_id_t = 142;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_BLOCK_EXIT: pm_diagnostic_id_t = 143;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_CHARACTER: pm_diagnostic_id_t = 144;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_COMMA: pm_diagnostic_id_t = 145;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_ENCODING_MAGIC_COMMENT: pm_diagnostic_id_t = 146;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_ESCAPE_CHARACTER: pm_diagnostic_id_t = 147;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_FLOAT_EXPONENT: pm_diagnostic_id_t = 148;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_LOCAL_VARIABLE_READ: pm_diagnostic_id_t = 149;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_LOCAL_VARIABLE_WRITE: pm_diagnostic_id_t = 150;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_MULTIBYTE_CHAR: pm_diagnostic_id_t = 151;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_MULTIBYTE_CHARACTER: pm_diagnostic_id_t = 152;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_MULTIBYTE_ESCAPE: pm_diagnostic_id_t = 153;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_BINARY: pm_diagnostic_id_t = 154;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_DECIMAL: pm_diagnostic_id_t = 155;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_FRACTION: pm_diagnostic_id_t = 156;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_HEXADECIMAL: pm_diagnostic_id_t = 157;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_OCTAL: pm_diagnostic_id_t = 158;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_UNDERSCORE_INNER: pm_diagnostic_id_t = 159;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_NUMBER_UNDERSCORE_TRAILING: pm_diagnostic_id_t = 160;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_PERCENT: pm_diagnostic_id_t = 161;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_PERCENT_EOF: pm_diagnostic_id_t = 162;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_PRINTABLE_CHARACTER: pm_diagnostic_id_t = 163;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_RETRY_AFTER_ELSE: pm_diagnostic_id_t = 164;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_RETRY_AFTER_ENSURE: pm_diagnostic_id_t = 165;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_RETRY_WITHOUT_RESCUE: pm_diagnostic_id_t = 166;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_SYMBOL: pm_diagnostic_id_t = 167;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_VARIABLE_GLOBAL: pm_diagnostic_id_t = 168;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_VARIABLE_GLOBAL_3_3: pm_diagnostic_id_t = 169;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_INVALID_YIELD: pm_diagnostic_id_t = 170;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_IT_NOT_ALLOWED_NUMBERED: pm_diagnostic_id_t = 171;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_IT_NOT_ALLOWED_ORDINARY: pm_diagnostic_id_t = 172;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LAMBDA_OPEN: pm_diagnostic_id_t = 173;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LAMBDA_TERM_BRACE: pm_diagnostic_id_t = 174;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LAMBDA_TERM_END: pm_diagnostic_id_t = 175;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_I_LOWER_ELEMENT: pm_diagnostic_id_t = 176;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_I_LOWER_TERM: pm_diagnostic_id_t = 177;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_I_UPPER_ELEMENT: pm_diagnostic_id_t = 178;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_I_UPPER_TERM: pm_diagnostic_id_t = 179;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_W_LOWER_ELEMENT: pm_diagnostic_id_t = 180;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_W_LOWER_TERM: pm_diagnostic_id_t = 181;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_W_UPPER_ELEMENT: pm_diagnostic_id_t = 182;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_LIST_W_UPPER_TERM: pm_diagnostic_id_t = 183;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MALLOC_FAILED: pm_diagnostic_id_t = 184;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MIXED_ENCODING: pm_diagnostic_id_t = 185;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MODULE_IN_METHOD: pm_diagnostic_id_t = 186;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MODULE_NAME: pm_diagnostic_id_t = 187;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MODULE_TERM: pm_diagnostic_id_t = 188;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MULTI_ASSIGN_MULTI_SPLATS: pm_diagnostic_id_t = 189;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_MULTI_ASSIGN_UNEXPECTED_REST: pm_diagnostic_id_t = 190;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NESTING_TOO_DEEP: pm_diagnostic_id_t = 191;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NO_LOCAL_VARIABLE: pm_diagnostic_id_t = 192;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NON_ASSOCIATIVE_OPERATOR: pm_diagnostic_id_t = 193;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NOT_EXPRESSION: pm_diagnostic_id_t = 194;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NUMBER_LITERAL_UNDERSCORE: pm_diagnostic_id_t = 195;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NUMBERED_PARAMETER_INNER_BLOCK: pm_diagnostic_id_t = 196;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NUMBERED_PARAMETER_IT: pm_diagnostic_id_t = 197;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NUMBERED_PARAMETER_ORDINARY: pm_diagnostic_id_t = 198;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_NUMBERED_PARAMETER_OUTER_BLOCK: pm_diagnostic_id_t = 199;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_OPERATOR_MULTI_ASSIGN: pm_diagnostic_id_t = 200;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_OPERATOR_WRITE_ARGUMENTS: pm_diagnostic_id_t = 201;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_OPERATOR_WRITE_BLOCK: pm_diagnostic_id_t = 202;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_ASSOC_SPLAT_MULTI: pm_diagnostic_id_t = 203;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_BLOCK_MULTI: pm_diagnostic_id_t = 204;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_CIRCULAR: pm_diagnostic_id_t = 205;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_FORWARDING_AFTER_REST: pm_diagnostic_id_t = 206;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_METHOD_NAME: pm_diagnostic_id_t = 207;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_NAME_DUPLICATED: pm_diagnostic_id_t = 208;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_NO_DEFAULT: pm_diagnostic_id_t = 209;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_NO_DEFAULT_KW: pm_diagnostic_id_t = 210;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_NUMBERED_RESERVED: pm_diagnostic_id_t = 211;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_ORDER: pm_diagnostic_id_t = 212;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_SPLAT_MULTI: pm_diagnostic_id_t = 213;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_STAR: pm_diagnostic_id_t = 214;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_UNEXPECTED_FWD: pm_diagnostic_id_t = 215;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_UNEXPECTED_NO_KW: pm_diagnostic_id_t = 216;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PARAMETER_WILD_LOOSE_COMMA: pm_diagnostic_id_t = 217;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_ARRAY_MULTIPLE_RESTS: pm_diagnostic_id_t = 218;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_CAPTURE_DUPLICATE: pm_diagnostic_id_t = 219;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_CAPTURE_IN_ALTERNATIVE: pm_diagnostic_id_t = 220;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_BRACKET: pm_diagnostic_id_t = 221;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_COMMA: pm_diagnostic_id_t = 222;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_HROCKET: pm_diagnostic_id_t = 223;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_IN: pm_diagnostic_id_t = 224;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_KEY: pm_diagnostic_id_t = 225;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_PAREN: pm_diagnostic_id_t = 226;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_PIN: pm_diagnostic_id_t = 227;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_PIPE: pm_diagnostic_id_t = 228;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_RANGE: pm_diagnostic_id_t = 229;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_EXPRESSION_AFTER_REST: pm_diagnostic_id_t = 230;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_FIND_MISSING_INNER: pm_diagnostic_id_t = 231;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_IMPLICIT: pm_diagnostic_id_t = 232;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_KEY: pm_diagnostic_id_t = 233;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_KEY_DUPLICATE: pm_diagnostic_id_t = 234;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_KEY_INTERPOLATED: pm_diagnostic_id_t = 235;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_KEY_LABEL: pm_diagnostic_id_t = 236;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_HASH_KEY_LOCALS: pm_diagnostic_id_t = 237;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_IDENT_AFTER_HROCKET: pm_diagnostic_id_t = 238;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_LABEL_AFTER_COMMA: pm_diagnostic_id_t = 239;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_REST: pm_diagnostic_id_t = 240;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_TERM_BRACE: pm_diagnostic_id_t = 241;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_TERM_BRACKET: pm_diagnostic_id_t = 242;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PATTERN_TERM_PAREN: pm_diagnostic_id_t = 243;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_PIPEPIPEEQ_MULTI_ASSIGN: pm_diagnostic_id_t = 244;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_ENCODING_OPTION_MISMATCH: pm_diagnostic_id_t = 245;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_INCOMPAT_CHAR_ENCODING: pm_diagnostic_id_t = 246;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_INVALID_UNICODE_RANGE: pm_diagnostic_id_t = 247;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_NON_ESCAPED_MBC: pm_diagnostic_id_t = 248;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_PARSE_ERROR: pm_diagnostic_id_t = 249;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_TERM: pm_diagnostic_id_t = 250;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_UNKNOWN_OPTIONS: pm_diagnostic_id_t = 251;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_REGEXP_UTF8_CHAR_NON_UTF8_REGEXP: pm_diagnostic_id_t = 252;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_RESCUE_EXPRESSION: pm_diagnostic_id_t = 253;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_RESCUE_MODIFIER_VALUE: pm_diagnostic_id_t = 254;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_RESCUE_TERM: pm_diagnostic_id_t = 255;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_RESCUE_VARIABLE: pm_diagnostic_id_t = 256;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_RETURN_INVALID: pm_diagnostic_id_t = 257;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_SCRIPT_NOT_FOUND: pm_diagnostic_id_t = 258;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_SINGLETON_FOR_LITERALS: pm_diagnostic_id_t = 259;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STATEMENT_ALIAS: pm_diagnostic_id_t = 260;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STATEMENT_POSTEXE_END: pm_diagnostic_id_t = 261;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STATEMENT_PREEXE_BEGIN: pm_diagnostic_id_t = 262;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STATEMENT_UNDEF: pm_diagnostic_id_t = 263;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STRING_CONCATENATION: pm_diagnostic_id_t = 264;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STRING_INTERPOLATED_TERM: pm_diagnostic_id_t = 265;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STRING_LITERAL_EOF: pm_diagnostic_id_t = 266;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_STRING_LITERAL_TERM: pm_diagnostic_id_t = 267;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_SYMBOL_INVALID: pm_diagnostic_id_t = 268;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_SYMBOL_TERM_DYNAMIC: pm_diagnostic_id_t = 269;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_SYMBOL_TERM_INTERPOLATED: pm_diagnostic_id_t = 270;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_TERNARY_COLON: pm_diagnostic_id_t = 271;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_TERNARY_EXPRESSION_FALSE: pm_diagnostic_id_t = 272;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_TERNARY_EXPRESSION_TRUE: pm_diagnostic_id_t = 273;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNARY_DISALLOWED: pm_diagnostic_id_t = 274;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNARY_RECEIVER: pm_diagnostic_id_t = 275;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNDEF_ARGUMENT: pm_diagnostic_id_t = 276;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_BLOCK_ARGUMENT: pm_diagnostic_id_t = 277;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_INDEX_BLOCK: pm_diagnostic_id_t = 278;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_INDEX_KEYWORDS: pm_diagnostic_id_t = 279;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_LABEL: pm_diagnostic_id_t = 280;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_MULTI_WRITE: pm_diagnostic_id_t = 281;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_PARAMETER_DEFAULT_VALUE: pm_diagnostic_id_t = 282;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_RANGE_OPERATOR: pm_diagnostic_id_t = 283;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_SAFE_NAVIGATION: pm_diagnostic_id_t = 284;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_TOKEN_CLOSE_CONTEXT: pm_diagnostic_id_t = 285;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNEXPECTED_TOKEN_IGNORE: pm_diagnostic_id_t = 286;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_UNTIL_TERM: pm_diagnostic_id_t = 287;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_VOID_EXPRESSION: pm_diagnostic_id_t = 288;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_WHILE_TERM: pm_diagnostic_id_t = 289;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_WRITE_TARGET_IN_METHOD: pm_diagnostic_id_t = 290;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_WRITE_TARGET_READONLY: pm_diagnostic_id_t = 291;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_WRITE_TARGET_UNEXPECTED: pm_diagnostic_id_t = 292;
#[doc = " These are the error diagnostics.\n"]
pub const PM_ERR_XSTRING_TERM: pm_diagnostic_id_t = 293;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_BINARY_OPERATOR: pm_diagnostic_id_t = 294;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_FIRST_ARGUMENT_MINUS: pm_diagnostic_id_t = 295;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_FIRST_ARGUMENT_PLUS: pm_diagnostic_id_t = 296;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_PREFIX_AMPERSAND: pm_diagnostic_id_t = 297;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_PREFIX_STAR: pm_diagnostic_id_t = 298;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_PREFIX_STAR_STAR: pm_diagnostic_id_t = 299;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_AMBIGUOUS_SLASH: pm_diagnostic_id_t = 300;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_COMPARISON_AFTER_COMPARISON: pm_diagnostic_id_t = 301;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_DOT_DOT_DOT_EOL: pm_diagnostic_id_t = 302;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_EQUAL_IN_CONDITIONAL: pm_diagnostic_id_t = 303;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_EQUAL_IN_CONDITIONAL_3_3: pm_diagnostic_id_t = 304;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_END_IN_METHOD: pm_diagnostic_id_t = 305;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_DUPLICATED_HASH_KEY: pm_diagnostic_id_t = 306;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_DUPLICATED_WHEN_CLAUSE: pm_diagnostic_id_t = 307;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_FLOAT_OUT_OF_RANGE: pm_diagnostic_id_t = 308;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_IGNORED_FROZEN_STRING_LITERAL: pm_diagnostic_id_t = 309;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_INDENTATION_MISMATCH: pm_diagnostic_id_t = 310;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_INTEGER_IN_FLIP_FLOP: pm_diagnostic_id_t = 311;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_INVALID_CHARACTER: pm_diagnostic_id_t = 312;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_INVALID_MAGIC_COMMENT_VALUE: pm_diagnostic_id_t = 313;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_INVALID_NUMBERED_REFERENCE: pm_diagnostic_id_t = 314;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_KEYWORD_EOL: pm_diagnostic_id_t = 315;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_LITERAL_IN_CONDITION_DEFAULT: pm_diagnostic_id_t = 316;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_LITERAL_IN_CONDITION_VERBOSE: pm_diagnostic_id_t = 317;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_SHAREABLE_CONSTANT_VALUE_LINE: pm_diagnostic_id_t = 318;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_SHEBANG_CARRIAGE_RETURN: pm_diagnostic_id_t = 319;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_UNEXPECTED_CARRIAGE_RETURN: pm_diagnostic_id_t = 320;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_UNREACHABLE_STATEMENT: pm_diagnostic_id_t = 321;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_UNUSED_LOCAL_VARIABLE: pm_diagnostic_id_t = 322;
#[doc = " These are the warning diagnostics.\n"]
pub const PM_WARN_VOID_STATEMENT: pm_diagnostic_id_t = 323;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_diagnostic_t"][::std::mem::size_of::<pm_diagnostic_t>() - 48usize];
    ["Alignment of pm_diagnostic_t"][::std::mem::align_of::<pm_diagnostic_t>() - 8usize];
    ["Offset of field: pm_diagnostic_t::node"]
        [::std::mem::offset_of!(pm_diagnostic_t, node) - 0usize];
    ["Offset of field: pm_diagnostic_t::location"]
        [::std::mem::offset_of!(pm_diagnostic_t, location) - 8usize];
    ["Offset of field: pm_diagnostic_t::diag_id"]
        [::std::mem::offset_of!(pm_diagnostic_t, diag_id) - 24usize];
    ["Offset of field: pm_diagnostic_t::message"]
        [::std::mem::offset_of!(pm_diagnostic_t, message) - 32usize];
    ["Offset of field: pm_diagnostic_t::owned"]
        [::std::mem::offset_of!(pm_diagnostic_t, owned) - 40usize];
    ["Offset of field: pm_diagnostic_t::level"]
        [::std::mem::offset_of!(pm_diagnostic_t, level) - 41usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_options_scope"][::std::mem::size_of::<pm_options_scope>() - 24usize];
    ["Alignment of pm_options_scope"][::std::mem::align_of::<pm_options_scope>() - 8usize];
    ["Offset of field: pm_options_scope::locals_count"]
        [::std::mem::offset_of!(pm_options_scope, locals_count) - 0usize];
    ["Offset of field: pm_options_scope::locals"]
        [::std::mem::offset_of!(pm_options_scope, locals) - 8usize];
    ["Offset of field: pm_options_scope::forwarding"]
        [::std::mem::offset_of!(pm_options_scope, forwarding) - 16usize];
};
#[doc = " If an explicit version is not provided, the current version of prism will be used.\n"]
pub const PM_OPTIONS_VERSION_UNSET: pm_options_version_t = 0;
#[doc = " The vendored version of prism in CRuby 3.3.x.\n"]
pub const PM_OPTIONS_VERSION_CRUBY_3_3: pm_options_version_t = 1;
#[doc = " The vendored version of prism in CRuby 3.4.x.\n"]
pub const PM_OPTIONS_VERSION_CRUBY_3_4: pm_options_version_t = 2;
#[doc = " The vendored version of prism in CRuby 4.0.x.\n"]
pub const PM_OPTIONS_VERSION_CRUBY_3_5: pm_options_version_t = 3;
#[doc = " The vendored version of prism in CRuby 4.0.x.\n"]
pub const PM_OPTIONS_VERSION_CRUBY_4_0: pm_options_version_t = 3;
#[doc = " The vendored version of prism in CRuby 4.1.x.\n"]
pub const PM_OPTIONS_VERSION_CRUBY_4_1: pm_options_version_t = 4;
#[doc = " The current version of prism.\n"]
pub const PM_OPTIONS_VERSION_LATEST: pm_options_version_t = 4;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_options"][::std::mem::size_of::<pm_options>() - 104usize];
    ["Alignment of pm_options"][::std::mem::align_of::<pm_options>() - 8usize];
    ["Offset of field: pm_options::shebang_callback"]
        [::std::mem::offset_of!(pm_options, shebang_callback) - 0usize];
    ["Offset of field: pm_options::shebang_callback_data"]
        [::std::mem::offset_of!(pm_options, shebang_callback_data) - 8usize];
    ["Offset of field: pm_options::filepath"]
        [::std::mem::offset_of!(pm_options, filepath) - 16usize];
    ["Offset of field: pm_options::line"][::std::mem::offset_of!(pm_options, line) - 40usize];
    ["Offset of field: pm_options::encoding"]
        [::std::mem::offset_of!(pm_options, encoding) - 48usize];
    ["Offset of field: pm_options::scopes_count"]
        [::std::mem::offset_of!(pm_options, scopes_count) - 72usize];
    ["Offset of field: pm_options::scopes"][::std::mem::offset_of!(pm_options, scopes) - 80usize];
    ["Offset of field: pm_options::version"][::std::mem::offset_of!(pm_options, version) - 88usize];
    ["Offset of field: pm_options::command_line"]
        [::std::mem::offset_of!(pm_options, command_line) - 92usize];
    ["Offset of field: pm_options::frozen_string_literal"]
        [::std::mem::offset_of!(pm_options, frozen_string_literal) - 93usize];
    ["Offset of field: pm_options::encoding_locked"]
        [::std::mem::offset_of!(pm_options, encoding_locked) - 94usize];
    ["Offset of field: pm_options::main_script"]
        [::std::mem::offset_of!(pm_options, main_script) - 95usize];
    ["Offset of field: pm_options::partial_script"]
        [::std::mem::offset_of!(pm_options, partial_script) - 96usize];
    ["Offset of field: pm_options::freeze"][::std::mem::offset_of!(pm_options, freeze) - 97usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_node_hash_t"][::std::mem::size_of::<pm_node_hash_t>() - 16usize];
    ["Alignment of pm_node_hash_t"][::std::mem::align_of::<pm_node_hash_t>() - 8usize];
    ["Offset of field: pm_node_hash_t::nodes"]
        [::std::mem::offset_of!(pm_node_hash_t, nodes) - 0usize];
    ["Offset of field: pm_node_hash_t::size"]
        [::std::mem::offset_of!(pm_node_hash_t, size) - 8usize];
    ["Offset of field: pm_node_hash_t::capacity"]
        [::std::mem::offset_of!(pm_node_hash_t, capacity) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_static_literals_t"][::std::mem::size_of::<pm_static_literals_t>() - 128usize];
    ["Alignment of pm_static_literals_t"][::std::mem::align_of::<pm_static_literals_t>() - 8usize];
    ["Offset of field: pm_static_literals_t::integer_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, integer_nodes) - 0usize];
    ["Offset of field: pm_static_literals_t::float_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, float_nodes) - 16usize];
    ["Offset of field: pm_static_literals_t::number_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, number_nodes) - 32usize];
    ["Offset of field: pm_static_literals_t::string_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, string_nodes) - 48usize];
    ["Offset of field: pm_static_literals_t::regexp_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, regexp_nodes) - 64usize];
    ["Offset of field: pm_static_literals_t::symbol_nodes"]
        [::std::mem::offset_of!(pm_static_literals_t, symbol_nodes) - 80usize];
    ["Offset of field: pm_static_literals_t::true_node"]
        [::std::mem::offset_of!(pm_static_literals_t, true_node) - 96usize];
    ["Offset of field: pm_static_literals_t::false_node"]
        [::std::mem::offset_of!(pm_static_literals_t, false_node) - 104usize];
    ["Offset of field: pm_static_literals_t::nil_node"]
        [::std::mem::offset_of!(pm_static_literals_t, nil_node) - 112usize];
    ["Offset of field: pm_static_literals_t::source_encoding_node"]
        [::std::mem::offset_of!(pm_static_literals_t, source_encoding_node) - 120usize];
};
pub const PM_LEX_STATE_NONE: pm_lex_state_t = 0;
pub const PM_LEX_STATE_BEG: pm_lex_state_t = 1;
pub const PM_LEX_STATE_END: pm_lex_state_t = 2;
pub const PM_LEX_STATE_ENDARG: pm_lex_state_t = 4;
pub const PM_LEX_STATE_ENDFN: pm_lex_state_t = 8;
pub const PM_LEX_STATE_ARG: pm_lex_state_t = 16;
pub const PM_LEX_STATE_CMDARG: pm_lex_state_t = 32;
pub const PM_LEX_STATE_MID: pm_lex_state_t = 64;
pub const PM_LEX_STATE_FNAME: pm_lex_state_t = 128;
pub const PM_LEX_STATE_DOT: pm_lex_state_t = 256;
pub const PM_LEX_STATE_CLASS: pm_lex_state_t = 512;
pub const PM_LEX_STATE_LABEL: pm_lex_state_t = 1024;
pub const PM_LEX_STATE_LABELED: pm_lex_state_t = 2048;
pub const PM_LEX_STATE_FITEM: pm_lex_state_t = 4096;
pub const PM_LEX_STATE_BEG_ANY: pm_lex_state_t = 577;
pub const PM_LEX_STATE_ARG_ANY: pm_lex_state_t = 48;
pub const PM_LEX_STATE_END_ANY: pm_lex_state_t = 14;
pub const PM_HEREDOC_QUOTE_NONE: pm_heredoc_quote_t = 0;
pub const PM_HEREDOC_QUOTE_SINGLE: pm_heredoc_quote_t = 39;
pub const PM_HEREDOC_QUOTE_DOUBLE: pm_heredoc_quote_t = 34;
pub const PM_HEREDOC_QUOTE_BACKTICK: pm_heredoc_quote_t = 96;
pub const PM_HEREDOC_INDENT_NONE: pm_heredoc_indent_t = 0;
pub const PM_HEREDOC_INDENT_DASH: pm_heredoc_indent_t = 1;
pub const PM_HEREDOC_INDENT_TILDE: pm_heredoc_indent_t = 2;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_heredoc_lex_mode_t"][::std::mem::size_of::<pm_heredoc_lex_mode_t>() - 24usize];
    ["Alignment of pm_heredoc_lex_mode_t"]
        [::std::mem::align_of::<pm_heredoc_lex_mode_t>() - 8usize];
    ["Offset of field: pm_heredoc_lex_mode_t::ident_start"]
        [::std::mem::offset_of!(pm_heredoc_lex_mode_t, ident_start) - 0usize];
    ["Offset of field: pm_heredoc_lex_mode_t::ident_length"]
        [::std::mem::offset_of!(pm_heredoc_lex_mode_t, ident_length) - 8usize];
    ["Offset of field: pm_heredoc_lex_mode_t::quote"]
        [::std::mem::offset_of!(pm_heredoc_lex_mode_t, quote) - 16usize];
    ["Offset of field: pm_heredoc_lex_mode_t::indent"]
        [::std::mem::offset_of!(pm_heredoc_lex_mode_t, indent) - 20usize];
};
#[doc = " This state is used when any given token is being lexed.\n"]
pub const PM_LEX_DEFAULT: pm_lex_mode__bindgen_ty_1 = 0;
#[doc = " This state is used when we're lexing as normal but inside an embedded\n expression of a string.\n"]
pub const PM_LEX_EMBEXPR: pm_lex_mode__bindgen_ty_1 = 1;
#[doc = " This state is used when we're lexing a variable that is embedded\n directly inside of a string with the # shorthand.\n"]
pub const PM_LEX_EMBVAR: pm_lex_mode__bindgen_ty_1 = 2;
#[doc = " This state is used when you are inside the content of a heredoc.\n"]
pub const PM_LEX_HEREDOC: pm_lex_mode__bindgen_ty_1 = 3;
#[doc = " This state is used when we are lexing a list of tokens, as in a %w\n word list literal or a %i symbol list literal.\n"]
pub const PM_LEX_LIST: pm_lex_mode__bindgen_ty_1 = 4;
#[doc = " This state is used when a regular expression has been begun and we\n are looking for the terminator.\n"]
pub const PM_LEX_REGEXP: pm_lex_mode__bindgen_ty_1 = 5;
#[doc = " This state is used when we are lexing a string or a string-like\n token, as in string content with either quote or an xstring.\n"]
pub const PM_LEX_STRING: pm_lex_mode__bindgen_ty_1 = 6;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_1>() - 24usize];
    ["Alignment of pm_lex_mode__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_1::nesting"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_1, nesting) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_1::interpolation"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_1, interpolation) - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_1::incrementor"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_1, incrementor) - 9usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_1::terminator"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_1, terminator) - 10usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_1::breakpoints"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_1, breakpoints) - 11usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_2>() - 24usize];
    ["Alignment of pm_lex_mode__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_2>() - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_2::nesting"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_2, nesting) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_2::incrementor"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_2, incrementor) - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_2::terminator"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_2, terminator) - 9usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_2::breakpoints"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_2, breakpoints) - 10usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::size_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_3>() - 24usize];
    ["Alignment of pm_lex_mode__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::align_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_3>() - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::nesting"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, nesting) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::interpolation"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, interpolation) - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::label_allowed"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, label_allowed) - 9usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::incrementor"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, incrementor) - 10usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::terminator"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, terminator) - 11usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_3::breakpoints"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_3, breakpoints) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode__bindgen_ty_2__bindgen_ty_4"]
        [::std::mem::size_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_4>() - 48usize];
    ["Alignment of pm_lex_mode__bindgen_ty_2__bindgen_ty_4"]
        [::std::mem::align_of::<pm_lex_mode__bindgen_ty_2__bindgen_ty_4>() - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_4::base"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_4, base) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_4::next_start"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2__bindgen_ty_4, next_start) - 24usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_4::common_whitespace"][::std::mem::offset_of!(
        pm_lex_mode__bindgen_ty_2__bindgen_ty_4,
        common_whitespace
    ) - 32usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2__bindgen_ty_4::line_continuation"][::std::mem::offset_of!(
        pm_lex_mode__bindgen_ty_2__bindgen_ty_4,
        line_continuation
    ) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode__bindgen_ty_2"]
        [::std::mem::size_of::<pm_lex_mode__bindgen_ty_2>() - 48usize];
    ["Alignment of pm_lex_mode__bindgen_ty_2"]
        [::std::mem::align_of::<pm_lex_mode__bindgen_ty_2>() - 8usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2::list"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2, list) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2::regexp"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2, regexp) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2::string"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2, string) - 0usize];
    ["Offset of field: pm_lex_mode__bindgen_ty_2::heredoc"]
        [::std::mem::offset_of!(pm_lex_mode__bindgen_ty_2, heredoc) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_mode"][::std::mem::size_of::<pm_lex_mode>() - 64usize];
    ["Alignment of pm_lex_mode"][::std::mem::align_of::<pm_lex_mode>() - 8usize];
    ["Offset of field: pm_lex_mode::mode"][::std::mem::offset_of!(pm_lex_mode, mode) - 0usize];
    ["Offset of field: pm_lex_mode::as_"][::std::mem::offset_of!(pm_lex_mode, as_) - 8usize];
    ["Offset of field: pm_lex_mode::prev"][::std::mem::offset_of!(pm_lex_mode, prev) - 56usize];
};
#[doc = " a null context, used for returning a value from a function\n"]
pub const PM_CONTEXT_NONE: pm_context_t = 0;
#[doc = " a begin statement\n"]
pub const PM_CONTEXT_BEGIN: pm_context_t = 1;
#[doc = " an ensure statement with an explicit begin\n"]
pub const PM_CONTEXT_BEGIN_ENSURE: pm_context_t = 2;
#[doc = " a rescue else statement with an explicit begin\n"]
pub const PM_CONTEXT_BEGIN_ELSE: pm_context_t = 3;
#[doc = " a rescue statement with an explicit begin\n"]
pub const PM_CONTEXT_BEGIN_RESCUE: pm_context_t = 4;
#[doc = " expressions in block arguments using braces\n"]
pub const PM_CONTEXT_BLOCK_BRACES: pm_context_t = 5;
#[doc = " expressions in block arguments using do..end\n"]
pub const PM_CONTEXT_BLOCK_KEYWORDS: pm_context_t = 6;
#[doc = " an ensure statement within a do..end block\n"]
pub const PM_CONTEXT_BLOCK_ENSURE: pm_context_t = 7;
#[doc = " a rescue else statement within a do..end block\n"]
pub const PM_CONTEXT_BLOCK_ELSE: pm_context_t = 8;
#[doc = " expressions in block parameters `foo do |...| end `\n"]
pub const PM_CONTEXT_BLOCK_PARAMETERS: pm_context_t = 9;
#[doc = " a rescue statement within a do..end block\n"]
pub const PM_CONTEXT_BLOCK_RESCUE: pm_context_t = 10;
#[doc = " a case when statements\n"]
pub const PM_CONTEXT_CASE_WHEN: pm_context_t = 11;
#[doc = " a case in statements\n"]
pub const PM_CONTEXT_CASE_IN: pm_context_t = 12;
#[doc = " a class declaration\n"]
pub const PM_CONTEXT_CLASS: pm_context_t = 13;
#[doc = " an ensure statement within a class statement\n"]
pub const PM_CONTEXT_CLASS_ENSURE: pm_context_t = 14;
#[doc = " a rescue else statement within a class statement\n"]
pub const PM_CONTEXT_CLASS_ELSE: pm_context_t = 15;
#[doc = " a rescue statement within a class statement\n"]
pub const PM_CONTEXT_CLASS_RESCUE: pm_context_t = 16;
#[doc = " a method definition\n"]
pub const PM_CONTEXT_DEF: pm_context_t = 17;
#[doc = " an ensure statement within a method definition\n"]
pub const PM_CONTEXT_DEF_ENSURE: pm_context_t = 18;
#[doc = " a rescue else statement within a method definition\n"]
pub const PM_CONTEXT_DEF_ELSE: pm_context_t = 19;
#[doc = " a rescue statement within a method definition\n"]
pub const PM_CONTEXT_DEF_RESCUE: pm_context_t = 20;
#[doc = " a method definition's parameters\n"]
pub const PM_CONTEXT_DEF_PARAMS: pm_context_t = 21;
#[doc = " a defined? expression\n"]
pub const PM_CONTEXT_DEFINED: pm_context_t = 22;
#[doc = " a method definition's default parameter\n"]
pub const PM_CONTEXT_DEFAULT_PARAMS: pm_context_t = 23;
#[doc = " an else clause\n"]
pub const PM_CONTEXT_ELSE: pm_context_t = 24;
#[doc = " an elsif clause\n"]
pub const PM_CONTEXT_ELSIF: pm_context_t = 25;
#[doc = " an interpolated expression\n"]
pub const PM_CONTEXT_EMBEXPR: pm_context_t = 26;
#[doc = " a for loop\n"]
pub const PM_CONTEXT_FOR: pm_context_t = 27;
#[doc = " a for loop's index\n"]
pub const PM_CONTEXT_FOR_INDEX: pm_context_t = 28;
#[doc = " an if statement\n"]
pub const PM_CONTEXT_IF: pm_context_t = 29;
#[doc = " a lambda expression with braces\n"]
pub const PM_CONTEXT_LAMBDA_BRACES: pm_context_t = 30;
#[doc = " a lambda expression with do..end\n"]
pub const PM_CONTEXT_LAMBDA_DO_END: pm_context_t = 31;
#[doc = " an ensure statement within a lambda expression\n"]
pub const PM_CONTEXT_LAMBDA_ENSURE: pm_context_t = 32;
#[doc = " a rescue else statement within a lambda expression\n"]
pub const PM_CONTEXT_LAMBDA_ELSE: pm_context_t = 33;
#[doc = " a rescue statement within a lambda expression\n"]
pub const PM_CONTEXT_LAMBDA_RESCUE: pm_context_t = 34;
#[doc = " the predicate clause of a loop statement\n"]
pub const PM_CONTEXT_LOOP_PREDICATE: pm_context_t = 35;
#[doc = " the top level context\n"]
pub const PM_CONTEXT_MAIN: pm_context_t = 36;
#[doc = " a module declaration\n"]
pub const PM_CONTEXT_MODULE: pm_context_t = 37;
#[doc = " an ensure statement within a module statement\n"]
pub const PM_CONTEXT_MODULE_ENSURE: pm_context_t = 38;
#[doc = " a rescue else statement within a module statement\n"]
pub const PM_CONTEXT_MODULE_ELSE: pm_context_t = 39;
#[doc = " a rescue statement within a module statement\n"]
pub const PM_CONTEXT_MODULE_RESCUE: pm_context_t = 40;
#[doc = " a multiple target expression\n"]
pub const PM_CONTEXT_MULTI_TARGET: pm_context_t = 41;
#[doc = " a parenthesized expression\n"]
pub const PM_CONTEXT_PARENS: pm_context_t = 42;
#[doc = " an END block\n"]
pub const PM_CONTEXT_POSTEXE: pm_context_t = 43;
#[doc = " a predicate inside an if/elsif/unless statement\n"]
pub const PM_CONTEXT_PREDICATE: pm_context_t = 44;
#[doc = " a BEGIN block\n"]
pub const PM_CONTEXT_PREEXE: pm_context_t = 45;
#[doc = " a modifier rescue clause\n"]
pub const PM_CONTEXT_RESCUE_MODIFIER: pm_context_t = 46;
#[doc = " a singleton class definition\n"]
pub const PM_CONTEXT_SCLASS: pm_context_t = 47;
#[doc = " an ensure statement with a singleton class\n"]
pub const PM_CONTEXT_SCLASS_ENSURE: pm_context_t = 48;
#[doc = " a rescue else statement with a singleton class\n"]
pub const PM_CONTEXT_SCLASS_ELSE: pm_context_t = 49;
#[doc = " a rescue statement with a singleton class\n"]
pub const PM_CONTEXT_SCLASS_RESCUE: pm_context_t = 50;
#[doc = " a ternary expression\n"]
pub const PM_CONTEXT_TERNARY: pm_context_t = 51;
#[doc = " an unless statement\n"]
pub const PM_CONTEXT_UNLESS: pm_context_t = 52;
#[doc = " an until statement\n"]
pub const PM_CONTEXT_UNTIL: pm_context_t = 53;
#[doc = " a while statement\n"]
pub const PM_CONTEXT_WHILE: pm_context_t = 54;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_context_node"][::std::mem::size_of::<pm_context_node>() - 16usize];
    ["Alignment of pm_context_node"][::std::mem::align_of::<pm_context_node>() - 8usize];
    ["Offset of field: pm_context_node::context"]
        [::std::mem::offset_of!(pm_context_node, context) - 0usize];
    ["Offset of field: pm_context_node::prev"]
        [::std::mem::offset_of!(pm_context_node, prev) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_comment"][::std::mem::size_of::<pm_comment>() - 32usize];
    ["Alignment of pm_comment"][::std::mem::align_of::<pm_comment>() - 8usize];
    ["Offset of field: pm_comment::node"][::std::mem::offset_of!(pm_comment, node) - 0usize];
    ["Offset of field: pm_comment::location"]
        [::std::mem::offset_of!(pm_comment, location) - 8usize];
    ["Offset of field: pm_comment::type_"][::std::mem::offset_of!(pm_comment, type_) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_magic_comment_t"][::std::mem::size_of::<pm_magic_comment_t>() - 32usize];
    ["Alignment of pm_magic_comment_t"][::std::mem::align_of::<pm_magic_comment_t>() - 8usize];
    ["Offset of field: pm_magic_comment_t::node"]
        [::std::mem::offset_of!(pm_magic_comment_t, node) - 0usize];
    ["Offset of field: pm_magic_comment_t::key_start"]
        [::std::mem::offset_of!(pm_magic_comment_t, key_start) - 8usize];
    ["Offset of field: pm_magic_comment_t::value_start"]
        [::std::mem::offset_of!(pm_magic_comment_t, value_start) - 16usize];
    ["Offset of field: pm_magic_comment_t::key_length"]
        [::std::mem::offset_of!(pm_magic_comment_t, key_length) - 24usize];
    ["Offset of field: pm_magic_comment_t::value_length"]
        [::std::mem::offset_of!(pm_magic_comment_t, value_length) - 28usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_lex_callback_t"][::std::mem::size_of::<pm_lex_callback_t>() - 16usize];
    ["Alignment of pm_lex_callback_t"][::std::mem::align_of::<pm_lex_callback_t>() - 8usize];
    ["Offset of field: pm_lex_callback_t::data"]
        [::std::mem::offset_of!(pm_lex_callback_t, data) - 0usize];
    ["Offset of field: pm_lex_callback_t::callback"]
        [::std::mem::offset_of!(pm_lex_callback_t, callback) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_local_t"][::std::mem::size_of::<pm_local_t>() - 40usize];
    ["Alignment of pm_local_t"][::std::mem::align_of::<pm_local_t>() - 8usize];
    ["Offset of field: pm_local_t::name"][::std::mem::offset_of!(pm_local_t, name) - 0usize];
    ["Offset of field: pm_local_t::location"]
        [::std::mem::offset_of!(pm_local_t, location) - 8usize];
    ["Offset of field: pm_local_t::index"][::std::mem::offset_of!(pm_local_t, index) - 24usize];
    ["Offset of field: pm_local_t::reads"][::std::mem::offset_of!(pm_local_t, reads) - 28usize];
    ["Offset of field: pm_local_t::hash"][::std::mem::offset_of!(pm_local_t, hash) - 32usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_locals"][::std::mem::size_of::<pm_locals>() - 16usize];
    ["Alignment of pm_locals"][::std::mem::align_of::<pm_locals>() - 8usize];
    ["Offset of field: pm_locals::size"][::std::mem::offset_of!(pm_locals, size) - 0usize];
    ["Offset of field: pm_locals::capacity"][::std::mem::offset_of!(pm_locals, capacity) - 4usize];
    ["Offset of field: pm_locals::locals"][::std::mem::offset_of!(pm_locals, locals) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_scope"][::std::mem::size_of::<pm_scope>() - 56usize];
    ["Alignment of pm_scope"][::std::mem::align_of::<pm_scope>() - 8usize];
    ["Offset of field: pm_scope::previous"][::std::mem::offset_of!(pm_scope, previous) - 0usize];
    ["Offset of field: pm_scope::locals"][::std::mem::offset_of!(pm_scope, locals) - 8usize];
    ["Offset of field: pm_scope::implicit_parameters"]
        [::std::mem::offset_of!(pm_scope, implicit_parameters) - 24usize];
    ["Offset of field: pm_scope::parameters"]
        [::std::mem::offset_of!(pm_scope, parameters) - 48usize];
    ["Offset of field: pm_scope::shareable_constant"]
        [::std::mem::offset_of!(pm_scope, shareable_constant) - 49usize];
    ["Offset of field: pm_scope::closed"][::std::mem::offset_of!(pm_scope, closed) - 50usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_parser__bindgen_ty_1"]
        [::std::mem::size_of::<pm_parser__bindgen_ty_1>() - 272usize];
    ["Alignment of pm_parser__bindgen_ty_1"]
        [::std::mem::align_of::<pm_parser__bindgen_ty_1>() - 8usize];
    ["Offset of field: pm_parser__bindgen_ty_1::current"]
        [::std::mem::offset_of!(pm_parser__bindgen_ty_1, current) - 0usize];
    ["Offset of field: pm_parser__bindgen_ty_1::stack"]
        [::std::mem::offset_of!(pm_parser__bindgen_ty_1, stack) - 8usize];
    ["Offset of field: pm_parser__bindgen_ty_1::index"]
        [::std::mem::offset_of!(pm_parser__bindgen_ty_1, index) - 264usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pm_parser"][::std::mem::size_of::<pm_parser>() - 712usize];
    ["Alignment of pm_parser"][::std::mem::align_of::<pm_parser>() - 8usize];
    ["Offset of field: pm_parser::node_id"][::std::mem::offset_of!(pm_parser, node_id) - 0usize];
    ["Offset of field: pm_parser::lex_state"]
        [::std::mem::offset_of!(pm_parser, lex_state) - 4usize];
    ["Offset of field: pm_parser::enclosure_nesting"]
        [::std::mem::offset_of!(pm_parser, enclosure_nesting) - 8usize];
    ["Offset of field: pm_parser::lambda_enclosure_nesting"]
        [::std::mem::offset_of!(pm_parser, lambda_enclosure_nesting) - 12usize];
    ["Offset of field: pm_parser::brace_nesting"]
        [::std::mem::offset_of!(pm_parser, brace_nesting) - 16usize];
    ["Offset of field: pm_parser::do_loop_stack"]
        [::std::mem::offset_of!(pm_parser, do_loop_stack) - 20usize];
    ["Offset of field: pm_parser::accepts_block_stack"]
        [::std::mem::offset_of!(pm_parser, accepts_block_stack) - 24usize];
    ["Offset of field: pm_parser::lex_modes"]
        [::std::mem::offset_of!(pm_parser, lex_modes) - 32usize];
    ["Offset of field: pm_parser::start"][::std::mem::offset_of!(pm_parser, start) - 304usize];
    ["Offset of field: pm_parser::end"][::std::mem::offset_of!(pm_parser, end) - 312usize];
    ["Offset of field: pm_parser::previous"]
        [::std::mem::offset_of!(pm_parser, previous) - 320usize];
    ["Offset of field: pm_parser::current"][::std::mem::offset_of!(pm_parser, current) - 344usize];
    ["Offset of field: pm_parser::next_start"]
        [::std::mem::offset_of!(pm_parser, next_start) - 368usize];
    ["Offset of field: pm_parser::heredoc_end"]
        [::std::mem::offset_of!(pm_parser, heredoc_end) - 376usize];
    ["Offset of field: pm_parser::comment_list"]
        [::std::mem::offset_of!(pm_parser, comment_list) - 384usize];
    ["Offset of field: pm_parser::magic_comment_list"]
        [::std::mem::offset_of!(pm_parser, magic_comment_list) - 408usize];
    ["Offset of field: pm_parser::data_loc"]
        [::std::mem::offset_of!(pm_parser, data_loc) - 432usize];
    ["Offset of field: pm_parser::warning_list"]
        [::std::mem::offset_of!(pm_parser, warning_list) - 448usize];
    ["Offset of field: pm_parser::error_list"]
        [::std::mem::offset_of!(pm_parser, error_list) - 472usize];
    ["Offset of field: pm_parser::current_scope"]
        [::std::mem::offset_of!(pm_parser, current_scope) - 496usize];
    ["Offset of field: pm_parser::current_context"]
        [::std::mem::offset_of!(pm_parser, current_context) - 504usize];
    ["Offset of field: pm_parser::current_hash_keys"]
        [::std::mem::offset_of!(pm_parser, current_hash_keys) - 512usize];
    ["Offset of field: pm_parser::encoding"]
        [::std::mem::offset_of!(pm_parser, encoding) - 520usize];
    ["Offset of field: pm_parser::encoding_changed_callback"]
        [::std::mem::offset_of!(pm_parser, encoding_changed_callback) - 528usize];
    ["Offset of field: pm_parser::encoding_comment_start"]
        [::std::mem::offset_of!(pm_parser, encoding_comment_start) - 536usize];
    ["Offset of field: pm_parser::lex_callback"]
        [::std::mem::offset_of!(pm_parser, lex_callback) - 544usize];
    ["Offset of field: pm_parser::filepath"]
        [::std::mem::offset_of!(pm_parser, filepath) - 552usize];
    ["Offset of field: pm_parser::constant_pool"]
        [::std::mem::offset_of!(pm_parser, constant_pool) - 576usize];
    ["Offset of field: pm_parser::newline_list"]
        [::std::mem::offset_of!(pm_parser, newline_list) - 600usize];
    ["Offset of field: pm_parser::integer_base"]
        [::std::mem::offset_of!(pm_parser, integer_base) - 632usize];
    ["Offset of field: pm_parser::current_string"]
        [::std::mem::offset_of!(pm_parser, current_string) - 640usize];
    ["Offset of field: pm_parser::start_line"]
        [::std::mem::offset_of!(pm_parser, start_line) - 664usize];
    ["Offset of field: pm_parser::explicit_encoding"]
        [::std::mem::offset_of!(pm_parser, explicit_encoding) - 672usize];
    ["Offset of field: pm_parser::current_block_exits"]
        [::std::mem::offset_of!(pm_parser, current_block_exits) - 680usize];
    ["Offset of field: pm_parser::version"][::std::mem::offset_of!(pm_parser, version) - 688usize];
    ["Offset of field: pm_parser::command_line"]
        [::std::mem::offset_of!(pm_parser, command_line) - 692usize];
    ["Offset of field: pm_parser::frozen_string_literal"]
        [::std::mem::offset_of!(pm_parser, frozen_string_literal) - 693usize];
    ["Offset of field: pm_parser::parsing_eval"]
        [::std::mem::offset_of!(pm_parser, parsing_eval) - 694usize];
    ["Offset of field: pm_parser::partial_script"]
        [::std::mem::offset_of!(pm_parser, partial_script) - 695usize];
    ["Offset of field: pm_parser::command_start"]
        [::std::mem::offset_of!(pm_parser, command_start) - 696usize];
    ["Offset of field: pm_parser::recovering"]
        [::std::mem::offset_of!(pm_parser, recovering) - 697usize];
    ["Offset of field: pm_parser::encoding_locked"]
        [::std::mem::offset_of!(pm_parser, encoding_locked) - 698usize];
    ["Offset of field: pm_parser::encoding_changed"]
        [::std::mem::offset_of!(pm_parser, encoding_changed) - 699usize];
    ["Offset of field: pm_parser::pattern_matching_newlines"]
        [::std::mem::offset_of!(pm_parser, pattern_matching_newlines) - 700usize];
    ["Offset of field: pm_parser::in_keyword_arg"]
        [::std::mem::offset_of!(pm_parser, in_keyword_arg) - 701usize];
    ["Offset of field: pm_parser::semantic_token_seen"]
        [::std::mem::offset_of!(pm_parser, semantic_token_seen) - 702usize];
    ["Offset of field: pm_parser::current_regular_expression_ascii_only"]
        [::std::mem::offset_of!(pm_parser, current_regular_expression_ascii_only) - 703usize];
    ["Offset of field: pm_parser::warn_mismatched_indentation"]
        [::std::mem::offset_of!(pm_parser, warn_mismatched_indentation) - 704usize];
};
#[repr(u32)]
#[non_exhaustive]
#[doc = " This enum represents every type of node in the Ruby syntax tree.\n"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum pm_node_type {
    #[doc = " AliasGlobalVariableNode\n"]
    PM_ALIAS_GLOBAL_VARIABLE_NODE = 1,
    #[doc = " AliasMethodNode\n"]
    PM_ALIAS_METHOD_NODE = 2,
    #[doc = " AlternationPatternNode\n"]
    PM_ALTERNATION_PATTERN_NODE = 3,
    #[doc = " AndNode\n"]
    PM_AND_NODE = 4,
    #[doc = " ArgumentsNode\n"]
    PM_ARGUMENTS_NODE = 5,
    #[doc = " ArrayNode\n"]
    PM_ARRAY_NODE = 6,
    #[doc = " ArrayPatternNode\n"]
    PM_ARRAY_PATTERN_NODE = 7,
    #[doc = " AssocNode\n"]
    PM_ASSOC_NODE = 8,
    #[doc = " AssocSplatNode\n"]
    PM_ASSOC_SPLAT_NODE = 9,
    #[doc = " BackReferenceReadNode\n"]
    PM_BACK_REFERENCE_READ_NODE = 10,
    #[doc = " BeginNode\n"]
